ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
/***************************************************************************//**
* \file cyip_ble.h
*
* \brief
* BLE IP definitions
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CYIP_BLE_H_
#define _CYIP_BLE_H_

#include "cyip_headers.h"

/* =========================================================================================================================== */
/* ================                                            BLE                                            ================ */
/* =========================================================================================================================== */

#define BLE_RCB_RCBLL_SECTION_SIZE  0x00000100UL
#define BLE_RCB_SECTION_SIZE        0x00000200UL
#define BLE_BLELL_SECTION_SIZE      0x0001E000UL
#define BLE_BLESS_SECTION_SIZE      0x00001000UL
#define BLE_SECTION_SIZE            0x00020000UL

/**
  * \brief Radio Control Bus (RCB) & Link Layer controller (BLE_RCB_RCBLL)
  */
typedef struct {
  __IOM uint32_t CTRL;                          /*!< 0x00000000 RCB LL control register.                                       */
   __IM uint32_t RESERVED[3];
  __IOM uint32_t INTR;                          /*!< 0x00000010 Master interrupt request register.                             */
  __IOM uint32_t INTR_SET;                      /*!< 0x00000014 Master interrupt set request register                          */
  __IOM uint32_t INTR_MASK;                     /*!< 0x00000018 Master interrupt mask register.                                */
   __IM uint32_t INTR_MASKED;                   /*!< 0x0000001C Master interrupt masked request register                       */
  __IOM uint32_t RADIO_REG1_ADDR;               /*!< 0x00000020 Address of Register#1 in Radio  (MDON)                         */
  __IOM uint32_t RADIO_REG2_ADDR;               /*!< 0x00000024 Address of Register#2 in Radio  (RSSI)                         */
  __IOM uint32_t RADIO_REG3_ADDR;               /*!< 0x00000028 Address of Register#3 in Radio  (ACCL)                         */
  __IOM uint32_t RADIO_REG4_ADDR;               /*!< 0x0000002C Address of Register#4 in Radio  (ACCH)                         */
  __IOM uint32_t RADIO_REG5_ADDR;               /*!< 0x00000030 Address of Register#5 in Radio  (RSSI ENERGY)                  */
   __IM uint32_t RESERVED1[3];
  __IOM uint32_t CPU_WRITE_REG;                 /*!< 0x00000040 N/A                                                            */
  __IOM uint32_t CPU_READ_REG;                  /*!< 0x00000044 N/A                                                            */
   __IM uint32_t RESERVED2[46];
} BLE_RCB_RCBLL_Type;                           /*!< Size = 72 (0x48)                                                          */

/**
  * \brief Radio Control Bus (RCB) controller (BLE_RCB)
  */
typedef struct {
  __IOM uint32_t CTRL;                          /*!< 0x00000000 RCB control register.                                          */
   __IM uint32_t STATUS;                        /*!< 0x00000004 RCB status register.                                           */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t TX_CTRL;                       /*!< 0x00000010 Transmitter control register.                                  */
  __IOM uint32_t TX_FIFO_CTRL;                  /*!< 0x00000014 Transmitter FIFO control register.                             */
   __IM uint32_t TX_FIFO_STATUS;                /*!< 0x00000018 Transmitter FIFO status register.                              */
   __OM uint32_t TX_FIFO_WR;                    /*!< 0x0000001C Transmitter FIFO write register.                               */
  __IOM uint32_t RX_CTRL;                       /*!< 0x00000020 Receiver control register.                                     */
  __IOM uint32_t RX_FIFO_CTRL;                  /*!< 0x00000024 Receiver FIFO control register.                                */
   __IM uint32_t RX_FIFO_STATUS;                /*!< 0x00000028 Receiver FIFO status register.                                 */
   __IM uint32_t RX_FIFO_RD;                    /*!< 0x0000002C Receiver FIFO read register.                                   */
   __IM uint32_t RX_FIFO_RD_SILENT;             /*!< 0x00000030 Receiver FIFO read register.                                   */
   __IM uint32_t RESERVED1[3];
  __IOM uint32_t INTR;                          /*!< 0x00000040 Master interrupt request register.                             */
  __IOM uint32_t INTR_SET;                      /*!< 0x00000044 Master interrupt set request register                          */
  __IOM uint32_t INTR_MASK;                     /*!< 0x00000048 Master interrupt mask register.                                */
   __IM uint32_t INTR_MASKED;                   /*!< 0x0000004C Master interrupt masked request register                       */
   __IM uint32_t RESERVED2[44];
        BLE_RCB_RCBLL_Type RCBLL;               /*!< 0x00000100 Radio Control Bus (RCB) & Link Layer controller                */
} BLE_RCB_Type;                                 /*!< Size = 512 (0x200)                                                        */

/**
  * \brief Bluetooth Low Energy Link Layer (BLE_BLELL)
  */
typedef struct {
   __OM uint32_t COMMAND_REGISTER;              /*!< 0x00000000 Instruction Register                                           */
   __IM uint32_t RESERVED;
  __IOM uint32_t EVENT_INTR;                    /*!< 0x00000008 Event(Interrupt) status and Clear register                     */
   __IM uint32_t RESERVED1;
  __IOM uint32_t EVENT_ENABLE;                  /*!< 0x00000010 Event indications enable.                                      */
   __IM uint32_t RESERVED2;
  __IOM uint32_t ADV_PARAMS;                    /*!< 0x00000018 Advertising parameters register.                               */
  __IOM uint32_t ADV_INTERVAL_TIMEOUT;          /*!< 0x0000001C Advertising interval register.                                 */
  __IOM uint32_t ADV_INTR;                      /*!< 0x00000020 Advertising interrupt status and Clear register                */
   __IM uint32_t ADV_NEXT_INSTANT;              /*!< 0x00000024 Advertising next instant.                                      */
  __IOM uint32_t SCAN_INTERVAL;                 /*!< 0x00000028 Scan Interval Register                                         */
  __IOM uint32_t SCAN_WINDOW;                   /*!< 0x0000002C Scan window Register                                           */
  __IOM uint32_t SCAN_PARAM;                    /*!< 0x00000030 Scanning parameters register                                   */
   __IM uint32_t RESERVED3;
  __IOM uint32_t SCAN_INTR;                     /*!< 0x00000038 Scan interrupt status and Clear register                       */
   __IM uint32_t SCAN_NEXT_INSTANT;             /*!< 0x0000003C Advertising next instant.                                      */
  __IOM uint32_t INIT_INTERVAL;                 /*!< 0x00000040 Initiator Interval Register                                    */
  __IOM uint32_t INIT_WINDOW;                   /*!< 0x00000044 Initiator window Register                                      */
  __IOM uint32_t INIT_PARAM;                    /*!< 0x00000048 Initiator parameters register                                  */
   __IM uint32_t RESERVED4;
  __IOM uint32_t INIT_INTR;                     /*!< 0x00000050 Scan interrupt status and Clear register                       */
   __IM uint32_t INIT_NEXT_INSTANT;             /*!< 0x00000054 Initiator next instant.                                        */
  __IOM uint32_t DEVICE_RAND_ADDR_L;            /*!< 0x00000058 Lower 16 bit random address of the device.                     */
  __IOM uint32_t DEVICE_RAND_ADDR_M;            /*!< 0x0000005C Middle 16 bit random address of the device.                    */
  __IOM uint32_t DEVICE_RAND_ADDR_H;            /*!< 0x00000060 Higher 16 bit random address of the device.                    */
   __IM uint32_t RESERVED5;
  __IOM uint32_t PEER_ADDR_L;                   /*!< 0x00000068 Lower 16 bit address of the peer device.                       */
  __IOM uint32_t PEER_ADDR_M;                   /*!< 0x0000006C Middle 16 bit address of the peer device.                      */
  __IOM uint32_t PEER_ADDR_H;                   /*!< 0x00000070 Higher 16 bit address of the peer device.                      */
   __IM uint32_t RESERVED6;
  __IOM uint32_t WL_ADDR_TYPE;                  /*!< 0x00000078 whitelist address type                                         */
  __IOM uint32_t WL_ENABLE;                     /*!< 0x0000007C whitelist valid entry bit                                      */
  __IOM uint32_t TRANSMIT_WINDOW_OFFSET;        /*!< 0x00000080 Transmit window offset                                         */
  __IOM uint32_t TRANSMIT_WINDOW_SIZE;          /*!< 0x00000084 Transmit window size                                           */
  __IOM uint32_t DATA_CHANNELS_L0;              /*!< 0x00000088 Data channel map 0 (lower word)                                */
  __IOM uint32_t DATA_CHANNELS_M0;              /*!< 0x0000008C Data channel map 0 (middle word)                               */
  __IOM uint32_t DATA_CHANNELS_H0;              /*!< 0x00000090 Data channel map 0 (upper word)                                */
   __IM uint32_t RESERVED7;
  __IOM uint32_t DATA_CHANNELS_L1;              /*!< 0x00000098 Data channel map 1 (lower word)                                */
  __IOM uint32_t DATA_CHANNELS_M1;              /*!< 0x0000009C Data channel map 1 (middle word)                               */
  __IOM uint32_t DATA_CHANNELS_H1;              /*!< 0x000000A0 Data channel map 1 (upper word)                                */
   __IM uint32_t RESERVED8;
  __IOM uint32_t CONN_INTR;                     /*!< 0x000000A8 Connection interrupt status and Clear register                 */
   __IM uint32_t CONN_STATUS;                   /*!< 0x000000AC Connection channel status                                      */
  __IOM uint32_t CONN_INDEX;                    /*!< 0x000000B0 Connection Index register                                      */
   __IM uint32_t RESERVED9;
  __IOM uint32_t WAKEUP_CONFIG;                 /*!< 0x000000B8 Wakeup configuration                                           */
   __IM uint32_t RESERVED10;
  __IOM uint32_t WAKEUP_CONTROL;                /*!< 0x000000C0 Wakeup control                                                 */
  __IOM uint32_t CLOCK_CONFIG;                  /*!< 0x000000C4 Clock control                                                  */
   __IM uint32_t TIM_COUNTER_L;                 /*!< 0x000000C8 Reference Clock                                                */
  __IOM uint32_t WAKEUP_CONFIG_EXTD;            /*!< 0x000000CC Wakeup configuration extended                                  */
   __IM uint32_t RESERVED11[2];
  __IOM uint32_t POC_REG__TIM_CONTROL;          /*!< 0x000000D8 BLE Time Control                                               */
   __IM uint32_t RESERVED12;
  __IOM uint32_t ADV_TX_DATA_FIFO;              /*!< 0x000000E0 Advertising data transmit FIFO. Access ADVCH_TX_FIFO.          */
   __IM uint32_t RESERVED13;
  __IOM uint32_t ADV_SCN_RSP_TX_FIFO;           /*!< 0x000000E8 Advertising scan response data transmit FIFO. Access
                                                                ADVCH_TX_FIFO.                                                 */
   __IM uint32_t RESERVED14[3];
   __IM uint32_t INIT_SCN_ADV_RX_FIFO;          /*!< 0x000000F8 advertising scan response data receive data FIFO. Access
                                                                ADVRX_FIFO.                                                    */
   __IM uint32_t RESERVED15;
  __IOM uint32_t CONN_INTERVAL;                 /*!< 0x00000100 Connection Interval                                            */
  __IOM uint32_t SUP_TIMEOUT;                   /*!< 0x00000104 Supervision timeout                                            */
  __IOM uint32_t SLAVE_LATENCY;                 /*!< 0x00000108 Slave Latency                                                  */
  __IOM uint32_t CE_LENGTH;                     /*!< 0x0000010C Connection event length                                        */
  __IOM uint32_t PDU_ACCESS_ADDR_L_REGISTER;    /*!< 0x00000110 Access address (lower)                                         */
  __IOM uint32_t PDU_ACCESS_ADDR_H_REGISTER;    /*!< 0x00000114 Access address (upper)                                         */
  __IOM uint32_t CONN_CE_INSTANT;               /*!< 0x00000118 Connection event instant                                       */
  __IOM uint32_t CE_CNFG_STS_REGISTER;          /*!< 0x0000011C connection configuration & status register                     */
   __IM uint32_t NEXT_CE_INSTANT;               /*!< 0x00000120 Next connection event instant                                  */
   __IM uint32_t CONN_CE_COUNTER;               /*!< 0x00000124 connection event counter                                       */
  __IOM uint32_t DATA_LIST_SENT_UPDATE__STATUS; /*!< 0x00000128 data list sent update and status                               */
  __IOM uint32_t DATA_LIST_ACK_UPDATE__STATUS;  /*!< 0x0000012C data list ack update and status                                */
  __IOM uint32_t CE_CNFG_STS_REGISTER_EXT;      /*!< 0x00000130 connection configuration & status register                     */
  __IOM uint32_t CONN_EXT_INTR;                 /*!< 0x00000134 Connection extended interrupt status and Clear register        */
  __IOM uint32_t CONN_EXT_INTR_MASK;            /*!< 0x00000138 Connection Extended Interrupt mask                             */
   __IM uint32_t RESERVED16;
  __IOM uint32_t DATA_MEM_DESCRIPTOR[5];        /*!< 0x00000140 Data buffer descriptor 0 to 4                                  */
   __IM uint32_t RESERVED17[3];
  __IOM uint32_t WINDOW_WIDEN_INTVL;            /*!< 0x00000160 Window widen for interval                                      */
  __IOM uint32_t WINDOW_WIDEN_WINOFF;           /*!< 0x00000164 Window widen for offset                                        */
   __IM uint32_t RESERVED18[2];
  __IOM uint32_t LE_RF_TEST_MODE;               /*!< 0x00000170 Direct Test Mode control                                       */
   __IM uint32_t DTM_RX_PKT_COUNT;              /*!< 0x00000174 Direct Test Mode receive packet count                          */
  __IOM uint32_t LE_RF_TEST_MODE_EXT;           /*!< 0x00000178 Direct Test Mode control                                       */
   __IM uint32_t RESERVED19[3];
   __IM uint32_t TXRX_HOP;                      /*!< 0x00000188 Channel Address register                                       */
   __IM uint32_t RESERVED20;
  __IOM uint32_t TX_RX_ON_DELAY;                /*!< 0x00000190 Transmit/Receive data delay                                    */
   __IM uint32_t RESERVED21[5];
  __IOM uint32_t ADV_ACCADDR_L;                 /*!< 0x000001A8 ADV packet access code low word                                */
  __IOM uint32_t ADV_ACCADDR_H;                 /*!< 0x000001AC ADV packet access code high word                               */
  __IOM uint32_t ADV_CH_TX_POWER_LVL_LS;        /*!< 0x000001B0 Advertising channel transmit power setting                     */
  __IOM uint32_t ADV_CH_TX_POWER_LVL_MS;        /*!< 0x000001B4 Advertising channel transmit power setting extension           */
  __IOM uint32_t CONN_CH_TX_POWER_LVL_LS;       /*!< 0x000001B8 Connection channel transmit power setting                      */
  __IOM uint32_t CONN_CH_TX_POWER_LVL_MS;       /*!< 0x000001BC Connection channel transmit power setting extension            */
  __IOM uint32_t DEV_PUB_ADDR_L;                /*!< 0x000001C0 Device public address lower register                           */
  __IOM uint32_t DEV_PUB_ADDR_M;                /*!< 0x000001C4 Device public address middle register                          */
  __IOM uint32_t DEV_PUB_ADDR_H;                /*!< 0x000001C8 Device public address higher register                          */
   __IM uint32_t RESERVED22;
  __IOM uint32_t OFFSET_TO_FIRST_INSTANT;       /*!< 0x000001D0 Offset to first instant                                        */
  __IOM uint32_t ADV_CONFIG;                    /*!< 0x000001D4 Advertiser configuration register                              */
  __IOM uint32_t SCAN_CONFIG;                   /*!< 0x000001D8 Scan configuration register                                    */
  __IOM uint32_t INIT_CONFIG;                   /*!< 0x000001DC Initiator configuration register                               */
  __IOM uint32_t CONN_CONFIG;                   /*!< 0x000001E0 Connection configuration register                              */
   __IM uint32_t RESERVED23;
  __IOM uint32_t CONN_PARAM1;                   /*!< 0x000001E8 Connection parameter 1                                         */
  __IOM uint32_t CONN_PARAM2;                   /*!< 0x000001EC Connection parameter 2                                         */
  __IOM uint32_t CONN_INTR_MASK;                /*!< 0x000001F0 Connection Interrupt mask                                      */
  __IOM uint32_t SLAVE_TIMING_CONTROL;          /*!< 0x000001F4 slave timing control                                           */
  __IOM uint32_t RECEIVE_TRIG_CTRL;             /*!< 0x000001F8 Receive trigger control                                        */
   __IM uint32_t RESERVED24;
   __IM uint32_t LL_DBG_1;                      /*!< 0x00000200 LL debug register 1                                            */
   __IM uint32_t LL_DBG_2;                      /*!< 0x00000204 LL debug register 2                                            */
   __IM uint32_t LL_DBG_3;                      /*!< 0x00000208 LL debug register 3                                            */
   __IM uint32_t LL_DBG_4;                      /*!< 0x0000020C LL debug register 4                                            */
   __IM uint32_t LL_DBG_5;                      /*!< 0x00000210 LL debug register 5                                            */
   __IM uint32_t LL_DBG_6;                      /*!< 0x00000214 LL debug register 6                                            */
   __IM uint32_t LL_DBG_7;                      /*!< 0x00000218 LL debug register 7                                            */
   __IM uint32_t LL_DBG_8;                      /*!< 0x0000021C LL debug register 8                                            */
   __IM uint32_t LL_DBG_9;                      /*!< 0x00000220 LL debug register 9                                            */
   __IM uint32_t LL_DBG_10;                     /*!< 0x00000224 LL debug register 10                                           */
   __IM uint32_t RESERVED25[2];
  __IOM uint32_t PEER_ADDR_INIT_L;              /*!< 0x00000230 Lower 16 bit address of the peer device for INIT.              */
  __IOM uint32_t PEER_ADDR_INIT_M;              /*!< 0x00000234 Middle 16 bit address of the peer device for INIT.             */
  __IOM uint32_t PEER_ADDR_INIT_H;              /*!< 0x00000238 Higher 16 bit address of the peer device for INIT.             */
   __IM uint32_t RESERVED26[3];
  __IOM uint32_t INIT_WINDOW_TIMER_CTRL;        /*!< 0x00000248 Initiator Window NI timer control                              */
  __IOM uint32_t CONN_CONFIG_EXT;               /*!< 0x0000024C Connection extended configuration register                     */
   __IM uint32_t RESERVED27[2];
  __IOM uint32_t DPLL_CONFIG;                   /*!< 0x00000258 DPLL & CY Correlator configuration register                    */
   __IM uint32_t RESERVED28;
  __IOM uint32_t INIT_NI_VAL;                   /*!< 0x00000260 Initiator Window NI instant                                    */
   __IM uint32_t INIT_WINDOW_OFFSET;            /*!< 0x00000264 Initiator Window offset captured at conn request               */
   __IM uint32_t INIT_WINDOW_NI_ANCHOR_PT;      /*!< 0x00000268 Initiator Window NI anchor point captured at conn request      */
   __IM uint32_t RESERVED29[78];
  __IOM uint32_t CONN_UPDATE_NEW_INTERVAL;      /*!< 0x000003A4 Connection update new interval                                 */
  __IOM uint32_t CONN_UPDATE_NEW_LATENCY;       /*!< 0x000003A8 Connection update new latency                                  */
  __IOM uint32_t CONN_UPDATE_NEW_SUP_TO;        /*!< 0x000003AC Connection update new supervision timeout                      */
  __IOM uint32_t CONN_UPDATE_NEW_SL_INTERVAL;   /*!< 0x000003B0 Connection update new Slave Latency X Conn interval Value      */
   __IM uint32_t RESERVED30[3];
  __IOM uint32_t CONN_REQ_WORD0;                /*!< 0x000003C0 Connection request address word 0                              */
  __IOM uint32_t CONN_REQ_WORD1;                /*!< 0x000003C4 Connection request address word 1                              */
  __IOM uint32_t CONN_REQ_WORD2;                /*!< 0x000003C8 Connection request address word 2                              */
  __IOM uint32_t CONN_REQ_WORD3;                /*!< 0x000003CC Connection request address word 3                              */
  __IOM uint32_t CONN_REQ_WORD4;                /*!< 0x000003D0 Connection request address word 4                              */
  __IOM uint32_t CONN_REQ_WORD5;                /*!< 0x000003D4 Connection request address word 5                              */
  __IOM uint32_t CONN_REQ_WORD6;                /*!< 0x000003D8 Connection request address word 6                              */
  __IOM uint32_t CONN_REQ_WORD7;                /*!< 0x000003DC Connection request address word 7                              */
  __IOM uint32_t CONN_REQ_WORD8;                /*!< 0x000003E0 Connection request address word 8                              */
  __IOM uint32_t CONN_REQ_WORD9;                /*!< 0x000003E4 Connection request address word 9                              */
  __IOM uint32_t CONN_REQ_WORD10;               /*!< 0x000003E8 Connection request address word 10                             */
  __IOM uint32_t CONN_REQ_WORD11;               /*!< 0x000003EC Connection request address word 11                             */
   __IM uint32_t RESERVED31[389];
  __IOM uint32_t PDU_RESP_TIMER;                /*!< 0x00000A04 PDU response timer/Generic Timer (MMMS mode)                   */
   __IM uint32_t NEXT_RESP_TIMER_EXP;           /*!< 0x00000A08 Next response timeout instant                                  */
   __IM uint32_t NEXT_SUP_TO;                   /*!< 0x00000A0C Next supervision timeout instant                               */
  __IOM uint32_t LLH_FEATURE_CONFIG;            /*!< 0x00000A10 Feature enable                                                 */
  __IOM uint32_t WIN_MIN_STEP_SIZE;             /*!< 0x00000A14 Window minimum step size                                       */
  __IOM uint32_t SLV_WIN_ADJ;                   /*!< 0x00000A18 Slave window adjustment                                        */
  __IOM uint32_t SL_CONN_INTERVAL;              /*!< 0x00000A1C Slave Latency X Conn Interval Value                            */
  __IOM uint32_t LE_PING_TIMER_ADDR;            /*!< 0x00000A20 LE Ping connection timer address                               */
