ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
/* ==================================================  BLE_RCB_RCBLL.CTRL  =================================================== */
#define BLE_RCB_RCBLL_CTRL_RCBLL_CTRL_Pos (0UL)                 /*!< BLE_RCB_RCBLL CTRL: RCBLL_CTRL (Bit 0)                    */
#define BLE_RCB_RCBLL_CTRL_RCBLL_CTRL_Msk (0x1UL)               /*!< BLE_RCB_RCBLL CTRL: RCBLL_CTRL (Bitfield-Mask: 0x01)      */
#define BLE_RCB_RCBLL_CTRL_RCBLL_CPU_REQ_Pos (1UL)              /*!< BLE_RCB_RCBLL CTRL: RCBLL_CPU_REQ (Bit 1)                 */
#define BLE_RCB_RCBLL_CTRL_RCBLL_CPU_REQ_Msk (0x2UL)            /*!< BLE_RCB_RCBLL CTRL: RCBLL_CPU_REQ (Bitfield-Mask: 0x01)   */
#define BLE_RCB_RCBLL_CTRL_CPU_SINGLE_WRITE_Pos (2UL)           /*!< BLE_RCB_RCBLL CTRL: CPU_SINGLE_WRITE (Bit 2)              */
#define BLE_RCB_RCBLL_CTRL_CPU_SINGLE_WRITE_Msk (0x4UL)         /*!< BLE_RCB_RCBLL CTRL: CPU_SINGLE_WRITE (Bitfield-Mask: 0x01)*/
#define BLE_RCB_RCBLL_CTRL_CPU_SINGLE_READ_Pos (3UL)            /*!< BLE_RCB_RCBLL CTRL: CPU_SINGLE_READ (Bit 3)               */
#define BLE_RCB_RCBLL_CTRL_CPU_SINGLE_READ_Msk (0x8UL)          /*!< BLE_RCB_RCBLL CTRL: CPU_SINGLE_READ (Bitfield-Mask: 0x01) */
#define BLE_RCB_RCBLL_CTRL_ALLOW_CPU_ACCESS_TX_RX_Pos (4UL)     /*!< BLE_RCB_RCBLL CTRL: ALLOW_CPU_ACCESS_TX_RX (Bit 4)        */
#define BLE_RCB_RCBLL_CTRL_ALLOW_CPU_ACCESS_TX_RX_Msk (0x10UL)  /*!< BLE_RCB_RCBLL CTRL: ALLOW_CPU_ACCESS_TX_RX (Bitfield-Mask: 0x01)*/
#define BLE_RCB_RCBLL_CTRL_ENABLE_RADIO_BOD_Pos (5UL)           /*!< BLE_RCB_RCBLL CTRL: ENABLE_RADIO_BOD (Bit 5)              */
#define BLE_RCB_RCBLL_CTRL_ENABLE_RADIO_BOD_Msk (0x20UL)        /*!< BLE_RCB_RCBLL CTRL: ENABLE_RADIO_BOD (Bitfield-Mask: 0x01)*/
/* ==================================================  BLE_RCB_RCBLL.INTR  =================================================== */
#define BLE_RCB_RCBLL_INTR_RCB_LL_DONE_Pos (0UL)                /*!< BLE_RCB_RCBLL INTR: RCB_LL_DONE (Bit 0)                   */
#define BLE_RCB_RCBLL_INTR_RCB_LL_DONE_Msk (0x1UL)              /*!< BLE_RCB_RCBLL INTR: RCB_LL_DONE (Bitfield-Mask: 0x01)     */
#define BLE_RCB_RCBLL_INTR_SINGLE_WRITE_DONE_Pos (2UL)          /*!< BLE_RCB_RCBLL INTR: SINGLE_WRITE_DONE (Bit 2)             */
#define BLE_RCB_RCBLL_INTR_SINGLE_WRITE_DONE_Msk (0x4UL)        /*!< BLE_RCB_RCBLL INTR: SINGLE_WRITE_DONE (Bitfield-Mask: 0x01)*/
#define BLE_RCB_RCBLL_INTR_SINGLE_READ_DONE_Pos (3UL)           /*!< BLE_RCB_RCBLL INTR: SINGLE_READ_DONE (Bit 3)              */
#define BLE_RCB_RCBLL_INTR_SINGLE_READ_DONE_Msk (0x8UL)         /*!< BLE_RCB_RCBLL INTR: SINGLE_READ_DONE (Bitfield-Mask: 0x01)*/
/* ================================================  BLE_RCB_RCBLL.INTR_SET  ================================================= */
#define BLE_RCB_RCBLL_INTR_SET_RCB_LL_DONE_Pos (0UL)            /*!< BLE_RCB_RCBLL INTR_SET: RCB_LL_DONE (Bit 0)               */
#define BLE_RCB_RCBLL_INTR_SET_RCB_LL_DONE_Msk (0x1UL)          /*!< BLE_RCB_RCBLL INTR_SET: RCB_LL_DONE (Bitfield-Mask: 0x01) */
#define BLE_RCB_RCBLL_INTR_SET_SINGLE_WRITE_DONE_Pos (2UL)      /*!< BLE_RCB_RCBLL INTR_SET: SINGLE_WRITE_DONE (Bit 2)         */
#define BLE_RCB_RCBLL_INTR_SET_SINGLE_WRITE_DONE_Msk (0x4UL)    /*!< BLE_RCB_RCBLL INTR_SET: SINGLE_WRITE_DONE (Bitfield-Mask: 0x01)*/
#define BLE_RCB_RCBLL_INTR_SET_SINGLE_READ_DONE_Pos (3UL)       /*!< BLE_RCB_RCBLL INTR_SET: SINGLE_READ_DONE (Bit 3)          */
#define BLE_RCB_RCBLL_INTR_SET_SINGLE_READ_DONE_Msk (0x8UL)     /*!< BLE_RCB_RCBLL INTR_SET: SINGLE_READ_DONE (Bitfield-Mask: 0x01)*/
/* ================================================  BLE_RCB_RCBLL.INTR_MASK  ================================================ */
#define BLE_RCB_RCBLL_INTR_MASK_RCB_LL_DONE_Pos (0UL)           /*!< BLE_RCB_RCBLL INTR_MASK: RCB_LL_DONE (Bit 0)              */
#define BLE_RCB_RCBLL_INTR_MASK_RCB_LL_DONE_Msk (0x1UL)         /*!< BLE_RCB_RCBLL INTR_MASK: RCB_LL_DONE (Bitfield-Mask: 0x01)*/
#define BLE_RCB_RCBLL_INTR_MASK_SINGLE_WRITE_DONE_Pos (2UL)     /*!< BLE_RCB_RCBLL INTR_MASK: SINGLE_WRITE_DONE (Bit 2)        */
#define BLE_RCB_RCBLL_INTR_MASK_SINGLE_WRITE_DONE_Msk (0x4UL)   /*!< BLE_RCB_RCBLL INTR_MASK: SINGLE_WRITE_DONE (Bitfield-Mask: 0x01)*/
#define BLE_RCB_RCBLL_INTR_MASK_SINGLE_READ_DONE_Pos (3UL)      /*!< BLE_RCB_RCBLL INTR_MASK: SINGLE_READ_DONE (Bit 3)         */
#define BLE_RCB_RCBLL_INTR_MASK_SINGLE_READ_DONE_Msk (0x8UL)    /*!< BLE_RCB_RCBLL INTR_MASK: SINGLE_READ_DONE (Bitfield-Mask: 0x01)*/
/* ===============================================  BLE_RCB_RCBLL.INTR_MASKED  =============================================== */
#define BLE_RCB_RCBLL_INTR_MASKED_RCB_LL_DONE_Pos (0UL)         /*!< BLE_RCB_RCBLL INTR_MASKED: RCB_LL_DONE (Bit 0)            */
#define BLE_RCB_RCBLL_INTR_MASKED_RCB_LL_DONE_Msk (0x1UL)       /*!< BLE_RCB_RCBLL INTR_MASKED: RCB_LL_DONE (Bitfield-Mask: 0x01)*/
#define BLE_RCB_RCBLL_INTR_MASKED_SINGLE_WRITE_DONE_Pos (2UL)   /*!< BLE_RCB_RCBLL INTR_MASKED: SINGLE_WRITE_DONE (Bit 2)      */
#define BLE_RCB_RCBLL_INTR_MASKED_SINGLE_WRITE_DONE_Msk (0x4UL) /*!< BLE_RCB_RCBLL INTR_MASKED: SINGLE_WRITE_DONE (Bitfield-Mask: 0x01)*/
#define BLE_RCB_RCBLL_INTR_MASKED_SINGLE_READ_DONE_Pos (3UL)    /*!< BLE_RCB_RCBLL INTR_MASKED: SINGLE_READ_DONE (Bit 3)       */
#define BLE_RCB_RCBLL_INTR_MASKED_SINGLE_READ_DONE_Msk (0x8UL)  /*!< BLE_RCB_RCBLL INTR_MASKED: SINGLE_READ_DONE (Bitfield-Mask: 0x01)*/
/* =============================================  BLE_RCB_RCBLL.RADIO_REG1_ADDR  ============================================= */
#define BLE_RCB_RCBLL_RADIO_REG1_ADDR_REG_ADDR_Pos (0UL)        /*!< BLE_RCB_RCBLL RADIO_REG1_ADDR: REG_ADDR (Bit 0)           */
#define BLE_RCB_RCBLL_RADIO_REG1_ADDR_REG_ADDR_Msk (0xffffUL)   /*!< BLE_RCB_RCBLL RADIO_REG1_ADDR: REG_ADDR (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_RCB_RCBLL.RADIO_REG2_ADDR  ============================================= */
#define BLE_RCB_RCBLL_RADIO_REG2_ADDR_REG_ADDR_Pos (0UL)        /*!< BLE_RCB_RCBLL RADIO_REG2_ADDR: REG_ADDR (Bit 0)           */
#define BLE_RCB_RCBLL_RADIO_REG2_ADDR_REG_ADDR_Msk (0xffffUL)   /*!< BLE_RCB_RCBLL RADIO_REG2_ADDR: REG_ADDR (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_RCB_RCBLL.RADIO_REG3_ADDR  ============================================= */
#define BLE_RCB_RCBLL_RADIO_REG3_ADDR_REG_ADDR_Pos (0UL)        /*!< BLE_RCB_RCBLL RADIO_REG3_ADDR: REG_ADDR (Bit 0)           */
#define BLE_RCB_RCBLL_RADIO_REG3_ADDR_REG_ADDR_Msk (0xffffUL)   /*!< BLE_RCB_RCBLL RADIO_REG3_ADDR: REG_ADDR (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_RCB_RCBLL.RADIO_REG4_ADDR  ============================================= */
#define BLE_RCB_RCBLL_RADIO_REG4_ADDR_REG_ADDR_Pos (0UL)        /*!< BLE_RCB_RCBLL RADIO_REG4_ADDR: REG_ADDR (Bit 0)           */
#define BLE_RCB_RCBLL_RADIO_REG4_ADDR_REG_ADDR_Msk (0xffffUL)   /*!< BLE_RCB_RCBLL RADIO_REG4_ADDR: REG_ADDR (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_RCB_RCBLL.RADIO_REG5_ADDR  ============================================= */
#define BLE_RCB_RCBLL_RADIO_REG5_ADDR_REG_ADDR_Pos (0UL)        /*!< BLE_RCB_RCBLL RADIO_REG5_ADDR: REG_ADDR (Bit 0)           */
#define BLE_RCB_RCBLL_RADIO_REG5_ADDR_REG_ADDR_Msk (0xffffUL)   /*!< BLE_RCB_RCBLL RADIO_REG5_ADDR: REG_ADDR (Bitfield-Mask: 0xffff)*/
/* ==============================================  BLE_RCB_RCBLL.CPU_WRITE_REG  ============================================== */
#define BLE_RCB_RCBLL_CPU_WRITE_REG_ADDR_Pos (0UL)              /*!< BLE_RCB_RCBLL CPU_WRITE_REG: ADDR (Bit 0)                 */
#define BLE_RCB_RCBLL_CPU_WRITE_REG_ADDR_Msk (0xffffUL)         /*!< BLE_RCB_RCBLL CPU_WRITE_REG: ADDR (Bitfield-Mask: 0xffff) */
#define BLE_RCB_RCBLL_CPU_WRITE_REG_WRITE_DATA_Pos (16UL)       /*!< BLE_RCB_RCBLL CPU_WRITE_REG: WRITE_DATA (Bit 16)          */
#define BLE_RCB_RCBLL_CPU_WRITE_REG_WRITE_DATA_Msk (0xffff0000UL) /*!< BLE_RCB_RCBLL CPU_WRITE_REG: WRITE_DATA (Bitfield-Mask: 0xffff)*/
/* ==============================================  BLE_RCB_RCBLL.CPU_READ_REG  =============================================== */
#define BLE_RCB_RCBLL_CPU_READ_REG_ADDR_Pos (0UL)               /*!< BLE_RCB_RCBLL CPU_READ_REG: ADDR (Bit 0)                  */
#define BLE_RCB_RCBLL_CPU_READ_REG_ADDR_Msk (0xffffUL)          /*!< BLE_RCB_RCBLL CPU_READ_REG: ADDR (Bitfield-Mask: 0xffff)  */
#define BLE_RCB_RCBLL_CPU_READ_REG_READ_DATA_Pos (16UL)         /*!< BLE_RCB_RCBLL CPU_READ_REG: READ_DATA (Bit 16)            */
#define BLE_RCB_RCBLL_CPU_READ_REG_READ_DATA_Msk (0xffff0000UL) /*!< BLE_RCB_RCBLL CPU_READ_REG: READ_DATA (Bitfield-Mask: 0xffff)*/


