ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
/* =====================================================  BLE_RCB.CTRL  ====================================================== */
#define BLE_RCB_CTRL_TX_CLK_EDGE_Pos      (1UL)                 /*!< BLE_RCB CTRL: TX_CLK_EDGE (Bit 1)                         */
#define BLE_RCB_CTRL_TX_CLK_EDGE_Msk      (0x2UL)               /*!< BLE_RCB CTRL: TX_CLK_EDGE (Bitfield-Mask: 0x01)           */
#define BLE_RCB_CTRL_RX_CLK_EDGE_Pos      (2UL)                 /*!< BLE_RCB CTRL: RX_CLK_EDGE (Bit 2)                         */
#define BLE_RCB_CTRL_RX_CLK_EDGE_Msk      (0x4UL)               /*!< BLE_RCB CTRL: RX_CLK_EDGE (Bitfield-Mask: 0x01)           */
#define BLE_RCB_CTRL_RX_CLK_SRC_Pos       (3UL)                 /*!< BLE_RCB CTRL: RX_CLK_SRC (Bit 3)                          */
#define BLE_RCB_CTRL_RX_CLK_SRC_Msk       (0x8UL)               /*!< BLE_RCB CTRL: RX_CLK_SRC (Bitfield-Mask: 0x01)            */
#define BLE_RCB_CTRL_SCLK_CONTINUOUS_Pos  (4UL)                 /*!< BLE_RCB CTRL: SCLK_CONTINUOUS (Bit 4)                     */
#define BLE_RCB_CTRL_SCLK_CONTINUOUS_Msk  (0x10UL)              /*!< BLE_RCB CTRL: SCLK_CONTINUOUS (Bitfield-Mask: 0x01)       */
#define BLE_RCB_CTRL_SSEL_POLARITY_Pos    (5UL)                 /*!< BLE_RCB CTRL: SSEL_POLARITY (Bit 5)                       */
#define BLE_RCB_CTRL_SSEL_POLARITY_Msk    (0x20UL)              /*!< BLE_RCB CTRL: SSEL_POLARITY (Bitfield-Mask: 0x01)         */
#define BLE_RCB_CTRL_LEAD_Pos             (8UL)                 /*!< BLE_RCB CTRL: LEAD (Bit 8)                                */
#define BLE_RCB_CTRL_LEAD_Msk             (0x300UL)             /*!< BLE_RCB CTRL: LEAD (Bitfield-Mask: 0x03)                  */
#define BLE_RCB_CTRL_LAG_Pos              (10UL)                /*!< BLE_RCB CTRL: LAG (Bit 10)                                */
#define BLE_RCB_CTRL_LAG_Msk              (0xc00UL)             /*!< BLE_RCB CTRL: LAG (Bitfield-Mask: 0x03)                   */
#define BLE_RCB_CTRL_DIV_ENABLED_Pos      (12UL)                /*!< BLE_RCB CTRL: DIV_ENABLED (Bit 12)                        */
#define BLE_RCB_CTRL_DIV_ENABLED_Msk      (0x1000UL)            /*!< BLE_RCB CTRL: DIV_ENABLED (Bitfield-Mask: 0x01)           */
#define BLE_RCB_CTRL_DIV_Pos              (13UL)                /*!< BLE_RCB CTRL: DIV (Bit 13)                                */
#define BLE_RCB_CTRL_DIV_Msk              (0x7e000UL)           /*!< BLE_RCB CTRL: DIV (Bitfield-Mask: 0x3f)                   */
#define BLE_RCB_CTRL_ADDR_WIDTH_Pos       (19UL)                /*!< BLE_RCB CTRL: ADDR_WIDTH (Bit 19)                         */
#define BLE_RCB_CTRL_ADDR_WIDTH_Msk       (0x780000UL)          /*!< BLE_RCB CTRL: ADDR_WIDTH (Bitfield-Mask: 0x0f)            */
#define BLE_RCB_CTRL_DATA_WIDTH_Pos       (23UL)                /*!< BLE_RCB CTRL: DATA_WIDTH (Bit 23)                         */
#define BLE_RCB_CTRL_DATA_WIDTH_Msk       (0x800000UL)          /*!< BLE_RCB CTRL: DATA_WIDTH (Bitfield-Mask: 0x01)            */
#define BLE_RCB_CTRL_ENABLED_Pos          (31UL)                /*!< BLE_RCB CTRL: ENABLED (Bit 31)                            */
#define BLE_RCB_CTRL_ENABLED_Msk          (0x80000000UL)        /*!< BLE_RCB CTRL: ENABLED (Bitfield-Mask: 0x01)               */
/* ====================================================  BLE_RCB.STATUS  ===================================================== */
#define BLE_RCB_STATUS_BUS_BUSY_Pos       (0UL)                 /*!< BLE_RCB STATUS: BUS_BUSY (Bit 0)                          */
#define BLE_RCB_STATUS_BUS_BUSY_Msk       (0x1UL)               /*!< BLE_RCB STATUS: BUS_BUSY (Bitfield-Mask: 0x01)            */
/* ====================================================  BLE_RCB.TX_CTRL  ==================================================== */
#define BLE_RCB_TX_CTRL_MSB_FIRST_Pos     (0UL)                 /*!< BLE_RCB TX_CTRL: MSB_FIRST (Bit 0)                        */
#define BLE_RCB_TX_CTRL_MSB_FIRST_Msk     (0x1UL)               /*!< BLE_RCB TX_CTRL: MSB_FIRST (Bitfield-Mask: 0x01)          */
#define BLE_RCB_TX_CTRL_FIFO_RECONFIG_Pos (1UL)                 /*!< BLE_RCB TX_CTRL: FIFO_RECONFIG (Bit 1)                    */
#define BLE_RCB_TX_CTRL_FIFO_RECONFIG_Msk (0x2UL)               /*!< BLE_RCB TX_CTRL: FIFO_RECONFIG (Bitfield-Mask: 0x01)      */
#define BLE_RCB_TX_CTRL_TX_ENTRIES_Pos    (2UL)                 /*!< BLE_RCB TX_CTRL: TX_ENTRIES (Bit 2)                       */
#define BLE_RCB_TX_CTRL_TX_ENTRIES_Msk    (0x7cUL)              /*!< BLE_RCB TX_CTRL: TX_ENTRIES (Bitfield-Mask: 0x1f)         */
/* =================================================  BLE_RCB.TX_FIFO_CTRL  ================================================== */
#define BLE_RCB_TX_FIFO_CTRL_TX_TRIGGER_LEVEL_Pos (0UL)         /*!< BLE_RCB TX_FIFO_CTRL: TX_TRIGGER_LEVEL (Bit 0)            */
#define BLE_RCB_TX_FIFO_CTRL_TX_TRIGGER_LEVEL_Msk (0x1fUL)      /*!< BLE_RCB TX_FIFO_CTRL: TX_TRIGGER_LEVEL (Bitfield-Mask: 0x1f)*/
#define BLE_RCB_TX_FIFO_CTRL_CLEAR_Pos    (16UL)                /*!< BLE_RCB TX_FIFO_CTRL: CLEAR (Bit 16)                      */
#define BLE_RCB_TX_FIFO_CTRL_CLEAR_Msk    (0x10000UL)           /*!< BLE_RCB TX_FIFO_CTRL: CLEAR (Bitfield-Mask: 0x01)         */
/* ================================================  BLE_RCB.TX_FIFO_STATUS  ================================================= */
#define BLE_RCB_TX_FIFO_STATUS_USED_Pos   (0UL)                 /*!< BLE_RCB TX_FIFO_STATUS: USED (Bit 0)                      */
#define BLE_RCB_TX_FIFO_STATUS_USED_Msk   (0x1fUL)              /*!< BLE_RCB TX_FIFO_STATUS: USED (Bitfield-Mask: 0x1f)        */
#define BLE_RCB_TX_FIFO_STATUS_SR_VALID_Pos (15UL)              /*!< BLE_RCB TX_FIFO_STATUS: SR_VALID (Bit 15)                 */
#define BLE_RCB_TX_FIFO_STATUS_SR_VALID_Msk (0x8000UL)          /*!< BLE_RCB TX_FIFO_STATUS: SR_VALID (Bitfield-Mask: 0x01)    */
#define BLE_RCB_TX_FIFO_STATUS_RD_PTR_Pos (16UL)                /*!< BLE_RCB TX_FIFO_STATUS: RD_PTR (Bit 16)                   */
#define BLE_RCB_TX_FIFO_STATUS_RD_PTR_Msk (0xf0000UL)           /*!< BLE_RCB TX_FIFO_STATUS: RD_PTR (Bitfield-Mask: 0x0f)      */
#define BLE_RCB_TX_FIFO_STATUS_WR_PTR_Pos (24UL)                /*!< BLE_RCB TX_FIFO_STATUS: WR_PTR (Bit 24)                   */
#define BLE_RCB_TX_FIFO_STATUS_WR_PTR_Msk (0xf000000UL)         /*!< BLE_RCB TX_FIFO_STATUS: WR_PTR (Bitfield-Mask: 0x0f)      */
/* ==================================================  BLE_RCB.TX_FIFO_WR  =================================================== */
#define BLE_RCB_TX_FIFO_WR_DATA_Pos       (0UL)                 /*!< BLE_RCB TX_FIFO_WR: DATA (Bit 0)                          */
#define BLE_RCB_TX_FIFO_WR_DATA_Msk       (0xffffffffUL)        /*!< BLE_RCB TX_FIFO_WR: DATA (Bitfield-Mask: 0xffffffff)      */
/* ====================================================  BLE_RCB.RX_CTRL  ==================================================== */
#define BLE_RCB_RX_CTRL_MSB_FIRST_Pos     (0UL)                 /*!< BLE_RCB RX_CTRL: MSB_FIRST (Bit 0)                        */
#define BLE_RCB_RX_CTRL_MSB_FIRST_Msk     (0x1UL)               /*!< BLE_RCB RX_CTRL: MSB_FIRST (Bitfield-Mask: 0x01)          */
/* =================================================  BLE_RCB.RX_FIFO_CTRL  ================================================== */
#define BLE_RCB_RX_FIFO_CTRL_TRIGGER_LEVEL_Pos (0UL)            /*!< BLE_RCB RX_FIFO_CTRL: TRIGGER_LEVEL (Bit 0)               */
#define BLE_RCB_RX_FIFO_CTRL_TRIGGER_LEVEL_Msk (0xfUL)          /*!< BLE_RCB RX_FIFO_CTRL: TRIGGER_LEVEL (Bitfield-Mask: 0x0f) */
#define BLE_RCB_RX_FIFO_CTRL_CLEAR_Pos    (16UL)                /*!< BLE_RCB RX_FIFO_CTRL: CLEAR (Bit 16)                      */
#define BLE_RCB_RX_FIFO_CTRL_CLEAR_Msk    (0x10000UL)           /*!< BLE_RCB RX_FIFO_CTRL: CLEAR (Bitfield-Mask: 0x01)         */
/* ================================================  BLE_RCB.RX_FIFO_STATUS  ================================================= */
#define BLE_RCB_RX_FIFO_STATUS_USED_Pos   (0UL)                 /*!< BLE_RCB RX_FIFO_STATUS: USED (Bit 0)                      */
#define BLE_RCB_RX_FIFO_STATUS_USED_Msk   (0x1fUL)              /*!< BLE_RCB RX_FIFO_STATUS: USED (Bitfield-Mask: 0x1f)        */
#define BLE_RCB_RX_FIFO_STATUS_SR_VALID_Pos (15UL)              /*!< BLE_RCB RX_FIFO_STATUS: SR_VALID (Bit 15)                 */
#define BLE_RCB_RX_FIFO_STATUS_SR_VALID_Msk (0x8000UL)          /*!< BLE_RCB RX_FIFO_STATUS: SR_VALID (Bitfield-Mask: 0x01)    */
#define BLE_RCB_RX_FIFO_STATUS_RD_PTR_Pos (16UL)                /*!< BLE_RCB RX_FIFO_STATUS: RD_PTR (Bit 16)                   */
#define BLE_RCB_RX_FIFO_STATUS_RD_PTR_Msk (0xf0000UL)           /*!< BLE_RCB RX_FIFO_STATUS: RD_PTR (Bitfield-Mask: 0x0f)      */
#define BLE_RCB_RX_FIFO_STATUS_WR_PTR_Pos (24UL)                /*!< BLE_RCB RX_FIFO_STATUS: WR_PTR (Bit 24)                   */
#define BLE_RCB_RX_FIFO_STATUS_WR_PTR_Msk (0xf000000UL)         /*!< BLE_RCB RX_FIFO_STATUS: WR_PTR (Bitfield-Mask: 0x0f)      */
/* ==================================================  BLE_RCB.RX_FIFO_RD  =================================================== */
#define BLE_RCB_RX_FIFO_RD_DATA_Pos       (0UL)                 /*!< BLE_RCB RX_FIFO_RD: DATA (Bit 0)                          */
#define BLE_RCB_RX_FIFO_RD_DATA_Msk       (0xffffffffUL)        /*!< BLE_RCB RX_FIFO_RD: DATA (Bitfield-Mask: 0xffffffff)      */
/* ===============================================  BLE_RCB.RX_FIFO_RD_SILENT  =============================================== */
#define BLE_RCB_RX_FIFO_RD_SILENT_DATA_Pos (0UL)                /*!< BLE_RCB RX_FIFO_RD_SILENT: DATA (Bit 0)                   */
#define BLE_RCB_RX_FIFO_RD_SILENT_DATA_Msk (0xffffffffUL)       /*!< BLE_RCB RX_FIFO_RD_SILENT: DATA (Bitfield-Mask: 0xffffffff)*/
/* =====================================================  BLE_RCB.INTR  ====================================================== */
#define BLE_RCB_INTR_RCB_DONE_Pos         (0UL)                 /*!< BLE_RCB INTR: RCB_DONE (Bit 0)                            */
#define BLE_RCB_INTR_RCB_DONE_Msk         (0x1UL)               /*!< BLE_RCB INTR: RCB_DONE (Bitfield-Mask: 0x01)              */
#define BLE_RCB_INTR_TX_FIFO_TRIGGER_Pos  (8UL)                 /*!< BLE_RCB INTR: TX_FIFO_TRIGGER (Bit 8)                     */
#define BLE_RCB_INTR_TX_FIFO_TRIGGER_Msk  (0x100UL)             /*!< BLE_RCB INTR: TX_FIFO_TRIGGER (Bitfield-Mask: 0x01)       */
#define BLE_RCB_INTR_TX_FIFO_NOT_FULL_Pos (9UL)                 /*!< BLE_RCB INTR: TX_FIFO_NOT_FULL (Bit 9)                    */
#define BLE_RCB_INTR_TX_FIFO_NOT_FULL_Msk (0x200UL)             /*!< BLE_RCB INTR: TX_FIFO_NOT_FULL (Bitfield-Mask: 0x01)      */
#define BLE_RCB_INTR_TX_FIFO_EMPTY_Pos    (10UL)                /*!< BLE_RCB INTR: TX_FIFO_EMPTY (Bit 10)                      */
#define BLE_RCB_INTR_TX_FIFO_EMPTY_Msk    (0x400UL)             /*!< BLE_RCB INTR: TX_FIFO_EMPTY (Bitfield-Mask: 0x01)         */
#define BLE_RCB_INTR_TX_FIFO_OVERFLOW_Pos (11UL)                /*!< BLE_RCB INTR: TX_FIFO_OVERFLOW (Bit 11)                   */
#define BLE_RCB_INTR_TX_FIFO_OVERFLOW_Msk (0x800UL)             /*!< BLE_RCB INTR: TX_FIFO_OVERFLOW (Bitfield-Mask: 0x01)      */
#define BLE_RCB_INTR_TX_FIFO_UNDERFLOW_Pos (12UL)               /*!< BLE_RCB INTR: TX_FIFO_UNDERFLOW (Bit 12)                  */
#define BLE_RCB_INTR_TX_FIFO_UNDERFLOW_Msk (0x1000UL)           /*!< BLE_RCB INTR: TX_FIFO_UNDERFLOW (Bitfield-Mask: 0x01)     */
#define BLE_RCB_INTR_RX_FIFO_TRIGGER_Pos  (16UL)                /*!< BLE_RCB INTR: RX_FIFO_TRIGGER (Bit 16)                    */
#define BLE_RCB_INTR_RX_FIFO_TRIGGER_Msk  (0x10000UL)           /*!< BLE_RCB INTR: RX_FIFO_TRIGGER (Bitfield-Mask: 0x01)       */
#define BLE_RCB_INTR_RX_FIFO_NOT_EMPTY_Pos (17UL)               /*!< BLE_RCB INTR: RX_FIFO_NOT_EMPTY (Bit 17)                  */
#define BLE_RCB_INTR_RX_FIFO_NOT_EMPTY_Msk (0x20000UL)          /*!< BLE_RCB INTR: RX_FIFO_NOT_EMPTY (Bitfield-Mask: 0x01)     */
#define BLE_RCB_INTR_RX_FIFO_FULL_Pos     (18UL)                /*!< BLE_RCB INTR: RX_FIFO_FULL (Bit 18)                       */
#define BLE_RCB_INTR_RX_FIFO_FULL_Msk     (0x40000UL)           /*!< BLE_RCB INTR: RX_FIFO_FULL (Bitfield-Mask: 0x01)          */
#define BLE_RCB_INTR_RX_FIFO_OVERFLOW_Pos (19UL)                /*!< BLE_RCB INTR: RX_FIFO_OVERFLOW (Bit 19)                   */
#define BLE_RCB_INTR_RX_FIFO_OVERFLOW_Msk (0x80000UL)           /*!< BLE_RCB INTR: RX_FIFO_OVERFLOW (Bitfield-Mask: 0x01)      */
#define BLE_RCB_INTR_RX_FIFO_UNDERFLOW_Pos (20UL)               /*!< BLE_RCB INTR: RX_FIFO_UNDERFLOW (Bit 20)                  */
#define BLE_RCB_INTR_RX_FIFO_UNDERFLOW_Msk (0x100000UL)         /*!< BLE_RCB INTR: RX_FIFO_UNDERFLOW (Bitfield-Mask: 0x01)     */
/* ===================================================  BLE_RCB.INTR_SET  ==================================================== */
#define BLE_RCB_INTR_SET_RCB_DONE_Pos     (0UL)                 /*!< BLE_RCB INTR_SET: RCB_DONE (Bit 0)                        */
#define BLE_RCB_INTR_SET_RCB_DONE_Msk     (0x1UL)               /*!< BLE_RCB INTR_SET: RCB_DONE (Bitfield-Mask: 0x01)          */
#define BLE_RCB_INTR_SET_TX_FIFO_TRIGGER_Pos (8UL)              /*!< BLE_RCB INTR_SET: TX_FIFO_TRIGGER (Bit 8)                 */
#define BLE_RCB_INTR_SET_TX_FIFO_TRIGGER_Msk (0x100UL)          /*!< BLE_RCB INTR_SET: TX_FIFO_TRIGGER (Bitfield-Mask: 0x01)   */
#define BLE_RCB_INTR_SET_TX_FIFO_NOT_FULL_Pos (9UL)             /*!< BLE_RCB INTR_SET: TX_FIFO_NOT_FULL (Bit 9)                */
#define BLE_RCB_INTR_SET_TX_FIFO_NOT_FULL_Msk (0x200UL)         /*!< BLE_RCB INTR_SET: TX_FIFO_NOT_FULL (Bitfield-Mask: 0x01)  */
#define BLE_RCB_INTR_SET_TX_FIFO_EMPTY_Pos (10UL)               /*!< BLE_RCB INTR_SET: TX_FIFO_EMPTY (Bit 10)                  */
#define BLE_RCB_INTR_SET_TX_FIFO_EMPTY_Msk (0x400UL)            /*!< BLE_RCB INTR_SET: TX_FIFO_EMPTY (Bitfield-Mask: 0x01)     */
#define BLE_RCB_INTR_SET_TX_FIFO_OVERFLOW_Pos (11UL)            /*!< BLE_RCB INTR_SET: TX_FIFO_OVERFLOW (Bit 11)               */
#define BLE_RCB_INTR_SET_TX_FIFO_OVERFLOW_Msk (0x800UL)         /*!< BLE_RCB INTR_SET: TX_FIFO_OVERFLOW (Bitfield-Mask: 0x01)  */
#define BLE_RCB_INTR_SET_TX_FIFO_UNDERFLOW_Pos (12UL)           /*!< BLE_RCB INTR_SET: TX_FIFO_UNDERFLOW (Bit 12)              */
#define BLE_RCB_INTR_SET_TX_FIFO_UNDERFLOW_Msk (0x1000UL)       /*!< BLE_RCB INTR_SET: TX_FIFO_UNDERFLOW (Bitfield-Mask: 0x01) */
#define BLE_RCB_INTR_SET_RX_FIFO_TRIGGER_Pos (16UL)             /*!< BLE_RCB INTR_SET: RX_FIFO_TRIGGER (Bit 16)                */
#define BLE_RCB_INTR_SET_RX_FIFO_TRIGGER_Msk (0x10000UL)        /*!< BLE_RCB INTR_SET: RX_FIFO_TRIGGER (Bitfield-Mask: 0x01)   */
#define BLE_RCB_INTR_SET_RX_FIFO_NOT_EMPTY_Pos (17UL)           /*!< BLE_RCB INTR_SET: RX_FIFO_NOT_EMPTY (Bit 17)              */
#define BLE_RCB_INTR_SET_RX_FIFO_NOT_EMPTY_Msk (0x20000UL)      /*!< BLE_RCB INTR_SET: RX_FIFO_NOT_EMPTY (Bitfield-Mask: 0x01) */
#define BLE_RCB_INTR_SET_RX_FIFO_FULL_Pos (18UL)                /*!< BLE_RCB INTR_SET: RX_FIFO_FULL (Bit 18)                   */
#define BLE_RCB_INTR_SET_RX_FIFO_FULL_Msk (0x40000UL)           /*!< BLE_RCB INTR_SET: RX_FIFO_FULL (Bitfield-Mask: 0x01)      */
#define BLE_RCB_INTR_SET_RX_FIFO_OVERFLOW_Pos (19UL)            /*!< BLE_RCB INTR_SET: RX_FIFO_OVERFLOW (Bit 19)               */
#define BLE_RCB_INTR_SET_RX_FIFO_OVERFLOW_Msk (0x80000UL)       /*!< BLE_RCB INTR_SET: RX_FIFO_OVERFLOW (Bitfield-Mask: 0x01)  */
#define BLE_RCB_INTR_SET_RX_FIFO_UNDERFLOW_Pos (20UL)           /*!< BLE_RCB INTR_SET: RX_FIFO_UNDERFLOW (Bit 20)              */
#define BLE_RCB_INTR_SET_RX_FIFO_UNDERFLOW_Msk (0x100000UL)     /*!< BLE_RCB INTR_SET: RX_FIFO_UNDERFLOW (Bitfield-Mask: 0x01) */
/* ===================================================  BLE_RCB.INTR_MASK  =================================================== */
#define BLE_RCB_INTR_MASK_RCB_DONE_Pos    (0UL)                 /*!< BLE_RCB INTR_MASK: RCB_DONE (Bit 0)                       */
#define BLE_RCB_INTR_MASK_RCB_DONE_Msk    (0x1UL)               /*!< BLE_RCB INTR_MASK: RCB_DONE (Bitfield-Mask: 0x01)         */
#define BLE_RCB_INTR_MASK_TX_FIFO_TRIGGER_Pos (8UL)             /*!< BLE_RCB INTR_MASK: TX_FIFO_TRIGGER (Bit 8)                */
#define BLE_RCB_INTR_MASK_TX_FIFO_TRIGGER_Msk (0x100UL)         /*!< BLE_RCB INTR_MASK: TX_FIFO_TRIGGER (Bitfield-Mask: 0x01)  */
#define BLE_RCB_INTR_MASK_TX_FIFO_NOT_FULL_Pos (9UL)            /*!< BLE_RCB INTR_MASK: TX_FIFO_NOT_FULL (Bit 9)               */
#define BLE_RCB_INTR_MASK_TX_FIFO_NOT_FULL_Msk (0x200UL)        /*!< BLE_RCB INTR_MASK: TX_FIFO_NOT_FULL (Bitfield-Mask: 0x01) */
#define BLE_RCB_INTR_MASK_TX_FIFO_EMPTY_Pos (10UL)              /*!< BLE_RCB INTR_MASK: TX_FIFO_EMPTY (Bit 10)                 */
#define BLE_RCB_INTR_MASK_TX_FIFO_EMPTY_Msk (0x400UL)           /*!< BLE_RCB INTR_MASK: TX_FIFO_EMPTY (Bitfield-Mask: 0x01)    */
#define BLE_RCB_INTR_MASK_TX_FIFO_OVERFLOW_Pos (11UL)           /*!< BLE_RCB INTR_MASK: TX_FIFO_OVERFLOW (Bit 11)              */
#define BLE_RCB_INTR_MASK_TX_FIFO_OVERFLOW_Msk (0x800UL)        /*!< BLE_RCB INTR_MASK: TX_FIFO_OVERFLOW (Bitfield-Mask: 0x01) */
#define BLE_RCB_INTR_MASK_TX_FIFO_UNDERFLOW_Pos (12UL)          /*!< BLE_RCB INTR_MASK: TX_FIFO_UNDERFLOW (Bit 12)             */
#define BLE_RCB_INTR_MASK_TX_FIFO_UNDERFLOW_Msk (0x1000UL)      /*!< BLE_RCB INTR_MASK: TX_FIFO_UNDERFLOW (Bitfield-Mask: 0x01)*/
#define BLE_RCB_INTR_MASK_RX_FIFO_TRIGGER_Pos (16UL)            /*!< BLE_RCB INTR_MASK: RX_FIFO_TRIGGER (Bit 16)               */
#define BLE_RCB_INTR_MASK_RX_FIFO_TRIGGER_Msk (0x10000UL)       /*!< BLE_RCB INTR_MASK: RX_FIFO_TRIGGER (Bitfield-Mask: 0x01)  */
#define BLE_RCB_INTR_MASK_RX_FIFO_NOT_EMPTY_Pos (17UL)          /*!< BLE_RCB INTR_MASK: RX_FIFO_NOT_EMPTY (Bit 17)             */
#define BLE_RCB_INTR_MASK_RX_FIFO_NOT_EMPTY_Msk (0x20000UL)     /*!< BLE_RCB INTR_MASK: RX_FIFO_NOT_EMPTY (Bitfield-Mask: 0x01)*/
#define BLE_RCB_INTR_MASK_RX_FIFO_FULL_Pos (18UL)               /*!< BLE_RCB INTR_MASK: RX_FIFO_FULL (Bit 18)                  */
#define BLE_RCB_INTR_MASK_RX_FIFO_FULL_Msk (0x40000UL)          /*!< BLE_RCB INTR_MASK: RX_FIFO_FULL (Bitfield-Mask: 0x01)     */
#define BLE_RCB_INTR_MASK_RX_FIFO_OVERFLOW_Pos (19UL)           /*!< BLE_RCB INTR_MASK: RX_FIFO_OVERFLOW (Bit 19)              */
#define BLE_RCB_INTR_MASK_RX_FIFO_OVERFLOW_Msk (0x80000UL)      /*!< BLE_RCB INTR_MASK: RX_FIFO_OVERFLOW (Bitfield-Mask: 0x01) */
#define BLE_RCB_INTR_MASK_RX_FIFO_UNDERFLOW_Pos (20UL)          /*!< BLE_RCB INTR_MASK: RX_FIFO_UNDERFLOW (Bit 20)             */
#define BLE_RCB_INTR_MASK_RX_FIFO_UNDERFLOW_Msk (0x100000UL)    /*!< BLE_RCB INTR_MASK: RX_FIFO_UNDERFLOW (Bitfield-Mask: 0x01)*/
/* ==================================================  BLE_RCB.INTR_MASKED  ================================================== */
#define BLE_RCB_INTR_MASKED_RCB_DONE_Pos  (0UL)                 /*!< BLE_RCB INTR_MASKED: RCB_DONE (Bit 0)                     */
#define BLE_RCB_INTR_MASKED_RCB_DONE_Msk  (0x1UL)               /*!< BLE_RCB INTR_MASKED: RCB_DONE (Bitfield-Mask: 0x01)       */
#define BLE_RCB_INTR_MASKED_TX_FIFO_TRIGGER_Pos (8UL)           /*!< BLE_RCB INTR_MASKED: TX_FIFO_TRIGGER (Bit 8)              */
#define BLE_RCB_INTR_MASKED_TX_FIFO_TRIGGER_Msk (0x100UL)       /*!< BLE_RCB INTR_MASKED: TX_FIFO_TRIGGER (Bitfield-Mask: 0x01)*/
#define BLE_RCB_INTR_MASKED_TX_FIFO_NOT_FULL_Pos (9UL)          /*!< BLE_RCB INTR_MASKED: TX_FIFO_NOT_FULL (Bit 9)             */
#define BLE_RCB_INTR_MASKED_TX_FIFO_NOT_FULL_Msk (0x200UL)      /*!< BLE_RCB INTR_MASKED: TX_FIFO_NOT_FULL (Bitfield-Mask: 0x01)*/
#define BLE_RCB_INTR_MASKED_TX_FIFO_EMPTY_Pos (10UL)            /*!< BLE_RCB INTR_MASKED: TX_FIFO_EMPTY (Bit 10)               */
#define BLE_RCB_INTR_MASKED_TX_FIFO_EMPTY_Msk (0x400UL)         /*!< BLE_RCB INTR_MASKED: TX_FIFO_EMPTY (Bitfield-Mask: 0x01)  */
#define BLE_RCB_INTR_MASKED_TX_FIFO_OVERFLOW_Pos (11UL)         /*!< BLE_RCB INTR_MASKED: TX_FIFO_OVERFLOW (Bit 11)            */
#define BLE_RCB_INTR_MASKED_TX_FIFO_OVERFLOW_Msk (0x800UL)      /*!< BLE_RCB INTR_MASKED: TX_FIFO_OVERFLOW (Bitfield-Mask: 0x01)*/
#define BLE_RCB_INTR_MASKED_TX_FIFO_UNDERFLOW_Pos (12UL)        /*!< BLE_RCB INTR_MASKED: TX_FIFO_UNDERFLOW (Bit 12)           */
#define BLE_RCB_INTR_MASKED_TX_FIFO_UNDERFLOW_Msk (0x1000UL)    /*!< BLE_RCB INTR_MASKED: TX_FIFO_UNDERFLOW (Bitfield-Mask: 0x01)*/
#define BLE_RCB_INTR_MASKED_RX_FIFO_TRIGGER_Pos (16UL)          /*!< BLE_RCB INTR_MASKED: RX_FIFO_TRIGGER (Bit 16)             */
#define BLE_RCB_INTR_MASKED_RX_FIFO_TRIGGER_Msk (0x10000UL)     /*!< BLE_RCB INTR_MASKED: RX_FIFO_TRIGGER (Bitfield-Mask: 0x01)*/
#define BLE_RCB_INTR_MASKED_RX_FIFO_NOT_EMPTY_Pos (17UL)        /*!< BLE_RCB INTR_MASKED: RX_FIFO_NOT_EMPTY (Bit 17)           */
#define BLE_RCB_INTR_MASKED_RX_FIFO_NOT_EMPTY_Msk (0x20000UL)   /*!< BLE_RCB INTR_MASKED: RX_FIFO_NOT_EMPTY (Bitfield-Mask: 0x01)*/
#define BLE_RCB_INTR_MASKED_RX_FIFO_FULL_Pos (18UL)             /*!< BLE_RCB INTR_MASKED: RX_FIFO_FULL (Bit 18)                */
#define BLE_RCB_INTR_MASKED_RX_FIFO_FULL_Msk (0x40000UL)        /*!< BLE_RCB INTR_MASKED: RX_FIFO_FULL (Bitfield-Mask: 0x01)   */
#define BLE_RCB_INTR_MASKED_RX_FIFO_OVERFLOW_Pos (19UL)         /*!< BLE_RCB INTR_MASKED: RX_FIFO_OVERFLOW (Bit 19)            */
#define BLE_RCB_INTR_MASKED_RX_FIFO_OVERFLOW_Msk (0x80000UL)    /*!< BLE_RCB INTR_MASKED: RX_FIFO_OVERFLOW (Bitfield-Mask: 0x01)*/
#define BLE_RCB_INTR_MASKED_RX_FIFO_UNDERFLOW_Pos (20UL)        /*!< BLE_RCB INTR_MASKED: RX_FIFO_UNDERFLOW (Bit 20)           */
#define BLE_RCB_INTR_MASKED_RX_FIFO_UNDERFLOW_Msk (0x100000UL)  /*!< BLE_RCB INTR_MASKED: RX_FIFO_UNDERFLOW (Bitfield-Mask: 0x01)*/


