ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
/* ==============================================  BLE_BLELL.COMMAND_REGISTER  =============================================== */
#define BLE_BLELL_COMMAND_REGISTER_COMMAND_Pos (0UL)            /*!< BLE_BLELL COMMAND_REGISTER: COMMAND (Bit 0)               */
#define BLE_BLELL_COMMAND_REGISTER_COMMAND_Msk (0xffUL)         /*!< BLE_BLELL COMMAND_REGISTER: COMMAND (Bitfield-Mask: 0xff) */
/* =================================================  BLE_BLELL.EVENT_INTR  ================================================== */
#define BLE_BLELL_EVENT_INTR_ADV_INTR_Pos (0UL)                 /*!< BLE_BLELL EVENT_INTR: ADV_INTR (Bit 0)                    */
#define BLE_BLELL_EVENT_INTR_ADV_INTR_Msk (0x1UL)               /*!< BLE_BLELL EVENT_INTR: ADV_INTR (Bitfield-Mask: 0x01)      */
#define BLE_BLELL_EVENT_INTR_SCAN_INTR_Pos (1UL)                /*!< BLE_BLELL EVENT_INTR: SCAN_INTR (Bit 1)                   */
#define BLE_BLELL_EVENT_INTR_SCAN_INTR_Msk (0x2UL)              /*!< BLE_BLELL EVENT_INTR: SCAN_INTR (Bitfield-Mask: 0x01)     */
#define BLE_BLELL_EVENT_INTR_INIT_INTR_Pos (2UL)                /*!< BLE_BLELL EVENT_INTR: INIT_INTR (Bit 2)                   */
#define BLE_BLELL_EVENT_INTR_INIT_INTR_Msk (0x4UL)              /*!< BLE_BLELL EVENT_INTR: INIT_INTR (Bitfield-Mask: 0x01)     */
#define BLE_BLELL_EVENT_INTR_CONN_INTR_Pos (3UL)                /*!< BLE_BLELL EVENT_INTR: CONN_INTR (Bit 3)                   */
#define BLE_BLELL_EVENT_INTR_CONN_INTR_Msk (0x8UL)              /*!< BLE_BLELL EVENT_INTR: CONN_INTR (Bitfield-Mask: 0x01)     */
#define BLE_BLELL_EVENT_INTR_SM_INTR_Pos  (4UL)                 /*!< BLE_BLELL EVENT_INTR: SM_INTR (Bit 4)                     */
#define BLE_BLELL_EVENT_INTR_SM_INTR_Msk  (0x10UL)              /*!< BLE_BLELL EVENT_INTR: SM_INTR (Bitfield-Mask: 0x01)       */
#define BLE_BLELL_EVENT_INTR_DSM_INTR_Pos (5UL)                 /*!< BLE_BLELL EVENT_INTR: DSM_INTR (Bit 5)                    */
#define BLE_BLELL_EVENT_INTR_DSM_INTR_Msk (0x20UL)              /*!< BLE_BLELL EVENT_INTR: DSM_INTR (Bitfield-Mask: 0x01)      */
#define BLE_BLELL_EVENT_INTR_ENC_INTR_Pos (6UL)                 /*!< BLE_BLELL EVENT_INTR: ENC_INTR (Bit 6)                    */
#define BLE_BLELL_EVENT_INTR_ENC_INTR_Msk (0x40UL)              /*!< BLE_BLELL EVENT_INTR: ENC_INTR (Bitfield-Mask: 0x01)      */
#define BLE_BLELL_EVENT_INTR_RSSI_RX_DONE_INTR_Pos (7UL)        /*!< BLE_BLELL EVENT_INTR: RSSI_RX_DONE_INTR (Bit 7)           */
#define BLE_BLELL_EVENT_INTR_RSSI_RX_DONE_INTR_Msk (0x80UL)     /*!< BLE_BLELL EVENT_INTR: RSSI_RX_DONE_INTR (Bitfield-Mask: 0x01)*/
/* ================================================  BLE_BLELL.EVENT_ENABLE  ================================================= */
#define BLE_BLELL_EVENT_ENABLE_ADV_INT_EN_Pos (0UL)             /*!< BLE_BLELL EVENT_ENABLE: ADV_INT_EN (Bit 0)                */
#define BLE_BLELL_EVENT_ENABLE_ADV_INT_EN_Msk (0x1UL)           /*!< BLE_BLELL EVENT_ENABLE: ADV_INT_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_EVENT_ENABLE_SCN_INT_EN_Pos (1UL)             /*!< BLE_BLELL EVENT_ENABLE: SCN_INT_EN (Bit 1)                */
#define BLE_BLELL_EVENT_ENABLE_SCN_INT_EN_Msk (0x2UL)           /*!< BLE_BLELL EVENT_ENABLE: SCN_INT_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_EVENT_ENABLE_INIT_INT_EN_Pos (2UL)            /*!< BLE_BLELL EVENT_ENABLE: INIT_INT_EN (Bit 2)               */
#define BLE_BLELL_EVENT_ENABLE_INIT_INT_EN_Msk (0x4UL)          /*!< BLE_BLELL EVENT_ENABLE: INIT_INT_EN (Bitfield-Mask: 0x01) */
#define BLE_BLELL_EVENT_ENABLE_CONN_INT_EN_Pos (3UL)            /*!< BLE_BLELL EVENT_ENABLE: CONN_INT_EN (Bit 3)               */
#define BLE_BLELL_EVENT_ENABLE_CONN_INT_EN_Msk (0x8UL)          /*!< BLE_BLELL EVENT_ENABLE: CONN_INT_EN (Bitfield-Mask: 0x01) */
#define BLE_BLELL_EVENT_ENABLE_SM_INT_EN_Pos (4UL)              /*!< BLE_BLELL EVENT_ENABLE: SM_INT_EN (Bit 4)                 */
#define BLE_BLELL_EVENT_ENABLE_SM_INT_EN_Msk (0x10UL)           /*!< BLE_BLELL EVENT_ENABLE: SM_INT_EN (Bitfield-Mask: 0x01)   */
#define BLE_BLELL_EVENT_ENABLE_DSM_INT_EN_Pos (5UL)             /*!< BLE_BLELL EVENT_ENABLE: DSM_INT_EN (Bit 5)                */
#define BLE_BLELL_EVENT_ENABLE_DSM_INT_EN_Msk (0x20UL)          /*!< BLE_BLELL EVENT_ENABLE: DSM_INT_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_EVENT_ENABLE_ENC_INT_EN_Pos (6UL)             /*!< BLE_BLELL EVENT_ENABLE: ENC_INT_EN (Bit 6)                */
#define BLE_BLELL_EVENT_ENABLE_ENC_INT_EN_Msk (0x40UL)          /*!< BLE_BLELL EVENT_ENABLE: ENC_INT_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_EVENT_ENABLE_RSSI_RX_DONE_INT_EN_Pos (7UL)    /*!< BLE_BLELL EVENT_ENABLE: RSSI_RX_DONE_INT_EN (Bit 7)       */
#define BLE_BLELL_EVENT_ENABLE_RSSI_RX_DONE_INT_EN_Msk (0x80UL) /*!< BLE_BLELL EVENT_ENABLE: RSSI_RX_DONE_INT_EN (Bitfield-Mask: 0x01)*/
/* =================================================  BLE_BLELL.ADV_PARAMS  ================================================== */
#define BLE_BLELL_ADV_PARAMS_TX_ADDR_Pos  (0UL)                 /*!< BLE_BLELL ADV_PARAMS: TX_ADDR (Bit 0)                     */
#define BLE_BLELL_ADV_PARAMS_TX_ADDR_Msk  (0x1UL)               /*!< BLE_BLELL ADV_PARAMS: TX_ADDR (Bitfield-Mask: 0x01)       */
#define BLE_BLELL_ADV_PARAMS_ADV_TYPE_Pos (1UL)                 /*!< BLE_BLELL ADV_PARAMS: ADV_TYPE (Bit 1)                    */
#define BLE_BLELL_ADV_PARAMS_ADV_TYPE_Msk (0x6UL)               /*!< BLE_BLELL ADV_PARAMS: ADV_TYPE (Bitfield-Mask: 0x03)      */
#define BLE_BLELL_ADV_PARAMS_ADV_FILT_POLICY_Pos (3UL)          /*!< BLE_BLELL ADV_PARAMS: ADV_FILT_POLICY (Bit 3)             */
#define BLE_BLELL_ADV_PARAMS_ADV_FILT_POLICY_Msk (0x18UL)       /*!< BLE_BLELL ADV_PARAMS: ADV_FILT_POLICY (Bitfield-Mask: 0x03)*/
#define BLE_BLELL_ADV_PARAMS_ADV_CHANNEL_MAP_Pos (5UL)          /*!< BLE_BLELL ADV_PARAMS: ADV_CHANNEL_MAP (Bit 5)             */
#define BLE_BLELL_ADV_PARAMS_ADV_CHANNEL_MAP_Msk (0xe0UL)       /*!< BLE_BLELL ADV_PARAMS: ADV_CHANNEL_MAP (Bitfield-Mask: 0x07)*/
#define BLE_BLELL_ADV_PARAMS_RX_ADDR_Pos  (8UL)                 /*!< BLE_BLELL ADV_PARAMS: RX_ADDR (Bit 8)                     */
#define BLE_BLELL_ADV_PARAMS_RX_ADDR_Msk  (0x100UL)             /*!< BLE_BLELL ADV_PARAMS: RX_ADDR (Bitfield-Mask: 0x01)       */
#define BLE_BLELL_ADV_PARAMS_ADV_LOW_DUTY_CYCLE_Pos (10UL)      /*!< BLE_BLELL ADV_PARAMS: ADV_LOW_DUTY_CYCLE (Bit 10)         */
#define BLE_BLELL_ADV_PARAMS_ADV_LOW_DUTY_CYCLE_Msk (0x400UL)   /*!< BLE_BLELL ADV_PARAMS: ADV_LOW_DUTY_CYCLE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_PARAMS_INITA_RPA_CHECK_Pos (11UL)         /*!< BLE_BLELL ADV_PARAMS: INITA_RPA_CHECK (Bit 11)            */
#define BLE_BLELL_ADV_PARAMS_INITA_RPA_CHECK_Msk (0x800UL)      /*!< BLE_BLELL ADV_PARAMS: INITA_RPA_CHECK (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_PARAMS_TX_ADDR_PRIV_Pos (12UL)            /*!< BLE_BLELL ADV_PARAMS: TX_ADDR_PRIV (Bit 12)               */
#define BLE_BLELL_ADV_PARAMS_TX_ADDR_PRIV_Msk (0x1000UL)        /*!< BLE_BLELL ADV_PARAMS: TX_ADDR_PRIV (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_ADV_PARAMS_ADV_RCV_IA_IN_PRIV_Pos (13UL)      /*!< BLE_BLELL ADV_PARAMS: ADV_RCV_IA_IN_PRIV (Bit 13)         */
#define BLE_BLELL_ADV_PARAMS_ADV_RCV_IA_IN_PRIV_Msk (0x2000UL)  /*!< BLE_BLELL ADV_PARAMS: ADV_RCV_IA_IN_PRIV (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_PARAMS_ADV_RPT_PEER_NRPA_ADDR_IN_PRIV_Pos (14UL) /*!< BLE_BLELL ADV_PARAMS: ADV_RPT_PEER_NRPA_ADDR_IN_PRIV (Bit 14)*/
#define BLE_BLELL_ADV_PARAMS_ADV_RPT_PEER_NRPA_ADDR_IN_PRIV_Msk (0x4000UL) /*!< BLE_BLELL ADV_PARAMS: ADV_RPT_PEER_NRPA_ADDR_IN_PRIV (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_PARAMS_RCV_TX_ADDR_Pos (15UL)             /*!< BLE_BLELL ADV_PARAMS: RCV_TX_ADDR (Bit 15)                */
#define BLE_BLELL_ADV_PARAMS_RCV_TX_ADDR_Msk (0x8000UL)         /*!< BLE_BLELL ADV_PARAMS: RCV_TX_ADDR (Bitfield-Mask: 0x01)   */
/* ============================================  BLE_BLELL.ADV_INTERVAL_TIMEOUT  ============================================= */
#define BLE_BLELL_ADV_INTERVAL_TIMEOUT_ADV_INTERVAL_Pos (0UL)   /*!< BLE_BLELL ADV_INTERVAL_TIMEOUT: ADV_INTERVAL (Bit 0)      */
#define BLE_BLELL_ADV_INTERVAL_TIMEOUT_ADV_INTERVAL_Msk (0x7fffUL) /*!< BLE_BLELL ADV_INTERVAL_TIMEOUT: ADV_INTERVAL (Bitfield-Mask: 0x7fff)*/
/* ==================================================  BLE_BLELL.ADV_INTR  =================================================== */
#define BLE_BLELL_ADV_INTR_ADV_STRT_INTR_Pos (0UL)              /*!< BLE_BLELL ADV_INTR: ADV_STRT_INTR (Bit 0)                 */
#define BLE_BLELL_ADV_INTR_ADV_STRT_INTR_Msk (0x1UL)            /*!< BLE_BLELL ADV_INTR: ADV_STRT_INTR (Bitfield-Mask: 0x01)   */
#define BLE_BLELL_ADV_INTR_ADV_CLOSE_INTR_Pos (1UL)             /*!< BLE_BLELL ADV_INTR: ADV_CLOSE_INTR (Bit 1)                */
#define BLE_BLELL_ADV_INTR_ADV_CLOSE_INTR_Msk (0x2UL)           /*!< BLE_BLELL ADV_INTR: ADV_CLOSE_INTR (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_ADV_INTR_ADV_TX_INTR_Pos (2UL)                /*!< BLE_BLELL ADV_INTR: ADV_TX_INTR (Bit 2)                   */
#define BLE_BLELL_ADV_INTR_ADV_TX_INTR_Msk (0x4UL)              /*!< BLE_BLELL ADV_INTR: ADV_TX_INTR (Bitfield-Mask: 0x01)     */
#define BLE_BLELL_ADV_INTR_SCAN_RSP_TX_INTR_Pos (3UL)           /*!< BLE_BLELL ADV_INTR: SCAN_RSP_TX_INTR (Bit 3)              */
#define BLE_BLELL_ADV_INTR_SCAN_RSP_TX_INTR_Msk (0x8UL)         /*!< BLE_BLELL ADV_INTR: SCAN_RSP_TX_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_INTR_SCAN_REQ_RX_INTR_Pos (4UL)           /*!< BLE_BLELL ADV_INTR: SCAN_REQ_RX_INTR (Bit 4)              */
#define BLE_BLELL_ADV_INTR_SCAN_REQ_RX_INTR_Msk (0x10UL)        /*!< BLE_BLELL ADV_INTR: SCAN_REQ_RX_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_INTR_CONN_REQ_RX_INTR_Pos (5UL)           /*!< BLE_BLELL ADV_INTR: CONN_REQ_RX_INTR (Bit 5)              */
#define BLE_BLELL_ADV_INTR_CONN_REQ_RX_INTR_Msk (0x20UL)        /*!< BLE_BLELL ADV_INTR: CONN_REQ_RX_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_INTR_SLV_CONNECTED_Pos (6UL)              /*!< BLE_BLELL ADV_INTR: SLV_CONNECTED (Bit 6)                 */
#define BLE_BLELL_ADV_INTR_SLV_CONNECTED_Msk (0x40UL)           /*!< BLE_BLELL ADV_INTR: SLV_CONNECTED (Bitfield-Mask: 0x01)   */
#define BLE_BLELL_ADV_INTR_ADV_TIMEOUT_Pos (7UL)                /*!< BLE_BLELL ADV_INTR: ADV_TIMEOUT (Bit 7)                   */
#define BLE_BLELL_ADV_INTR_ADV_TIMEOUT_Msk (0x80UL)             /*!< BLE_BLELL ADV_INTR: ADV_TIMEOUT (Bitfield-Mask: 0x01)     */
#define BLE_BLELL_ADV_INTR_ADV_ON_Pos     (8UL)                 /*!< BLE_BLELL ADV_INTR: ADV_ON (Bit 8)                        */
#define BLE_BLELL_ADV_INTR_ADV_ON_Msk     (0x100UL)             /*!< BLE_BLELL ADV_INTR: ADV_ON (Bitfield-Mask: 0x01)          */
#define BLE_BLELL_ADV_INTR_SLV_CONN_PEER_RPA_UNMCH_INTR_Pos (9UL) /*!< BLE_BLELL ADV_INTR: SLV_CONN_PEER_RPA_UNMCH_INTR (Bit 9)*/
#define BLE_BLELL_ADV_INTR_SLV_CONN_PEER_RPA_UNMCH_INTR_Msk (0x200UL) /*!< BLE_BLELL ADV_INTR: SLV_CONN_PEER_RPA_UNMCH_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_INTR_SCAN_REQ_RX_PEER_RPA_UNMCH_INTR_Pos (10UL) /*!< BLE_BLELL ADV_INTR: SCAN_REQ_RX_PEER_RPA_UNMCH_INTR (Bit 10)*/
#define BLE_BLELL_ADV_INTR_SCAN_REQ_RX_PEER_RPA_UNMCH_INTR_Msk (0x400UL) /*!< BLE_BLELL ADV_INTR: SCAN_REQ_RX_PEER_RPA_UNMCH_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_INTR_INIT_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos (11UL) /*!< BLE_BLELL ADV_INTR: INIT_ADDR_MATCH_PRIV_MISMATCH_INTR (Bit 11)*/
#define BLE_BLELL_ADV_INTR_INIT_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk (0x800UL) /*!< BLE_BLELL ADV_INTR: INIT_ADDR_MATCH_PRIV_MISMATCH_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_INTR_SCAN_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos (12UL) /*!< BLE_BLELL ADV_INTR: SCAN_ADDR_MATCH_PRIV_MISMATCH_INTR (Bit 12)*/
#define BLE_BLELL_ADV_INTR_SCAN_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk (0x1000UL) /*!< BLE_BLELL ADV_INTR: SCAN_ADDR_MATCH_PRIV_MISMATCH_INTR (Bitfield-Mask: 0x01)*/
/* ==============================================  BLE_BLELL.ADV_NEXT_INSTANT  =============================================== */
#define BLE_BLELL_ADV_NEXT_INSTANT_ADV_NEXT_INSTANT_Pos (0UL)   /*!< BLE_BLELL ADV_NEXT_INSTANT: ADV_NEXT_INSTANT (Bit 0)      */
#define BLE_BLELL_ADV_NEXT_INSTANT_ADV_NEXT_INSTANT_Msk (0xffffUL) /*!< BLE_BLELL ADV_NEXT_INSTANT: ADV_NEXT_INSTANT (Bitfield-Mask: 0xffff)*/
/* ================================================  BLE_BLELL.SCAN_INTERVAL  ================================================ */
#define BLE_BLELL_SCAN_INTERVAL_SCAN_INTERVAL_Pos (0UL)         /*!< BLE_BLELL SCAN_INTERVAL: SCAN_INTERVAL (Bit 0)            */
#define BLE_BLELL_SCAN_INTERVAL_SCAN_INTERVAL_Msk (0xffffUL)    /*!< BLE_BLELL SCAN_INTERVAL: SCAN_INTERVAL (Bitfield-Mask: 0xffff)*/
/* =================================================  BLE_BLELL.SCAN_WINDOW  ================================================= */
#define BLE_BLELL_SCAN_WINDOW_SCAN_WINDOW_Pos (0UL)             /*!< BLE_BLELL SCAN_WINDOW: SCAN_WINDOW (Bit 0)                */
#define BLE_BLELL_SCAN_WINDOW_SCAN_WINDOW_Msk (0xffffUL)        /*!< BLE_BLELL SCAN_WINDOW: SCAN_WINDOW (Bitfield-Mask: 0xffff)*/
/* =================================================  BLE_BLELL.SCAN_PARAM  ================================================== */
#define BLE_BLELL_SCAN_PARAM_TX_ADDR_Pos  (0UL)                 /*!< BLE_BLELL SCAN_PARAM: TX_ADDR (Bit 0)                     */
#define BLE_BLELL_SCAN_PARAM_TX_ADDR_Msk  (0x1UL)               /*!< BLE_BLELL SCAN_PARAM: TX_ADDR (Bitfield-Mask: 0x01)       */
#define BLE_BLELL_SCAN_PARAM_SCAN_TYPE_Pos (1UL)                /*!< BLE_BLELL SCAN_PARAM: SCAN_TYPE (Bit 1)                   */
#define BLE_BLELL_SCAN_PARAM_SCAN_TYPE_Msk (0x6UL)              /*!< BLE_BLELL SCAN_PARAM: SCAN_TYPE (Bitfield-Mask: 0x03)     */
#define BLE_BLELL_SCAN_PARAM_SCAN_FILT_POLICY_Pos (3UL)         /*!< BLE_BLELL SCAN_PARAM: SCAN_FILT_POLICY (Bit 3)            */
#define BLE_BLELL_SCAN_PARAM_SCAN_FILT_POLICY_Msk (0x18UL)      /*!< BLE_BLELL SCAN_PARAM: SCAN_FILT_POLICY (Bitfield-Mask: 0x03)*/
#define BLE_BLELL_SCAN_PARAM_DUP_FILT_EN_Pos (5UL)              /*!< BLE_BLELL SCAN_PARAM: DUP_FILT_EN (Bit 5)                 */
#define BLE_BLELL_SCAN_PARAM_DUP_FILT_EN_Msk (0x20UL)           /*!< BLE_BLELL SCAN_PARAM: DUP_FILT_EN (Bitfield-Mask: 0x01)   */
#define BLE_BLELL_SCAN_PARAM_DUP_FILT_CHK_ADV_DIR_Pos (6UL)     /*!< BLE_BLELL SCAN_PARAM: DUP_FILT_CHK_ADV_DIR (Bit 6)        */
#define BLE_BLELL_SCAN_PARAM_DUP_FILT_CHK_ADV_DIR_Msk (0x40UL)  /*!< BLE_BLELL SCAN_PARAM: DUP_FILT_CHK_ADV_DIR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_PARAM_SCAN_RSP_ADVA_CHECK_Pos (7UL)      /*!< BLE_BLELL SCAN_PARAM: SCAN_RSP_ADVA_CHECK (Bit 7)         */
#define BLE_BLELL_SCAN_PARAM_SCAN_RSP_ADVA_CHECK_Msk (0x80UL)   /*!< BLE_BLELL SCAN_PARAM: SCAN_RSP_ADVA_CHECK (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_PARAM_SCAN_RCV_IA_IN_PRIV_Pos (8UL)      /*!< BLE_BLELL SCAN_PARAM: SCAN_RCV_IA_IN_PRIV (Bit 8)         */
#define BLE_BLELL_SCAN_PARAM_SCAN_RCV_IA_IN_PRIV_Msk (0x100UL)  /*!< BLE_BLELL SCAN_PARAM: SCAN_RCV_IA_IN_PRIV (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_PARAM_SCAN_RPT_PEER_NRPA_ADDR_IN_PRIV_Pos (9UL) /*!< BLE_BLELL SCAN_PARAM: SCAN_RPT_PEER_NRPA_ADDR_IN_PRIV (Bit 9)*/
#define BLE_BLELL_SCAN_PARAM_SCAN_RPT_PEER_NRPA_ADDR_IN_PRIV_Msk (0x200UL) /*!< BLE_BLELL SCAN_PARAM: SCAN_RPT_PEER_NRPA_ADDR_IN_PRIV (Bitfield-Mask: 0x01)*/
/* ==================================================  BLE_BLELL.SCAN_INTR  ================================================== */
#define BLE_BLELL_SCAN_INTR_SCAN_STRT_INTR_Pos (0UL)            /*!< BLE_BLELL SCAN_INTR: SCAN_STRT_INTR (Bit 0)               */
#define BLE_BLELL_SCAN_INTR_SCAN_STRT_INTR_Msk (0x1UL)          /*!< BLE_BLELL SCAN_INTR: SCAN_STRT_INTR (Bitfield-Mask: 0x01) */
#define BLE_BLELL_SCAN_INTR_SCAN_CLOSE_INTR_Pos (1UL)           /*!< BLE_BLELL SCAN_INTR: SCAN_CLOSE_INTR (Bit 1)              */
#define BLE_BLELL_SCAN_INTR_SCAN_CLOSE_INTR_Msk (0x2UL)         /*!< BLE_BLELL SCAN_INTR: SCAN_CLOSE_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_INTR_SCAN_TX_INTR_Pos (2UL)              /*!< BLE_BLELL SCAN_INTR: SCAN_TX_INTR (Bit 2)                 */
#define BLE_BLELL_SCAN_INTR_SCAN_TX_INTR_Msk (0x4UL)            /*!< BLE_BLELL SCAN_INTR: SCAN_TX_INTR (Bitfield-Mask: 0x01)   */
#define BLE_BLELL_SCAN_INTR_ADV_RX_INTR_Pos (3UL)               /*!< BLE_BLELL SCAN_INTR: ADV_RX_INTR (Bit 3)                  */
#define BLE_BLELL_SCAN_INTR_ADV_RX_INTR_Msk (0x8UL)             /*!< BLE_BLELL SCAN_INTR: ADV_RX_INTR (Bitfield-Mask: 0x01)    */
#define BLE_BLELL_SCAN_INTR_SCAN_RSP_RX_INTR_Pos (4UL)          /*!< BLE_BLELL SCAN_INTR: SCAN_RSP_RX_INTR (Bit 4)             */
#define BLE_BLELL_SCAN_INTR_SCAN_RSP_RX_INTR_Msk (0x10UL)       /*!< BLE_BLELL SCAN_INTR: SCAN_RSP_RX_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_INTR_ADV_RX_PEER_RPA_UNMCH_INTR_Pos (5UL) /*!< BLE_BLELL SCAN_INTR: ADV_RX_PEER_RPA_UNMCH_INTR (Bit 5)  */
#define BLE_BLELL_SCAN_INTR_ADV_RX_PEER_RPA_UNMCH_INTR_Msk (0x20UL) /*!< BLE_BLELL SCAN_INTR: ADV_RX_PEER_RPA_UNMCH_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_INTR_ADV_RX_SELF_RPA_UNMCH_INTR_Pos (6UL) /*!< BLE_BLELL SCAN_INTR: ADV_RX_SELF_RPA_UNMCH_INTR (Bit 6)  */
#define BLE_BLELL_SCAN_INTR_ADV_RX_SELF_RPA_UNMCH_INTR_Msk (0x40UL) /*!< BLE_BLELL SCAN_INTR: ADV_RX_SELF_RPA_UNMCH_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_INTR_SCANA_TX_ADDR_NOT_SET_INTR_Pos (7UL) /*!< BLE_BLELL SCAN_INTR: SCANA_TX_ADDR_NOT_SET_INTR (Bit 7)  */
#define BLE_BLELL_SCAN_INTR_SCANA_TX_ADDR_NOT_SET_INTR_Msk (0x80UL) /*!< BLE_BLELL SCAN_INTR: SCANA_TX_ADDR_NOT_SET_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_INTR_SCAN_ON_Pos   (8UL)                 /*!< BLE_BLELL SCAN_INTR: SCAN_ON (Bit 8)                      */
#define BLE_BLELL_SCAN_INTR_SCAN_ON_Msk   (0x100UL)             /*!< BLE_BLELL SCAN_INTR: SCAN_ON (Bitfield-Mask: 0x01)        */
#define BLE_BLELL_SCAN_INTR_PEER_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos (9UL) /*!< BLE_BLELL SCAN_INTR: PEER_ADDR_MATCH_PRIV_MISMATCH_INTR (Bit 9)*/
#define BLE_BLELL_SCAN_INTR_PEER_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk (0x200UL) /*!< BLE_BLELL SCAN_INTR: PEER_ADDR_MATCH_PRIV_MISMATCH_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_INTR_SELF_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos (10UL) /*!< BLE_BLELL SCAN_INTR: SELF_ADDR_MATCH_PRIV_MISMATCH_INTR (Bit 10)*/
#define BLE_BLELL_SCAN_INTR_SELF_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk (0x400UL) /*!< BLE_BLELL SCAN_INTR: SELF_ADDR_MATCH_PRIV_MISMATCH_INTR (Bitfield-Mask: 0x01)*/
/* ==============================================  BLE_BLELL.SCAN_NEXT_INSTANT  ============================================== */
#define BLE_BLELL_SCAN_NEXT_INSTANT_NEXT_SCAN_INSTANT_Pos (0UL) /*!< BLE_BLELL SCAN_NEXT_INSTANT: NEXT_SCAN_INSTANT (Bit 0)    */
#define BLE_BLELL_SCAN_NEXT_INSTANT_NEXT_SCAN_INSTANT_Msk (0xffffUL) /*!< BLE_BLELL SCAN_NEXT_INSTANT: NEXT_SCAN_INSTANT (Bitfield-Mask: 0xffff)*/
/* ================================================  BLE_BLELL.INIT_INTERVAL  ================================================ */
#define BLE_BLELL_INIT_INTERVAL_INIT_SCAN_INTERVAL_Pos (0UL)    /*!< BLE_BLELL INIT_INTERVAL: INIT_SCAN_INTERVAL (Bit 0)       */
#define BLE_BLELL_INIT_INTERVAL_INIT_SCAN_INTERVAL_Msk (0xffffUL) /*!< BLE_BLELL INIT_INTERVAL: INIT_SCAN_INTERVAL (Bitfield-Mask: 0xffff)*/
/* =================================================  BLE_BLELL.INIT_WINDOW  ================================================= */
#define BLE_BLELL_INIT_WINDOW_INIT_SCAN_WINDOW_Pos (0UL)        /*!< BLE_BLELL INIT_WINDOW: INIT_SCAN_WINDOW (Bit 0)           */
#define BLE_BLELL_INIT_WINDOW_INIT_SCAN_WINDOW_Msk (0xffffUL)   /*!< BLE_BLELL INIT_WINDOW: INIT_SCAN_WINDOW (Bitfield-Mask: 0xffff)*/
/* =================================================  BLE_BLELL.INIT_PARAM  ================================================== */
#define BLE_BLELL_INIT_PARAM_TX_ADDR_Pos  (0UL)                 /*!< BLE_BLELL INIT_PARAM: TX_ADDR (Bit 0)                     */
#define BLE_BLELL_INIT_PARAM_TX_ADDR_Msk  (0x1UL)               /*!< BLE_BLELL INIT_PARAM: TX_ADDR (Bitfield-Mask: 0x01)       */
#define BLE_BLELL_INIT_PARAM_RX_ADDR__RX_TX_ADDR_Pos (1UL)      /*!< BLE_BLELL INIT_PARAM: RX_ADDR__RX_TX_ADDR (Bit 1)         */
#define BLE_BLELL_INIT_PARAM_RX_ADDR__RX_TX_ADDR_Msk (0x2UL)    /*!< BLE_BLELL INIT_PARAM: RX_ADDR__RX_TX_ADDR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_PARAM_INIT_FILT_POLICY_Pos (3UL)         /*!< BLE_BLELL INIT_PARAM: INIT_FILT_POLICY (Bit 3)            */
#define BLE_BLELL_INIT_PARAM_INIT_FILT_POLICY_Msk (0x8UL)       /*!< BLE_BLELL INIT_PARAM: INIT_FILT_POLICY (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_PARAM_INIT_RCV_IA_IN_PRIV_Pos (4UL)      /*!< BLE_BLELL INIT_PARAM: INIT_RCV_IA_IN_PRIV (Bit 4)         */
#define BLE_BLELL_INIT_PARAM_INIT_RCV_IA_IN_PRIV_Msk (0x10UL)   /*!< BLE_BLELL INIT_PARAM: INIT_RCV_IA_IN_PRIV (Bitfield-Mask: 0x01)*/
/* ==================================================  BLE_BLELL.INIT_INTR  ================================================== */
#define BLE_BLELL_INIT_INTR_INIT_INTERVAL_EXPIRE_INTR_Pos (0UL) /*!< BLE_BLELL INIT_INTR: INIT_INTERVAL_EXPIRE_INTR (Bit 0)    */
#define BLE_BLELL_INIT_INTR_INIT_INTERVAL_EXPIRE_INTR_Msk (0x1UL) /*!< BLE_BLELL INIT_INTR: INIT_INTERVAL_EXPIRE_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_INTR_INIT_CLOSE_WINDOW_INR_Pos (1UL)     /*!< BLE_BLELL INIT_INTR: INIT_CLOSE_WINDOW_INR (Bit 1)        */
#define BLE_BLELL_INIT_INTR_INIT_CLOSE_WINDOW_INR_Msk (0x2UL)   /*!< BLE_BLELL INIT_INTR: INIT_CLOSE_WINDOW_INR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_INTR_INIT_TX_START_INTR_Pos (2UL)        /*!< BLE_BLELL INIT_INTR: INIT_TX_START_INTR (Bit 2)           */
#define BLE_BLELL_INIT_INTR_INIT_TX_START_INTR_Msk (0x4UL)      /*!< BLE_BLELL INIT_INTR: INIT_TX_START_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_INTR_MASTER_CONN_CREATED_Pos (4UL)       /*!< BLE_BLELL INIT_INTR: MASTER_CONN_CREATED (Bit 4)          */
#define BLE_BLELL_INIT_INTR_MASTER_CONN_CREATED_Msk (0x10UL)    /*!< BLE_BLELL INIT_INTR: MASTER_CONN_CREATED (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_INTR_ADV_RX_SELF_ADDR_UNMCH_INTR_Pos (5UL) /*!< BLE_BLELL INIT_INTR: ADV_RX_SELF_ADDR_UNMCH_INTR (Bit 5)*/
#define BLE_BLELL_INIT_INTR_ADV_RX_SELF_ADDR_UNMCH_INTR_Msk (0x20UL) /*!< BLE_BLELL INIT_INTR: ADV_RX_SELF_ADDR_UNMCH_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_INTR_ADV_RX_PEER_ADDR_UNMCH_INTR_Pos (6UL) /*!< BLE_BLELL INIT_INTR: ADV_RX_PEER_ADDR_UNMCH_INTR (Bit 6)*/
#define BLE_BLELL_INIT_INTR_ADV_RX_PEER_ADDR_UNMCH_INTR_Msk (0x40UL) /*!< BLE_BLELL INIT_INTR: ADV_RX_PEER_ADDR_UNMCH_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_INTR_INITA_TX_ADDR_NOT_SET_INTR_Pos (7UL) /*!< BLE_BLELL INIT_INTR: INITA_TX_ADDR_NOT_SET_INTR (Bit 7)  */
#define BLE_BLELL_INIT_INTR_INITA_TX_ADDR_NOT_SET_INTR_Msk (0x80UL) /*!< BLE_BLELL INIT_INTR: INITA_TX_ADDR_NOT_SET_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_INTR_INI_PEER_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos (8UL) /*!< BLE_BLELL INIT_INTR: INI_PEER_ADDR_MATCH_PRIV_MISMATCH_INTR (Bit 8)*/
#define BLE_BLELL_INIT_INTR_INI_PEER_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk (0x100UL) /*!< BLE_BLELL INIT_INTR: INI_PEER_ADDR_MATCH_PRIV_MISMATCH_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_INTR_INI_SELF_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos (9UL) /*!< BLE_BLELL INIT_INTR: INI_SELF_ADDR_MATCH_PRIV_MISMATCH_INTR (Bit 9)*/
#define BLE_BLELL_INIT_INTR_INI_SELF_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk (0x200UL) /*!< BLE_BLELL INIT_INTR: INI_SELF_ADDR_MATCH_PRIV_MISMATCH_INTR (Bitfield-Mask: 0x01)*/
/* ==============================================  BLE_BLELL.INIT_NEXT_INSTANT  ============================================== */
#define BLE_BLELL_INIT_NEXT_INSTANT_INIT_NEXT_INSTANT_Pos (0UL) /*!< BLE_BLELL INIT_NEXT_INSTANT: INIT_NEXT_INSTANT (Bit 0)    */
#define BLE_BLELL_INIT_NEXT_INSTANT_INIT_NEXT_INSTANT_Msk (0xffffUL) /*!< BLE_BLELL INIT_NEXT_INSTANT: INIT_NEXT_INSTANT (Bitfield-Mask: 0xffff)*/
