ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
/* =============================================  BLE_BLELL.DEVICE_RAND_ADDR_L  ============================================== */
#define BLE_BLELL_DEVICE_RAND_ADDR_L_DEVICE_RAND_ADDR_L_Pos (0UL) /*!< BLE_BLELL DEVICE_RAND_ADDR_L: DEVICE_RAND_ADDR_L (Bit 0)*/
#define BLE_BLELL_DEVICE_RAND_ADDR_L_DEVICE_RAND_ADDR_L_Msk (0xffffUL) /*!< BLE_BLELL DEVICE_RAND_ADDR_L: DEVICE_RAND_ADDR_L (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_BLELL.DEVICE_RAND_ADDR_M  ============================================== */
#define BLE_BLELL_DEVICE_RAND_ADDR_M_DEVICE_RAND_ADDR_M_Pos (0UL) /*!< BLE_BLELL DEVICE_RAND_ADDR_M: DEVICE_RAND_ADDR_M (Bit 0)*/
#define BLE_BLELL_DEVICE_RAND_ADDR_M_DEVICE_RAND_ADDR_M_Msk (0xffffUL) /*!< BLE_BLELL DEVICE_RAND_ADDR_M: DEVICE_RAND_ADDR_M (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_BLELL.DEVICE_RAND_ADDR_H  ============================================== */
#define BLE_BLELL_DEVICE_RAND_ADDR_H_DEVICE_RAND_ADDR_H_Pos (0UL) /*!< BLE_BLELL DEVICE_RAND_ADDR_H: DEVICE_RAND_ADDR_H (Bit 0)*/
#define BLE_BLELL_DEVICE_RAND_ADDR_H_DEVICE_RAND_ADDR_H_Msk (0xffffUL) /*!< BLE_BLELL DEVICE_RAND_ADDR_H: DEVICE_RAND_ADDR_H (Bitfield-Mask: 0xffff)*/
/* =================================================  BLE_BLELL.PEER_ADDR_L  ================================================= */
#define BLE_BLELL_PEER_ADDR_L_PEER_ADDR_L_Pos (0UL)             /*!< BLE_BLELL PEER_ADDR_L: PEER_ADDR_L (Bit 0)                */
#define BLE_BLELL_PEER_ADDR_L_PEER_ADDR_L_Msk (0xffffUL)        /*!< BLE_BLELL PEER_ADDR_L: PEER_ADDR_L (Bitfield-Mask: 0xffff)*/
/* =================================================  BLE_BLELL.PEER_ADDR_M  ================================================= */
#define BLE_BLELL_PEER_ADDR_M_PEER_ADDR_M_Pos (0UL)             /*!< BLE_BLELL PEER_ADDR_M: PEER_ADDR_M (Bit 0)                */
#define BLE_BLELL_PEER_ADDR_M_PEER_ADDR_M_Msk (0xffffUL)        /*!< BLE_BLELL PEER_ADDR_M: PEER_ADDR_M (Bitfield-Mask: 0xffff)*/
/* =================================================  BLE_BLELL.PEER_ADDR_H  ================================================= */
#define BLE_BLELL_PEER_ADDR_H_PEER_ADDR_H_Pos (0UL)             /*!< BLE_BLELL PEER_ADDR_H: PEER_ADDR_H (Bit 0)                */
#define BLE_BLELL_PEER_ADDR_H_PEER_ADDR_H_Msk (0xffffUL)        /*!< BLE_BLELL PEER_ADDR_H: PEER_ADDR_H (Bitfield-Mask: 0xffff)*/
/* ================================================  BLE_BLELL.WL_ADDR_TYPE  ================================================= */
#define BLE_BLELL_WL_ADDR_TYPE_WL_ADDR_TYPE_Pos (0UL)           /*!< BLE_BLELL WL_ADDR_TYPE: WL_ADDR_TYPE (Bit 0)              */
#define BLE_BLELL_WL_ADDR_TYPE_WL_ADDR_TYPE_Msk (0xffffUL)      /*!< BLE_BLELL WL_ADDR_TYPE: WL_ADDR_TYPE (Bitfield-Mask: 0xffff)*/
/* ==================================================  BLE_BLELL.WL_ENABLE  ================================================== */
#define BLE_BLELL_WL_ENABLE_WL_ENABLE_Pos (0UL)                 /*!< BLE_BLELL WL_ENABLE: WL_ENABLE (Bit 0)                    */
#define BLE_BLELL_WL_ENABLE_WL_ENABLE_Msk (0xffffUL)            /*!< BLE_BLELL WL_ENABLE: WL_ENABLE (Bitfield-Mask: 0xffff)    */
/* ===========================================  BLE_BLELL.TRANSMIT_WINDOW_OFFSET  ============================================ */
#define BLE_BLELL_TRANSMIT_WINDOW_OFFSET_TX_WINDOW_OFFSET_Pos (0UL) /*!< BLE_BLELL TRANSMIT_WINDOW_OFFSET: TX_WINDOW_OFFSET (Bit 0)*/
#define BLE_BLELL_TRANSMIT_WINDOW_OFFSET_TX_WINDOW_OFFSET_Msk (0xffffUL) /*!< BLE_BLELL TRANSMIT_WINDOW_OFFSET: TX_WINDOW_OFFSET (Bitfield-Mask: 0xffff)*/
/* ============================================  BLE_BLELL.TRANSMIT_WINDOW_SIZE  ============================================= */
#define BLE_BLELL_TRANSMIT_WINDOW_SIZE_TX_WINDOW_SIZE_Pos (0UL) /*!< BLE_BLELL TRANSMIT_WINDOW_SIZE: TX_WINDOW_SIZE (Bit 0)    */
#define BLE_BLELL_TRANSMIT_WINDOW_SIZE_TX_WINDOW_SIZE_Msk (0xffUL) /*!< BLE_BLELL TRANSMIT_WINDOW_SIZE: TX_WINDOW_SIZE (Bitfield-Mask: 0xff)*/
/* ==============================================  BLE_BLELL.DATA_CHANNELS_L0  =============================================== */
#define BLE_BLELL_DATA_CHANNELS_L0_DATA_CHANNELS_L0_Pos (0UL)   /*!< BLE_BLELL DATA_CHANNELS_L0: DATA_CHANNELS_L0 (Bit 0)      */
#define BLE_BLELL_DATA_CHANNELS_L0_DATA_CHANNELS_L0_Msk (0xffffUL) /*!< BLE_BLELL DATA_CHANNELS_L0: DATA_CHANNELS_L0 (Bitfield-Mask: 0xffff)*/
/* ==============================================  BLE_BLELL.DATA_CHANNELS_M0  =============================================== */
#define BLE_BLELL_DATA_CHANNELS_M0_DATA_CHANNELS_M0_Pos (0UL)   /*!< BLE_BLELL DATA_CHANNELS_M0: DATA_CHANNELS_M0 (Bit 0)      */
#define BLE_BLELL_DATA_CHANNELS_M0_DATA_CHANNELS_M0_Msk (0xffffUL) /*!< BLE_BLELL DATA_CHANNELS_M0: DATA_CHANNELS_M0 (Bitfield-Mask: 0xffff)*/
/* ==============================================  BLE_BLELL.DATA_CHANNELS_H0  =============================================== */
#define BLE_BLELL_DATA_CHANNELS_H0_DATA_CHANNELS_H0_Pos (0UL)   /*!< BLE_BLELL DATA_CHANNELS_H0: DATA_CHANNELS_H0 (Bit 0)      */
#define BLE_BLELL_DATA_CHANNELS_H0_DATA_CHANNELS_H0_Msk (0x1fUL) /*!< BLE_BLELL DATA_CHANNELS_H0: DATA_CHANNELS_H0 (Bitfield-Mask: 0x1f)*/
/* ==============================================  BLE_BLELL.DATA_CHANNELS_L1  =============================================== */
#define BLE_BLELL_DATA_CHANNELS_L1_DATA_CHANNELS_L1_Pos (0UL)   /*!< BLE_BLELL DATA_CHANNELS_L1: DATA_CHANNELS_L1 (Bit 0)      */
#define BLE_BLELL_DATA_CHANNELS_L1_DATA_CHANNELS_L1_Msk (0xffffUL) /*!< BLE_BLELL DATA_CHANNELS_L1: DATA_CHANNELS_L1 (Bitfield-Mask: 0xffff)*/
/* ==============================================  BLE_BLELL.DATA_CHANNELS_M1  =============================================== */
#define BLE_BLELL_DATA_CHANNELS_M1_DATA_CHANNELS_M1_Pos (0UL)   /*!< BLE_BLELL DATA_CHANNELS_M1: DATA_CHANNELS_M1 (Bit 0)      */
#define BLE_BLELL_DATA_CHANNELS_M1_DATA_CHANNELS_M1_Msk (0xffffUL) /*!< BLE_BLELL DATA_CHANNELS_M1: DATA_CHANNELS_M1 (Bitfield-Mask: 0xffff)*/
/* ==============================================  BLE_BLELL.DATA_CHANNELS_H1  =============================================== */
#define BLE_BLELL_DATA_CHANNELS_H1_DATA_CHANNELS_H1_Pos (0UL)   /*!< BLE_BLELL DATA_CHANNELS_H1: DATA_CHANNELS_H1 (Bit 0)      */
#define BLE_BLELL_DATA_CHANNELS_H1_DATA_CHANNELS_H1_Msk (0x1fUL) /*!< BLE_BLELL DATA_CHANNELS_H1: DATA_CHANNELS_H1 (Bitfield-Mask: 0x1f)*/
/* ==================================================  BLE_BLELL.CONN_INTR  ================================================== */
#define BLE_BLELL_CONN_INTR_CONN_CLOSED_Pos (0UL)               /*!< BLE_BLELL CONN_INTR: CONN_CLOSED (Bit 0)                  */
#define BLE_BLELL_CONN_INTR_CONN_CLOSED_Msk (0x1UL)             /*!< BLE_BLELL CONN_INTR: CONN_CLOSED (Bitfield-Mask: 0x01)    */
#define BLE_BLELL_CONN_INTR_CONN_ESTB_Pos (1UL)                 /*!< BLE_BLELL CONN_INTR: CONN_ESTB (Bit 1)                    */
#define BLE_BLELL_CONN_INTR_CONN_ESTB_Msk (0x2UL)               /*!< BLE_BLELL CONN_INTR: CONN_ESTB (Bitfield-Mask: 0x01)      */
#define BLE_BLELL_CONN_INTR_MAP_UPDT_DONE_Pos (2UL)             /*!< BLE_BLELL CONN_INTR: MAP_UPDT_DONE (Bit 2)                */
#define BLE_BLELL_CONN_INTR_MAP_UPDT_DONE_Msk (0x4UL)           /*!< BLE_BLELL CONN_INTR: MAP_UPDT_DONE (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_CONN_INTR_START_CE_Pos  (3UL)                 /*!< BLE_BLELL CONN_INTR: START_CE (Bit 3)                     */
#define BLE_BLELL_CONN_INTR_START_CE_Msk  (0x8UL)               /*!< BLE_BLELL CONN_INTR: START_CE (Bitfield-Mask: 0x01)       */
#define BLE_BLELL_CONN_INTR_CLOSE_CE_Pos  (4UL)                 /*!< BLE_BLELL CONN_INTR: CLOSE_CE (Bit 4)                     */
#define BLE_BLELL_CONN_INTR_CLOSE_CE_Msk  (0x10UL)              /*!< BLE_BLELL CONN_INTR: CLOSE_CE (Bitfield-Mask: 0x01)       */
#define BLE_BLELL_CONN_INTR_CE_TX_ACK_Pos (5UL)                 /*!< BLE_BLELL CONN_INTR: CE_TX_ACK (Bit 5)                    */
#define BLE_BLELL_CONN_INTR_CE_TX_ACK_Msk (0x20UL)              /*!< BLE_BLELL CONN_INTR: CE_TX_ACK (Bitfield-Mask: 0x01)      */
#define BLE_BLELL_CONN_INTR_CE_RX_Pos     (6UL)                 /*!< BLE_BLELL CONN_INTR: CE_RX (Bit 6)                        */
#define BLE_BLELL_CONN_INTR_CE_RX_Msk     (0x40UL)              /*!< BLE_BLELL CONN_INTR: CE_RX (Bitfield-Mask: 0x01)          */
#define BLE_BLELL_CONN_INTR_CON_UPDT_DONE_Pos (7UL)             /*!< BLE_BLELL CONN_INTR: CON_UPDT_DONE (Bit 7)                */
#define BLE_BLELL_CONN_INTR_CON_UPDT_DONE_Msk (0x80UL)          /*!< BLE_BLELL CONN_INTR: CON_UPDT_DONE (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_CONN_INTR_DISCON_STATUS_Pos (8UL)             /*!< BLE_BLELL CONN_INTR: DISCON_STATUS (Bit 8)                */
#define BLE_BLELL_CONN_INTR_DISCON_STATUS_Msk (0x700UL)         /*!< BLE_BLELL CONN_INTR: DISCON_STATUS (Bitfield-Mask: 0x07)  */
#define BLE_BLELL_CONN_INTR_RX_PDU_STATUS_Pos (11UL)            /*!< BLE_BLELL CONN_INTR: RX_PDU_STATUS (Bit 11)               */
#define BLE_BLELL_CONN_INTR_RX_PDU_STATUS_Msk (0x3800UL)        /*!< BLE_BLELL CONN_INTR: RX_PDU_STATUS (Bitfield-Mask: 0x07)  */
#define BLE_BLELL_CONN_INTR_PING_TIMER_EXPIRD_INTR_Pos (14UL)   /*!< BLE_BLELL CONN_INTR: PING_TIMER_EXPIRD_INTR (Bit 14)      */
#define BLE_BLELL_CONN_INTR_PING_TIMER_EXPIRD_INTR_Msk (0x4000UL) /*!< BLE_BLELL CONN_INTR: PING_TIMER_EXPIRD_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_PING_NEARLY_EXPIRD_INTR_Pos (15UL)  /*!< BLE_BLELL CONN_INTR: PING_NEARLY_EXPIRD_INTR (Bit 15)     */
#define BLE_BLELL_CONN_INTR_PING_NEARLY_EXPIRD_INTR_Msk (0x8000UL) /*!< BLE_BLELL CONN_INTR: PING_NEARLY_EXPIRD_INTR (Bitfield-Mask: 0x01)*/
/* =================================================  BLE_BLELL.CONN_STATUS  ================================================= */
#define BLE_BLELL_CONN_STATUS_RECEIVE_PACKET_COUNT_Pos (12UL)   /*!< BLE_BLELL CONN_STATUS: RECEIVE_PACKET_COUNT (Bit 12)      */
#define BLE_BLELL_CONN_STATUS_RECEIVE_PACKET_COUNT_Msk (0xf000UL) /*!< BLE_BLELL CONN_STATUS: RECEIVE_PACKET_COUNT (Bitfield-Mask: 0x0f)*/
/* =================================================  BLE_BLELL.CONN_INDEX  ================================================== */
#define BLE_BLELL_CONN_INDEX_CONN_INDEX_Pos (0UL)               /*!< BLE_BLELL CONN_INDEX: CONN_INDEX (Bit 0)                  */
#define BLE_BLELL_CONN_INDEX_CONN_INDEX_Msk (0xffffUL)          /*!< BLE_BLELL CONN_INDEX: CONN_INDEX (Bitfield-Mask: 0xffff)  */
/* ================================================  BLE_BLELL.WAKEUP_CONFIG  ================================================ */
#define BLE_BLELL_WAKEUP_CONFIG_OSC_STARTUP_DELAY_Pos (0UL)     /*!< BLE_BLELL WAKEUP_CONFIG: OSC_STARTUP_DELAY (Bit 0)        */
#define BLE_BLELL_WAKEUP_CONFIG_OSC_STARTUP_DELAY_Msk (0xffUL)  /*!< BLE_BLELL WAKEUP_CONFIG: OSC_STARTUP_DELAY (Bitfield-Mask: 0xff)*/
#define BLE_BLELL_WAKEUP_CONFIG_DSM_OFFSET_TO_WAKEUP_INSTANT_Pos (10UL) /*!< BLE_BLELL WAKEUP_CONFIG: DSM_OFFSET_TO_WAKEUP_INSTANT (Bit 10)*/
#define BLE_BLELL_WAKEUP_CONFIG_DSM_OFFSET_TO_WAKEUP_INSTANT_Msk (0xfc00UL) /*!< BLE_BLELL WAKEUP_CONFIG: DSM_OFFSET_TO_WAKEUP_INSTANT (Bitfield-Mask: 0x3f)*/
/* ===============================================  BLE_BLELL.WAKEUP_CONTROL  ================================================ */
#define BLE_BLELL_WAKEUP_CONTROL_WAKEUP_INSTANT_Pos (0UL)       /*!< BLE_BLELL WAKEUP_CONTROL: WAKEUP_INSTANT (Bit 0)          */
#define BLE_BLELL_WAKEUP_CONTROL_WAKEUP_INSTANT_Msk (0xffffUL)  /*!< BLE_BLELL WAKEUP_CONTROL: WAKEUP_INSTANT (Bitfield-Mask: 0xffff)*/
/* ================================================  BLE_BLELL.CLOCK_CONFIG  ================================================= */
#define BLE_BLELL_CLOCK_CONFIG_ADV_CLK_GATE_EN_Pos (0UL)        /*!< BLE_BLELL CLOCK_CONFIG: ADV_CLK_GATE_EN (Bit 0)           */
#define BLE_BLELL_CLOCK_CONFIG_ADV_CLK_GATE_EN_Msk (0x1UL)      /*!< BLE_BLELL CLOCK_CONFIG: ADV_CLK_GATE_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_SCAN_CLK_GATE_EN_Pos (1UL)       /*!< BLE_BLELL CLOCK_CONFIG: SCAN_CLK_GATE_EN (Bit 1)          */
#define BLE_BLELL_CLOCK_CONFIG_SCAN_CLK_GATE_EN_Msk (0x2UL)     /*!< BLE_BLELL CLOCK_CONFIG: SCAN_CLK_GATE_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_INIT_CLK_GATE_EN_Pos (2UL)       /*!< BLE_BLELL CLOCK_CONFIG: INIT_CLK_GATE_EN (Bit 2)          */
#define BLE_BLELL_CLOCK_CONFIG_INIT_CLK_GATE_EN_Msk (0x4UL)     /*!< BLE_BLELL CLOCK_CONFIG: INIT_CLK_GATE_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_CONN_CLK_GATE_EN_Pos (3UL)       /*!< BLE_BLELL CLOCK_CONFIG: CONN_CLK_GATE_EN (Bit 3)          */
#define BLE_BLELL_CLOCK_CONFIG_CONN_CLK_GATE_EN_Msk (0x8UL)     /*!< BLE_BLELL CLOCK_CONFIG: CONN_CLK_GATE_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_CORECLK_GATE_EN_Pos (4UL)        /*!< BLE_BLELL CLOCK_CONFIG: CORECLK_GATE_EN (Bit 4)           */
#define BLE_BLELL_CLOCK_CONFIG_CORECLK_GATE_EN_Msk (0x10UL)     /*!< BLE_BLELL CLOCK_CONFIG: CORECLK_GATE_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_SYSCLK_GATE_EN_Pos (5UL)         /*!< BLE_BLELL CLOCK_CONFIG: SYSCLK_GATE_EN (Bit 5)            */
#define BLE_BLELL_CLOCK_CONFIG_SYSCLK_GATE_EN_Msk (0x20UL)      /*!< BLE_BLELL CLOCK_CONFIG: SYSCLK_GATE_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_PHY_CLK_GATE_EN_Pos (6UL)        /*!< BLE_BLELL CLOCK_CONFIG: PHY_CLK_GATE_EN (Bit 6)           */
#define BLE_BLELL_CLOCK_CONFIG_PHY_CLK_GATE_EN_Msk (0x40UL)     /*!< BLE_BLELL CLOCK_CONFIG: PHY_CLK_GATE_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_LLH_IDLE_Pos (7UL)               /*!< BLE_BLELL CLOCK_CONFIG: LLH_IDLE (Bit 7)                  */
#define BLE_BLELL_CLOCK_CONFIG_LLH_IDLE_Msk (0x80UL)            /*!< BLE_BLELL CLOCK_CONFIG: LLH_IDLE (Bitfield-Mask: 0x01)    */
#define BLE_BLELL_CLOCK_CONFIG_LPO_CLK_FREQ_SEL_Pos (8UL)       /*!< BLE_BLELL CLOCK_CONFIG: LPO_CLK_FREQ_SEL (Bit 8)          */
#define BLE_BLELL_CLOCK_CONFIG_LPO_CLK_FREQ_SEL_Msk (0x100UL)   /*!< BLE_BLELL CLOCK_CONFIG: LPO_CLK_FREQ_SEL (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_LPO_SEL_EXTERNAL_Pos (9UL)       /*!< BLE_BLELL CLOCK_CONFIG: LPO_SEL_EXTERNAL (Bit 9)          */
#define BLE_BLELL_CLOCK_CONFIG_LPO_SEL_EXTERNAL_Msk (0x200UL)   /*!< BLE_BLELL CLOCK_CONFIG: LPO_SEL_EXTERNAL (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_SM_AUTO_WKUP_EN_Pos (10UL)       /*!< BLE_BLELL CLOCK_CONFIG: SM_AUTO_WKUP_EN (Bit 10)          */
#define BLE_BLELL_CLOCK_CONFIG_SM_AUTO_WKUP_EN_Msk (0x400UL)    /*!< BLE_BLELL CLOCK_CONFIG: SM_AUTO_WKUP_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_SM_INTR_EN_Pos (12UL)            /*!< BLE_BLELL CLOCK_CONFIG: SM_INTR_EN (Bit 12)               */
#define BLE_BLELL_CLOCK_CONFIG_SM_INTR_EN_Msk (0x1000UL)        /*!< BLE_BLELL CLOCK_CONFIG: SM_INTR_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_CLOCK_CONFIG_DEEP_SLEEP_AUTO_WKUP_DISABLE_Pos (13UL) /*!< BLE_BLELL CLOCK_CONFIG: DEEP_SLEEP_AUTO_WKUP_DISABLE (Bit 13)*/
#define BLE_BLELL_CLOCK_CONFIG_DEEP_SLEEP_AUTO_WKUP_DISABLE_Msk (0x2000UL) /*!< BLE_BLELL CLOCK_CONFIG: DEEP_SLEEP_AUTO_WKUP_DISABLE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_SLEEP_MODE_EN_Pos (14UL)         /*!< BLE_BLELL CLOCK_CONFIG: SLEEP_MODE_EN (Bit 14)            */
#define BLE_BLELL_CLOCK_CONFIG_SLEEP_MODE_EN_Msk (0x4000UL)     /*!< BLE_BLELL CLOCK_CONFIG: SLEEP_MODE_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CLOCK_CONFIG_DEEP_SLEEP_MODE_EN_Pos (15UL)    /*!< BLE_BLELL CLOCK_CONFIG: DEEP_SLEEP_MODE_EN (Bit 15)       */
#define BLE_BLELL_CLOCK_CONFIG_DEEP_SLEEP_MODE_EN_Msk (0x8000UL) /*!< BLE_BLELL CLOCK_CONFIG: DEEP_SLEEP_MODE_EN (Bitfield-Mask: 0x01)*/
/* ================================================  BLE_BLELL.TIM_COUNTER_L  ================================================ */
#define BLE_BLELL_TIM_COUNTER_L_TIM_REF_CLOCK_Pos (0UL)         /*!< BLE_BLELL TIM_COUNTER_L: TIM_REF_CLOCK (Bit 0)            */
#define BLE_BLELL_TIM_COUNTER_L_TIM_REF_CLOCK_Msk (0xffffUL)    /*!< BLE_BLELL TIM_COUNTER_L: TIM_REF_CLOCK (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_BLELL.WAKEUP_CONFIG_EXTD  ============================================== */
#define BLE_BLELL_WAKEUP_CONFIG_EXTD_DSM_LF_OFFSET_Pos (0UL)    /*!< BLE_BLELL WAKEUP_CONFIG_EXTD: DSM_LF_OFFSET (Bit 0)       */
#define BLE_BLELL_WAKEUP_CONFIG_EXTD_DSM_LF_OFFSET_Msk (0x1fUL) /*!< BLE_BLELL WAKEUP_CONFIG_EXTD: DSM_LF_OFFSET (Bitfield-Mask: 0x1f)*/
/* ============================================  BLE_BLELL.POC_REG__TIM_CONTROL  ============================================= */
#define BLE_BLELL_POC_REG__TIM_CONTROL_BB_CLK_FREQ_MINUS_1_Pos (3UL) /*!< BLE_BLELL POC_REG__TIM_CONTROL: BB_CLK_FREQ_MINUS_1 (Bit 3)*/
#define BLE_BLELL_POC_REG__TIM_CONTROL_BB_CLK_FREQ_MINUS_1_Msk (0xf8UL) /*!< BLE_BLELL POC_REG__TIM_CONTROL: BB_CLK_FREQ_MINUS_1 (Bitfield-Mask: 0x1f)*/
#define BLE_BLELL_POC_REG__TIM_CONTROL_START_SLOT_OFFSET_Pos (8UL) /*!< BLE_BLELL POC_REG__TIM_CONTROL: START_SLOT_OFFSET (Bit 8)*/
#define BLE_BLELL_POC_REG__TIM_CONTROL_START_SLOT_OFFSET_Msk (0xf00UL) /*!< BLE_BLELL POC_REG__TIM_CONTROL: START_SLOT_OFFSET (Bitfield-Mask: 0x0f)*/
/* ==============================================  BLE_BLELL.ADV_TX_DATA_FIFO  =============================================== */
#define BLE_BLELL_ADV_TX_DATA_FIFO_ADV_TX_DATA_Pos (0UL)        /*!< BLE_BLELL ADV_TX_DATA_FIFO: ADV_TX_DATA (Bit 0)           */
#define BLE_BLELL_ADV_TX_DATA_FIFO_ADV_TX_DATA_Msk (0xffffUL)   /*!< BLE_BLELL ADV_TX_DATA_FIFO: ADV_TX_DATA (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_BLELL.ADV_SCN_RSP_TX_FIFO  ============================================= */
#define BLE_BLELL_ADV_SCN_RSP_TX_FIFO_SCAN_RSP_DATA_Pos (0UL)   /*!< BLE_BLELL ADV_SCN_RSP_TX_FIFO: SCAN_RSP_DATA (Bit 0)      */
#define BLE_BLELL_ADV_SCN_RSP_TX_FIFO_SCAN_RSP_DATA_Msk (0xffffUL) /*!< BLE_BLELL ADV_SCN_RSP_TX_FIFO: SCAN_RSP_DATA (Bitfield-Mask: 0xffff)*/
/* ============================================  BLE_BLELL.INIT_SCN_ADV_RX_FIFO  ============================================= */
#define BLE_BLELL_INIT_SCN_ADV_RX_FIFO_ADV_SCAN_RSP_RX_DATA_Pos (0UL) /*!< BLE_BLELL INIT_SCN_ADV_RX_FIFO: ADV_SCAN_RSP_RX_DATA (Bit 0)*/
#define BLE_BLELL_INIT_SCN_ADV_RX_FIFO_ADV_SCAN_RSP_RX_DATA_Msk (0xffffUL) /*!< BLE_BLELL INIT_SCN_ADV_RX_FIFO: ADV_SCAN_RSP_RX_DATA (Bitfield-Mask: 0xffff)*/
/* ================================================  BLE_BLELL.CONN_INTERVAL  ================================================ */
#define BLE_BLELL_CONN_INTERVAL_CONNECTION_INTERVAL_Pos (0UL)   /*!< BLE_BLELL CONN_INTERVAL: CONNECTION_INTERVAL (Bit 0)      */
#define BLE_BLELL_CONN_INTERVAL_CONNECTION_INTERVAL_Msk (0xffffUL) /*!< BLE_BLELL CONN_INTERVAL: CONNECTION_INTERVAL (Bitfield-Mask: 0xffff)*/
/* =================================================  BLE_BLELL.SUP_TIMEOUT  ================================================= */
#define BLE_BLELL_SUP_TIMEOUT_SUPERVISION_TIMEOUT_Pos (0UL)     /*!< BLE_BLELL SUP_TIMEOUT: SUPERVISION_TIMEOUT (Bit 0)        */
#define BLE_BLELL_SUP_TIMEOUT_SUPERVISION_TIMEOUT_Msk (0xffffUL) /*!< BLE_BLELL SUP_TIMEOUT: SUPERVISION_TIMEOUT (Bitfield-Mask: 0xffff)*/
/* ================================================  BLE_BLELL.SLAVE_LATENCY  ================================================ */
#define BLE_BLELL_SLAVE_LATENCY_SLAVE_LATENCY_Pos (0UL)         /*!< BLE_BLELL SLAVE_LATENCY: SLAVE_LATENCY (Bit 0)            */
#define BLE_BLELL_SLAVE_LATENCY_SLAVE_LATENCY_Msk (0xffffUL)    /*!< BLE_BLELL SLAVE_LATENCY: SLAVE_LATENCY (Bitfield-Mask: 0xffff)*/
/* ==================================================  BLE_BLELL.CE_LENGTH  ================================================== */
#define BLE_BLELL_CE_LENGTH_CONNECTION_EVENT_LENGTH_Pos (0UL)   /*!< BLE_BLELL CE_LENGTH: CONNECTION_EVENT_LENGTH (Bit 0)      */
#define BLE_BLELL_CE_LENGTH_CONNECTION_EVENT_LENGTH_Msk (0xffffUL) /*!< BLE_BLELL CE_LENGTH: CONNECTION_EVENT_LENGTH (Bitfield-Mask: 0xffff)*/
/* =========================================  BLE_BLELL.PDU_ACCESS_ADDR_L_REGISTER  ========================================== */
#define BLE_BLELL_PDU_ACCESS_ADDR_L_REGISTER_PDU_ACCESS_ADDRESS_LOWER_BITS_Pos (0UL) /*!< BLE_BLELL PDU_ACCESS_ADDR_L_REGISTER: PDU_ACCESS_ADDRESS_LOWER_BITS (Bit 0)*/
#define BLE_BLELL_PDU_ACCESS_ADDR_L_REGISTER_PDU_ACCESS_ADDRESS_LOWER_BITS_Msk (0xffffUL) /*!< BLE_BLELL PDU_ACCESS_ADDR_L_REGISTER: PDU_ACCESS_ADDRESS_LOWER_BITS (Bitfield-Mask: 0xffff)*/
/* =========================================  BLE_BLELL.PDU_ACCESS_ADDR_H_REGISTER  ========================================== */
#define BLE_BLELL_PDU_ACCESS_ADDR_H_REGISTER_PDU_ACCESS_ADDRESS_HIGHER_BITS_Pos (0UL) /*!< BLE_BLELL PDU_ACCESS_ADDR_H_REGISTER: PDU_ACCESS_ADDRESS_HIGHER_BITS (Bit 0)*/
#define BLE_BLELL_PDU_ACCESS_ADDR_H_REGISTER_PDU_ACCESS_ADDRESS_HIGHER_BITS_Msk (0xffffUL) /*!< BLE_BLELL PDU_ACCESS_ADDR_H_REGISTER: PDU_ACCESS_ADDRESS_HIGHER_BITS (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_CE_INSTANT  =============================================== */
#define BLE_BLELL_CONN_CE_INSTANT_CE_INSTANT_Pos (0UL)          /*!< BLE_BLELL CONN_CE_INSTANT: CE_INSTANT (Bit 0)             */
#define BLE_BLELL_CONN_CE_INSTANT_CE_INSTANT_Msk (0xffffUL)     /*!< BLE_BLELL CONN_CE_INSTANT: CE_INSTANT (Bitfield-Mask: 0xffff)*/
/* ============================================  BLE_BLELL.CE_CNFG_STS_REGISTER  ============================================= */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_DATA_LIST_INDEX_LAST_ACK_INDEX_Pos (0UL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER: DATA_LIST_INDEX_LAST_ACK_INDEX (Bit 0)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_DATA_LIST_INDEX_LAST_ACK_INDEX_Msk (0xfUL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER: DATA_LIST_INDEX_LAST_ACK_INDEX (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_DATA_LIST_HEAD_UP_Pos (4UL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER: DATA_LIST_HEAD_UP (Bit 4)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_DATA_LIST_HEAD_UP_Msk (0x10UL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER: DATA_LIST_HEAD_UP (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_SPARE_Pos (5UL)          /*!< BLE_BLELL CE_CNFG_STS_REGISTER: SPARE (Bit 5)             */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_SPARE_Msk (0x20UL)       /*!< BLE_BLELL CE_CNFG_STS_REGISTER: SPARE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_MD_Pos (6UL)             /*!< BLE_BLELL CE_CNFG_STS_REGISTER: MD (Bit 6)                */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_MD_Msk (0x40UL)          /*!< BLE_BLELL CE_CNFG_STS_REGISTER: MD (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_MAP_INDEX__CURR_INDEX_Pos (7UL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER: MAP_INDEX__CURR_INDEX (Bit 7)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_MAP_INDEX__CURR_INDEX_Msk (0x80UL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER: MAP_INDEX__CURR_INDEX (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_PAUSE_DATA_Pos (8UL)     /*!< BLE_BLELL CE_CNFG_STS_REGISTER: PAUSE_DATA (Bit 8)        */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_PAUSE_DATA_Msk (0x100UL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER: PAUSE_DATA (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_CONN_ACTIVE_Pos (10UL)   /*!< BLE_BLELL CE_CNFG_STS_REGISTER: CONN_ACTIVE (Bit 10)      */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_CONN_ACTIVE_Msk (0x400UL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER: CONN_ACTIVE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_CURRENT_PDU_INDEX_Pos (12UL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER: CURRENT_PDU_INDEX (Bit 12)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_CURRENT_PDU_INDEX_Msk (0xf000UL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER: CURRENT_PDU_INDEX (Bitfield-Mask: 0x0f)*/
/* ===============================================  BLE_BLELL.NEXT_CE_INSTANT  =============================================== */
