ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
#define BLE_BLELL_NEXT_CE_INSTANT_NEXT_CE_INSTANT_Pos (0UL)     /*!< BLE_BLELL NEXT_CE_INSTANT: NEXT_CE_INSTANT (Bit 0)        */
#define BLE_BLELL_NEXT_CE_INSTANT_NEXT_CE_INSTANT_Msk (0xffffUL) /*!< BLE_BLELL NEXT_CE_INSTANT: NEXT_CE_INSTANT (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_CE_COUNTER  =============================================== */
#define BLE_BLELL_CONN_CE_COUNTER_CONNECTION_EVENT_COUNTER_Pos (0UL) /*!< BLE_BLELL CONN_CE_COUNTER: CONNECTION_EVENT_COUNTER (Bit 0)*/
#define BLE_BLELL_CONN_CE_COUNTER_CONNECTION_EVENT_COUNTER_Msk (0xffffUL) /*!< BLE_BLELL CONN_CE_COUNTER: CONNECTION_EVENT_COUNTER (Bitfield-Mask: 0xffff)*/
/* ========================================  BLE_BLELL.DATA_LIST_SENT_UPDATE__STATUS  ======================================== */
#define BLE_BLELL_DATA_LIST_SENT_UPDATE__STATUS_LIST_INDEX__TX_SENT_3_0_Pos (0UL) /*!< BLE_BLELL DATA_LIST_SENT_UPDATE__STATUS: LIST_INDEX__TX_SENT_3_0 (Bit 0)*/
#define BLE_BLELL_DATA_LIST_SENT_UPDATE__STATUS_LIST_INDEX__TX_SENT_3_0_Msk (0xfUL) /*!< BLE_BLELL DATA_LIST_SENT_UPDATE__STATUS: LIST_INDEX__TX_SENT_3_0 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_DATA_LIST_SENT_UPDATE__STATUS_SET_CLEAR_Pos (7UL) /*!< BLE_BLELL DATA_LIST_SENT_UPDATE__STATUS: SET_CLEAR (Bit 7)*/
#define BLE_BLELL_DATA_LIST_SENT_UPDATE__STATUS_SET_CLEAR_Msk (0x80UL) /*!< BLE_BLELL DATA_LIST_SENT_UPDATE__STATUS: SET_CLEAR (Bitfield-Mask: 0x01)*/
/* ========================================  BLE_BLELL.DATA_LIST_ACK_UPDATE__STATUS  ========================================= */
#define BLE_BLELL_DATA_LIST_ACK_UPDATE__STATUS_LIST_INDEX__TX_ACK_3_0_Pos (0UL) /*!< BLE_BLELL DATA_LIST_ACK_UPDATE__STATUS: LIST_INDEX__TX_ACK_3_0 (Bit 0)*/
#define BLE_BLELL_DATA_LIST_ACK_UPDATE__STATUS_LIST_INDEX__TX_ACK_3_0_Msk (0xfUL) /*!< BLE_BLELL DATA_LIST_ACK_UPDATE__STATUS: LIST_INDEX__TX_ACK_3_0 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_DATA_LIST_ACK_UPDATE__STATUS_SET_CLEAR_Pos (7UL) /*!< BLE_BLELL DATA_LIST_ACK_UPDATE__STATUS: SET_CLEAR (Bit 7)*/
#define BLE_BLELL_DATA_LIST_ACK_UPDATE__STATUS_SET_CLEAR_Msk (0x80UL) /*!< BLE_BLELL DATA_LIST_ACK_UPDATE__STATUS: SET_CLEAR (Bitfield-Mask: 0x01)*/
/* ==========================================  BLE_BLELL.CE_CNFG_STS_REGISTER_EXT  =========================================== */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_TX_2M_Pos (0UL)      /*!< BLE_BLELL CE_CNFG_STS_REGISTER_EXT: TX_2M (Bit 0)         */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_TX_2M_Msk (0x1UL)    /*!< BLE_BLELL CE_CNFG_STS_REGISTER_EXT: TX_2M (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_RX_2M_Pos (1UL)      /*!< BLE_BLELL CE_CNFG_STS_REGISTER_EXT: RX_2M (Bit 1)         */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_RX_2M_Msk (0x2UL)    /*!< BLE_BLELL CE_CNFG_STS_REGISTER_EXT: RX_2M (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_SN_Pos (2UL)         /*!< BLE_BLELL CE_CNFG_STS_REGISTER_EXT: SN (Bit 2)            */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_SN_Msk (0x4UL)       /*!< BLE_BLELL CE_CNFG_STS_REGISTER_EXT: SN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_NESN_Pos (3UL)       /*!< BLE_BLELL CE_CNFG_STS_REGISTER_EXT: NESN (Bit 3)          */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_NESN_Msk (0x8UL)     /*!< BLE_BLELL CE_CNFG_STS_REGISTER_EXT: NESN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_LAST_UNMAPPED_CHANNEL_Pos (8UL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER_EXT: LAST_UNMAPPED_CHANNEL (Bit 8)*/
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_LAST_UNMAPPED_CHANNEL_Msk (0x3f00UL) /*!< BLE_BLELL CE_CNFG_STS_REGISTER_EXT: LAST_UNMAPPED_CHANNEL (Bitfield-Mask: 0x3f)*/
/* ================================================  BLE_BLELL.CONN_EXT_INTR  ================================================ */
#define BLE_BLELL_CONN_EXT_INTR_DATARATE_UPDATE_Pos (0UL)       /*!< BLE_BLELL CONN_EXT_INTR: DATARATE_UPDATE (Bit 0)          */
#define BLE_BLELL_CONN_EXT_INTR_DATARATE_UPDATE_Msk (0x1UL)     /*!< BLE_BLELL CONN_EXT_INTR: DATARATE_UPDATE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_EXT_INTR_EARLY_INTR_Pos (1UL)            /*!< BLE_BLELL CONN_EXT_INTR: EARLY_INTR (Bit 1)               */
#define BLE_BLELL_CONN_EXT_INTR_EARLY_INTR_Msk (0x2UL)          /*!< BLE_BLELL CONN_EXT_INTR: EARLY_INTR (Bitfield-Mask: 0x01) */
#define BLE_BLELL_CONN_EXT_INTR_GEN_TIMER_INTR_Pos (2UL)        /*!< BLE_BLELL CONN_EXT_INTR: GEN_TIMER_INTR (Bit 2)           */
#define BLE_BLELL_CONN_EXT_INTR_GEN_TIMER_INTR_Msk (0x4UL)      /*!< BLE_BLELL CONN_EXT_INTR: GEN_TIMER_INTR (Bitfield-Mask: 0x01)*/
/* =============================================  BLE_BLELL.CONN_EXT_INTR_MASK  ============================================== */
#define BLE_BLELL_CONN_EXT_INTR_MASK_DATARATE_UPDATE_Pos (0UL)  /*!< BLE_BLELL CONN_EXT_INTR_MASK: DATARATE_UPDATE (Bit 0)     */
#define BLE_BLELL_CONN_EXT_INTR_MASK_DATARATE_UPDATE_Msk (0x1UL) /*!< BLE_BLELL CONN_EXT_INTR_MASK: DATARATE_UPDATE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_EXT_INTR_MASK_EARLY_INTR_Pos (1UL)       /*!< BLE_BLELL CONN_EXT_INTR_MASK: EARLY_INTR (Bit 1)          */
#define BLE_BLELL_CONN_EXT_INTR_MASK_EARLY_INTR_Msk (0x2UL)     /*!< BLE_BLELL CONN_EXT_INTR_MASK: EARLY_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_EXT_INTR_MASK_GEN_TIMER_INTR_Pos (2UL)   /*!< BLE_BLELL CONN_EXT_INTR_MASK: GEN_TIMER_INTR (Bit 2)      */
#define BLE_BLELL_CONN_EXT_INTR_MASK_GEN_TIMER_INTR_Msk (0x4UL) /*!< BLE_BLELL CONN_EXT_INTR_MASK: GEN_TIMER_INTR (Bitfield-Mask: 0x01)*/
/* =============================================  BLE_BLELL.DATA_MEM_DESCRIPTOR  ============================================= */
#define BLE_BLELL_DATA_MEM_DESCRIPTOR_LLID_Pos (0UL)            /*!< BLE_BLELL DATA_MEM_DESCRIPTOR: LLID (Bit 0)               */
#define BLE_BLELL_DATA_MEM_DESCRIPTOR_LLID_Msk (0x3UL)          /*!< BLE_BLELL DATA_MEM_DESCRIPTOR: LLID (Bitfield-Mask: 0x03) */
#define BLE_BLELL_DATA_MEM_DESCRIPTOR_DATA_LENGTH_Pos (2UL)     /*!< BLE_BLELL DATA_MEM_DESCRIPTOR: DATA_LENGTH (Bit 2)        */
#define BLE_BLELL_DATA_MEM_DESCRIPTOR_DATA_LENGTH_Msk (0x3fcUL) /*!< BLE_BLELL DATA_MEM_DESCRIPTOR: DATA_LENGTH (Bitfield-Mask: 0xff)*/
/* =============================================  BLE_BLELL.WINDOW_WIDEN_INTVL  ============================================== */
#define BLE_BLELL_WINDOW_WIDEN_INTVL_WINDOW_WIDEN_INTVL_Pos (0UL) /*!< BLE_BLELL WINDOW_WIDEN_INTVL: WINDOW_WIDEN_INTVL (Bit 0)*/
#define BLE_BLELL_WINDOW_WIDEN_INTVL_WINDOW_WIDEN_INTVL_Msk (0xfffUL) /*!< BLE_BLELL WINDOW_WIDEN_INTVL: WINDOW_WIDEN_INTVL (Bitfield-Mask: 0xfff)*/
/* =============================================  BLE_BLELL.WINDOW_WIDEN_WINOFF  ============================================= */
#define BLE_BLELL_WINDOW_WIDEN_WINOFF_WINDOW_WIDEN_WINOFF_Pos (0UL) /*!< BLE_BLELL WINDOW_WIDEN_WINOFF: WINDOW_WIDEN_WINOFF (Bit 0)*/
#define BLE_BLELL_WINDOW_WIDEN_WINOFF_WINDOW_WIDEN_WINOFF_Msk (0xfffUL) /*!< BLE_BLELL WINDOW_WIDEN_WINOFF: WINDOW_WIDEN_WINOFF (Bitfield-Mask: 0xfff)*/
/* ===============================================  BLE_BLELL.LE_RF_TEST_MODE  =============================================== */
#define BLE_BLELL_LE_RF_TEST_MODE_TEST_FREQUENCY_Pos (0UL)      /*!< BLE_BLELL LE_RF_TEST_MODE: TEST_FREQUENCY (Bit 0)         */
#define BLE_BLELL_LE_RF_TEST_MODE_TEST_FREQUENCY_Msk (0x3fUL)   /*!< BLE_BLELL LE_RF_TEST_MODE: TEST_FREQUENCY (Bitfield-Mask: 0x3f)*/
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_STATUS__DTM_CONT_RXEN_Pos (6UL) /*!< BLE_BLELL LE_RF_TEST_MODE: DTM_STATUS__DTM_CONT_RXEN (Bit 6)*/
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_STATUS__DTM_CONT_RXEN_Msk (0x40UL) /*!< BLE_BLELL LE_RF_TEST_MODE: DTM_STATUS__DTM_CONT_RXEN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LE_RF_TEST_MODE_PKT_PAYLOAD_Pos (7UL)         /*!< BLE_BLELL LE_RF_TEST_MODE: PKT_PAYLOAD (Bit 7)            */
#define BLE_BLELL_LE_RF_TEST_MODE_PKT_PAYLOAD_Msk (0x380UL)     /*!< BLE_BLELL LE_RF_TEST_MODE: PKT_PAYLOAD (Bitfield-Mask: 0x07)*/
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_CONT_TXEN_Pos (13UL)      /*!< BLE_BLELL LE_RF_TEST_MODE: DTM_CONT_TXEN (Bit 13)         */
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_CONT_TXEN_Msk (0x2000UL)  /*!< BLE_BLELL LE_RF_TEST_MODE: DTM_CONT_TXEN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_DATA_2MBPS_Pos (15UL)     /*!< BLE_BLELL LE_RF_TEST_MODE: DTM_DATA_2MBPS (Bit 15)        */
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_DATA_2MBPS_Msk (0x8000UL) /*!< BLE_BLELL LE_RF_TEST_MODE: DTM_DATA_2MBPS (Bitfield-Mask: 0x01)*/
/* ==============================================  BLE_BLELL.DTM_RX_PKT_COUNT  =============================================== */
#define BLE_BLELL_DTM_RX_PKT_COUNT_RX_PACKET_COUNT_Pos (0UL)    /*!< BLE_BLELL DTM_RX_PKT_COUNT: RX_PACKET_COUNT (Bit 0)       */
#define BLE_BLELL_DTM_RX_PKT_COUNT_RX_PACKET_COUNT_Msk (0xffffUL) /*!< BLE_BLELL DTM_RX_PKT_COUNT: RX_PACKET_COUNT (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_BLELL.LE_RF_TEST_MODE_EXT  ============================================= */
#define BLE_BLELL_LE_RF_TEST_MODE_EXT_DTM_PACKET_LENGTH_Pos (0UL) /*!< BLE_BLELL LE_RF_TEST_MODE_EXT: DTM_PACKET_LENGTH (Bit 0)*/
#define BLE_BLELL_LE_RF_TEST_MODE_EXT_DTM_PACKET_LENGTH_Msk (0xffUL) /*!< BLE_BLELL LE_RF_TEST_MODE_EXT: DTM_PACKET_LENGTH (Bitfield-Mask: 0xff)*/
/* ==================================================  BLE_BLELL.TXRX_HOP  =================================================== */
#define BLE_BLELL_TXRX_HOP_HOP_CH_TX_Pos  (0UL)                 /*!< BLE_BLELL TXRX_HOP: HOP_CH_TX (Bit 0)                     */
#define BLE_BLELL_TXRX_HOP_HOP_CH_TX_Msk  (0x7fUL)              /*!< BLE_BLELL TXRX_HOP: HOP_CH_TX (Bitfield-Mask: 0x7f)       */
#define BLE_BLELL_TXRX_HOP_HOP_CH_RX_Pos  (8UL)                 /*!< BLE_BLELL TXRX_HOP: HOP_CH_RX (Bit 8)                     */
#define BLE_BLELL_TXRX_HOP_HOP_CH_RX_Msk  (0x7f00UL)            /*!< BLE_BLELL TXRX_HOP: HOP_CH_RX (Bitfield-Mask: 0x7f)       */
/* ===============================================  BLE_BLELL.TX_RX_ON_DELAY  ================================================ */
#define BLE_BLELL_TX_RX_ON_DELAY_RXON_DELAY_Pos (0UL)           /*!< BLE_BLELL TX_RX_ON_DELAY: RXON_DELAY (Bit 0)              */
#define BLE_BLELL_TX_RX_ON_DELAY_RXON_DELAY_Msk (0xffUL)        /*!< BLE_BLELL TX_RX_ON_DELAY: RXON_DELAY (Bitfield-Mask: 0xff)*/
#define BLE_BLELL_TX_RX_ON_DELAY_TXON_DELAY_Pos (8UL)           /*!< BLE_BLELL TX_RX_ON_DELAY: TXON_DELAY (Bit 8)              */
#define BLE_BLELL_TX_RX_ON_DELAY_TXON_DELAY_Msk (0xff00UL)      /*!< BLE_BLELL TX_RX_ON_DELAY: TXON_DELAY (Bitfield-Mask: 0xff)*/
/* ================================================  BLE_BLELL.ADV_ACCADDR_L  ================================================ */
#define BLE_BLELL_ADV_ACCADDR_L_ADV_ACCADDR_L_Pos (0UL)         /*!< BLE_BLELL ADV_ACCADDR_L: ADV_ACCADDR_L (Bit 0)            */
#define BLE_BLELL_ADV_ACCADDR_L_ADV_ACCADDR_L_Msk (0xffffUL)    /*!< BLE_BLELL ADV_ACCADDR_L: ADV_ACCADDR_L (Bitfield-Mask: 0xffff)*/
/* ================================================  BLE_BLELL.ADV_ACCADDR_H  ================================================ */
#define BLE_BLELL_ADV_ACCADDR_H_ADV_ACCADDR_H_Pos (0UL)         /*!< BLE_BLELL ADV_ACCADDR_H: ADV_ACCADDR_H (Bit 0)            */
#define BLE_BLELL_ADV_ACCADDR_H_ADV_ACCADDR_H_Msk (0xffffUL)    /*!< BLE_BLELL ADV_ACCADDR_H: ADV_ACCADDR_H (Bitfield-Mask: 0xffff)*/
/* ===========================================  BLE_BLELL.ADV_CH_TX_POWER_LVL_LS  ============================================ */
#define BLE_BLELL_ADV_CH_TX_POWER_LVL_LS_ADV_TRANSMIT_POWER_LVL_LS_Pos (0UL) /*!< BLE_BLELL ADV_CH_TX_POWER_LVL_LS: ADV_TRANSMIT_POWER_LVL_LS (Bit 0)*/
#define BLE_BLELL_ADV_CH_TX_POWER_LVL_LS_ADV_TRANSMIT_POWER_LVL_LS_Msk (0xffffUL) /*!< BLE_BLELL ADV_CH_TX_POWER_LVL_LS: ADV_TRANSMIT_POWER_LVL_LS (Bitfield-Mask: 0xffff)*/
/* ===========================================  BLE_BLELL.ADV_CH_TX_POWER_LVL_MS  ============================================ */
#define BLE_BLELL_ADV_CH_TX_POWER_LVL_MS_ADV_TRANSMIT_POWER_LVL_MS_Pos (0UL) /*!< BLE_BLELL ADV_CH_TX_POWER_LVL_MS: ADV_TRANSMIT_POWER_LVL_MS (Bit 0)*/
#define BLE_BLELL_ADV_CH_TX_POWER_LVL_MS_ADV_TRANSMIT_POWER_LVL_MS_Msk (0x3UL) /*!< BLE_BLELL ADV_CH_TX_POWER_LVL_MS: ADV_TRANSMIT_POWER_LVL_MS (Bitfield-Mask: 0x03)*/
/* ===========================================  BLE_BLELL.CONN_CH_TX_POWER_LVL_LS  =========================================== */
#define BLE_BLELL_CONN_CH_TX_POWER_LVL_LS_CONNCH_TRANSMIT_POWER_LVL_LS_Pos (0UL) /*!< BLE_BLELL CONN_CH_TX_POWER_LVL_LS: CONNCH_TRANSMIT_POWER_LVL_LS (Bit 0)*/
#define BLE_BLELL_CONN_CH_TX_POWER_LVL_LS_CONNCH_TRANSMIT_POWER_LVL_LS_Msk (0xffffUL) /*!< BLE_BLELL CONN_CH_TX_POWER_LVL_LS: CONNCH_TRANSMIT_POWER_LVL_LS (Bitfield-Mask: 0xffff)*/
/* ===========================================  BLE_BLELL.CONN_CH_TX_POWER_LVL_MS  =========================================== */
#define BLE_BLELL_CONN_CH_TX_POWER_LVL_MS_CONNCH_TRANSMIT_POWER_LVL_MS_Pos (0UL) /*!< BLE_BLELL CONN_CH_TX_POWER_LVL_MS: CONNCH_TRANSMIT_POWER_LVL_MS (Bit 0)*/
#define BLE_BLELL_CONN_CH_TX_POWER_LVL_MS_CONNCH_TRANSMIT_POWER_LVL_MS_Msk (0x3UL) /*!< BLE_BLELL CONN_CH_TX_POWER_LVL_MS: CONNCH_TRANSMIT_POWER_LVL_MS (Bitfield-Mask: 0x03)*/
/* ===============================================  BLE_BLELL.DEV_PUB_ADDR_L  ================================================ */
#define BLE_BLELL_DEV_PUB_ADDR_L_DEV_PUB_ADDR_L_Pos (0UL)       /*!< BLE_BLELL DEV_PUB_ADDR_L: DEV_PUB_ADDR_L (Bit 0)          */
#define BLE_BLELL_DEV_PUB_ADDR_L_DEV_PUB_ADDR_L_Msk (0xffffUL)  /*!< BLE_BLELL DEV_PUB_ADDR_L: DEV_PUB_ADDR_L (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.DEV_PUB_ADDR_M  ================================================ */
#define BLE_BLELL_DEV_PUB_ADDR_M_DEV_PUB_ADDR_M_Pos (0UL)       /*!< BLE_BLELL DEV_PUB_ADDR_M: DEV_PUB_ADDR_M (Bit 0)          */
#define BLE_BLELL_DEV_PUB_ADDR_M_DEV_PUB_ADDR_M_Msk (0xffffUL)  /*!< BLE_BLELL DEV_PUB_ADDR_M: DEV_PUB_ADDR_M (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.DEV_PUB_ADDR_H  ================================================ */
#define BLE_BLELL_DEV_PUB_ADDR_H_DEV_PUB_ADDR_H_Pos (0UL)       /*!< BLE_BLELL DEV_PUB_ADDR_H: DEV_PUB_ADDR_H (Bit 0)          */
#define BLE_BLELL_DEV_PUB_ADDR_H_DEV_PUB_ADDR_H_Msk (0xffffUL)  /*!< BLE_BLELL DEV_PUB_ADDR_H: DEV_PUB_ADDR_H (Bitfield-Mask: 0xffff)*/
/* ===========================================  BLE_BLELL.OFFSET_TO_FIRST_INSTANT  =========================================== */
#define BLE_BLELL_OFFSET_TO_FIRST_INSTANT_OFFSET_TO_FIRST_EVENT_Pos (0UL) /*!< BLE_BLELL OFFSET_TO_FIRST_INSTANT: OFFSET_TO_FIRST_EVENT (Bit 0)*/
#define BLE_BLELL_OFFSET_TO_FIRST_INSTANT_OFFSET_TO_FIRST_EVENT_Msk (0xffffUL) /*!< BLE_BLELL OFFSET_TO_FIRST_INSTANT: OFFSET_TO_FIRST_EVENT (Bitfield-Mask: 0xffff)*/
/* =================================================  BLE_BLELL.ADV_CONFIG  ================================================== */
#define BLE_BLELL_ADV_CONFIG_ADV_STRT_EN_Pos (0UL)              /*!< BLE_BLELL ADV_CONFIG: ADV_STRT_EN (Bit 0)                 */
#define BLE_BLELL_ADV_CONFIG_ADV_STRT_EN_Msk (0x1UL)            /*!< BLE_BLELL ADV_CONFIG: ADV_STRT_EN (Bitfield-Mask: 0x01)   */
#define BLE_BLELL_ADV_CONFIG_ADV_CLS_EN_Pos (1UL)               /*!< BLE_BLELL ADV_CONFIG: ADV_CLS_EN (Bit 1)                  */
#define BLE_BLELL_ADV_CONFIG_ADV_CLS_EN_Msk (0x2UL)             /*!< BLE_BLELL ADV_CONFIG: ADV_CLS_EN (Bitfield-Mask: 0x01)    */
#define BLE_BLELL_ADV_CONFIG_ADV_TX_EN_Pos (2UL)                /*!< BLE_BLELL ADV_CONFIG: ADV_TX_EN (Bit 2)                   */
#define BLE_BLELL_ADV_CONFIG_ADV_TX_EN_Msk (0x4UL)              /*!< BLE_BLELL ADV_CONFIG: ADV_TX_EN (Bitfield-Mask: 0x01)     */
#define BLE_BLELL_ADV_CONFIG_SCN_RSP_TX_EN_Pos (3UL)            /*!< BLE_BLELL ADV_CONFIG: SCN_RSP_TX_EN (Bit 3)               */
#define BLE_BLELL_ADV_CONFIG_SCN_RSP_TX_EN_Msk (0x8UL)          /*!< BLE_BLELL ADV_CONFIG: SCN_RSP_TX_EN (Bitfield-Mask: 0x01) */
#define BLE_BLELL_ADV_CONFIG_ADV_SCN_REQ_RX_EN_Pos (4UL)        /*!< BLE_BLELL ADV_CONFIG: ADV_SCN_REQ_RX_EN (Bit 4)           */
#define BLE_BLELL_ADV_CONFIG_ADV_SCN_REQ_RX_EN_Msk (0x10UL)     /*!< BLE_BLELL ADV_CONFIG: ADV_SCN_REQ_RX_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_CONFIG_ADV_CONN_REQ_RX_EN_Pos (5UL)       /*!< BLE_BLELL ADV_CONFIG: ADV_CONN_REQ_RX_EN (Bit 5)          */
#define BLE_BLELL_ADV_CONFIG_ADV_CONN_REQ_RX_EN_Msk (0x20UL)    /*!< BLE_BLELL ADV_CONFIG: ADV_CONN_REQ_RX_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_CONFIG_SLV_CONNECTED_EN_Pos (6UL)         /*!< BLE_BLELL ADV_CONFIG: SLV_CONNECTED_EN (Bit 6)            */
#define BLE_BLELL_ADV_CONFIG_SLV_CONNECTED_EN_Msk (0x40UL)      /*!< BLE_BLELL ADV_CONFIG: SLV_CONNECTED_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_CONFIG_ADV_TIMEOUT_EN_Pos (7UL)           /*!< BLE_BLELL ADV_CONFIG: ADV_TIMEOUT_EN (Bit 7)              */
#define BLE_BLELL_ADV_CONFIG_ADV_TIMEOUT_EN_Msk (0x80UL)        /*!< BLE_BLELL ADV_CONFIG: ADV_TIMEOUT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_CONFIG_ADV_RAND_DISABLE_Pos (8UL)         /*!< BLE_BLELL ADV_CONFIG: ADV_RAND_DISABLE (Bit 8)            */
#define BLE_BLELL_ADV_CONFIG_ADV_RAND_DISABLE_Msk (0x100UL)     /*!< BLE_BLELL ADV_CONFIG: ADV_RAND_DISABLE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_CONFIG_ADV_SCN_PEER_RPA_UNMCH_EN_Pos (9UL) /*!< BLE_BLELL ADV_CONFIG: ADV_SCN_PEER_RPA_UNMCH_EN (Bit 9)  */
#define BLE_BLELL_ADV_CONFIG_ADV_SCN_PEER_RPA_UNMCH_EN_Msk (0x200UL) /*!< BLE_BLELL ADV_CONFIG: ADV_SCN_PEER_RPA_UNMCH_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_CONFIG_ADV_CONN_PEER_RPA_UNMCH_EN_Pos (10UL) /*!< BLE_BLELL ADV_CONFIG: ADV_CONN_PEER_RPA_UNMCH_EN (Bit 10)*/
#define BLE_BLELL_ADV_CONFIG_ADV_CONN_PEER_RPA_UNMCH_EN_Msk (0x400UL) /*!< BLE_BLELL ADV_CONFIG: ADV_CONN_PEER_RPA_UNMCH_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_ADV_CONFIG_ADV_PKT_INTERVAL_Pos (11UL)        /*!< BLE_BLELL ADV_CONFIG: ADV_PKT_INTERVAL (Bit 11)           */
#define BLE_BLELL_ADV_CONFIG_ADV_PKT_INTERVAL_Msk (0xf800UL)    /*!< BLE_BLELL ADV_CONFIG: ADV_PKT_INTERVAL (Bitfield-Mask: 0x1f)*/
/* =================================================  BLE_BLELL.SCAN_CONFIG  ================================================= */
#define BLE_BLELL_SCAN_CONFIG_SCN_STRT_EN_Pos (0UL)             /*!< BLE_BLELL SCAN_CONFIG: SCN_STRT_EN (Bit 0)                */
#define BLE_BLELL_SCAN_CONFIG_SCN_STRT_EN_Msk (0x1UL)           /*!< BLE_BLELL SCAN_CONFIG: SCN_STRT_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_SCAN_CONFIG_SCN_CLOSE_EN_Pos (1UL)            /*!< BLE_BLELL SCAN_CONFIG: SCN_CLOSE_EN (Bit 1)               */
#define BLE_BLELL_SCAN_CONFIG_SCN_CLOSE_EN_Msk (0x2UL)          /*!< BLE_BLELL SCAN_CONFIG: SCN_CLOSE_EN (Bitfield-Mask: 0x01) */
#define BLE_BLELL_SCAN_CONFIG_SCN_TX_EN_Pos (2UL)               /*!< BLE_BLELL SCAN_CONFIG: SCN_TX_EN (Bit 2)                  */
#define BLE_BLELL_SCAN_CONFIG_SCN_TX_EN_Msk (0x4UL)             /*!< BLE_BLELL SCAN_CONFIG: SCN_TX_EN (Bitfield-Mask: 0x01)    */
#define BLE_BLELL_SCAN_CONFIG_ADV_RX_EN_Pos (3UL)               /*!< BLE_BLELL SCAN_CONFIG: ADV_RX_EN (Bit 3)                  */
#define BLE_BLELL_SCAN_CONFIG_ADV_RX_EN_Msk (0x8UL)             /*!< BLE_BLELL SCAN_CONFIG: ADV_RX_EN (Bitfield-Mask: 0x01)    */
#define BLE_BLELL_SCAN_CONFIG_SCN_RSP_RX_EN_Pos (4UL)           /*!< BLE_BLELL SCAN_CONFIG: SCN_RSP_RX_EN (Bit 4)              */
#define BLE_BLELL_SCAN_CONFIG_SCN_RSP_RX_EN_Msk (0x10UL)        /*!< BLE_BLELL SCAN_CONFIG: SCN_RSP_RX_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_CONFIG_SCN_ADV_RX_INTR_PEER_RPA_UNMCH_EN_Pos (5UL) /*!< BLE_BLELL SCAN_CONFIG: SCN_ADV_RX_INTR_PEER_RPA_UNMCH_EN (Bit 5)*/
#define BLE_BLELL_SCAN_CONFIG_SCN_ADV_RX_INTR_PEER_RPA_UNMCH_EN_Msk (0x20UL) /*!< BLE_BLELL SCAN_CONFIG: SCN_ADV_RX_INTR_PEER_RPA_UNMCH_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_CONFIG_SCN_ADV_RX_INTR_SELF_RPA_UNMCH_EN_Pos (6UL) /*!< BLE_BLELL SCAN_CONFIG: SCN_ADV_RX_INTR_SELF_RPA_UNMCH_EN (Bit 6)*/
#define BLE_BLELL_SCAN_CONFIG_SCN_ADV_RX_INTR_SELF_RPA_UNMCH_EN_Msk (0x40UL) /*!< BLE_BLELL SCAN_CONFIG: SCN_ADV_RX_INTR_SELF_RPA_UNMCH_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_CONFIG_SCANA_TX_ADDR_NOT_SET_INTR_EN_Pos (7UL) /*!< BLE_BLELL SCAN_CONFIG: SCANA_TX_ADDR_NOT_SET_INTR_EN (Bit 7)*/
#define BLE_BLELL_SCAN_CONFIG_SCANA_TX_ADDR_NOT_SET_INTR_EN_Msk (0x80UL) /*!< BLE_BLELL SCAN_CONFIG: SCANA_TX_ADDR_NOT_SET_INTR_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_CONFIG_RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_SCN_Pos (8UL) /*!< BLE_BLELL SCAN_CONFIG: RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_SCN (Bit 8)*/
#define BLE_BLELL_SCAN_CONFIG_RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_SCN_Msk (0x100UL) /*!< BLE_BLELL SCAN_CONFIG: RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_SCN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_CONFIG_BACKOFF_ENABLE_Pos (11UL)         /*!< BLE_BLELL SCAN_CONFIG: BACKOFF_ENABLE (Bit 11)            */
#define BLE_BLELL_SCAN_CONFIG_BACKOFF_ENABLE_Msk (0x800UL)      /*!< BLE_BLELL SCAN_CONFIG: BACKOFF_ENABLE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_SCAN_CONFIG_SCAN_CHANNEL_MAP_Pos (13UL)       /*!< BLE_BLELL SCAN_CONFIG: SCAN_CHANNEL_MAP (Bit 13)          */
#define BLE_BLELL_SCAN_CONFIG_SCAN_CHANNEL_MAP_Msk (0xe000UL)   /*!< BLE_BLELL SCAN_CONFIG: SCAN_CHANNEL_MAP (Bitfield-Mask: 0x07)*/
/* =================================================  BLE_BLELL.INIT_CONFIG  ================================================= */
#define BLE_BLELL_INIT_CONFIG_INIT_STRT_EN_Pos (0UL)            /*!< BLE_BLELL INIT_CONFIG: INIT_STRT_EN (Bit 0)               */
#define BLE_BLELL_INIT_CONFIG_INIT_STRT_EN_Msk (0x1UL)          /*!< BLE_BLELL INIT_CONFIG: INIT_STRT_EN (Bitfield-Mask: 0x01) */
#define BLE_BLELL_INIT_CONFIG_INIT_CLOSE_EN_Pos (1UL)           /*!< BLE_BLELL INIT_CONFIG: INIT_CLOSE_EN (Bit 1)              */
#define BLE_BLELL_INIT_CONFIG_INIT_CLOSE_EN_Msk (0x2UL)         /*!< BLE_BLELL INIT_CONFIG: INIT_CLOSE_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_CONFIG_CONN_REQ_TX_EN_Pos (2UL)          /*!< BLE_BLELL INIT_CONFIG: CONN_REQ_TX_EN (Bit 2)             */
#define BLE_BLELL_INIT_CONFIG_CONN_REQ_TX_EN_Msk (0x4UL)        /*!< BLE_BLELL INIT_CONFIG: CONN_REQ_TX_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_CONFIG_CONN_CREATED_Pos (4UL)            /*!< BLE_BLELL INIT_CONFIG: CONN_CREATED (Bit 4)               */
#define BLE_BLELL_INIT_CONFIG_CONN_CREATED_Msk (0x10UL)         /*!< BLE_BLELL INIT_CONFIG: CONN_CREATED (Bitfield-Mask: 0x01) */
#define BLE_BLELL_INIT_CONFIG_INIT_ADV_RX_INTR_SELF_RPA_UNRES_EN_Pos (5UL) /*!< BLE_BLELL INIT_CONFIG: INIT_ADV_RX_INTR_SELF_RPA_UNRES_EN (Bit 5)*/
#define BLE_BLELL_INIT_CONFIG_INIT_ADV_RX_INTR_SELF_RPA_UNRES_EN_Msk (0x20UL) /*!< BLE_BLELL INIT_CONFIG: INIT_ADV_RX_INTR_SELF_RPA_UNRES_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_CONFIG_INIT_ADV_RX_INTR_PEER_RPA_UNRES_EN_Pos (6UL) /*!< BLE_BLELL INIT_CONFIG: INIT_ADV_RX_INTR_PEER_RPA_UNRES_EN (Bit 6)*/
#define BLE_BLELL_INIT_CONFIG_INIT_ADV_RX_INTR_PEER_RPA_UNRES_EN_Msk (0x40UL) /*!< BLE_BLELL INIT_CONFIG: INIT_ADV_RX_INTR_PEER_RPA_UNRES_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_CONFIG_INITA_TX_ADDR_NOT_SET_INTR_EN_Pos (7UL) /*!< BLE_BLELL INIT_CONFIG: INITA_TX_ADDR_NOT_SET_INTR_EN (Bit 7)*/
#define BLE_BLELL_INIT_CONFIG_INITA_TX_ADDR_NOT_SET_INTR_EN_Msk (0x80UL) /*!< BLE_BLELL INIT_CONFIG: INITA_TX_ADDR_NOT_SET_INTR_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_INIT_CONFIG_INIT_CHANNEL_MAP_Pos (13UL)       /*!< BLE_BLELL INIT_CONFIG: INIT_CHANNEL_MAP (Bit 13)          */
#define BLE_BLELL_INIT_CONFIG_INIT_CHANNEL_MAP_Msk (0xe000UL)   /*!< BLE_BLELL INIT_CONFIG: INIT_CHANNEL_MAP (Bitfield-Mask: 0x07)*/
/* =================================================  BLE_BLELL.CONN_CONFIG  ================================================= */
#define BLE_BLELL_CONN_CONFIG_RX_PKT_LIMIT_Pos (0UL)            /*!< BLE_BLELL CONN_CONFIG: RX_PKT_LIMIT (Bit 0)               */
