ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
#define BLE_BLELL_CONN_CONFIG_RX_PKT_LIMIT_Msk (0xfUL)          /*!< BLE_BLELL CONN_CONFIG: RX_PKT_LIMIT (Bitfield-Mask: 0x0f) */
#define BLE_BLELL_CONN_CONFIG_RX_INTR_THRESHOLD_Pos (4UL)       /*!< BLE_BLELL CONN_CONFIG: RX_INTR_THRESHOLD (Bit 4)          */
#define BLE_BLELL_CONN_CONFIG_RX_INTR_THRESHOLD_Msk (0xf0UL)    /*!< BLE_BLELL CONN_CONFIG: RX_INTR_THRESHOLD (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_CONFIG_MD_BIT_CLEAR_Pos (8UL)            /*!< BLE_BLELL CONN_CONFIG: MD_BIT_CLEAR (Bit 8)               */
#define BLE_BLELL_CONN_CONFIG_MD_BIT_CLEAR_Msk (0x100UL)        /*!< BLE_BLELL CONN_CONFIG: MD_BIT_CLEAR (Bitfield-Mask: 0x01) */
#define BLE_BLELL_CONN_CONFIG_DSM_SLOT_VARIANCE_Pos (11UL)      /*!< BLE_BLELL CONN_CONFIG: DSM_SLOT_VARIANCE (Bit 11)         */
#define BLE_BLELL_CONN_CONFIG_DSM_SLOT_VARIANCE_Msk (0x800UL)   /*!< BLE_BLELL CONN_CONFIG: DSM_SLOT_VARIANCE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_CONFIG_SLV_MD_CONFIG_Pos (12UL)          /*!< BLE_BLELL CONN_CONFIG: SLV_MD_CONFIG (Bit 12)             */
#define BLE_BLELL_CONN_CONFIG_SLV_MD_CONFIG_Msk (0x1000UL)      /*!< BLE_BLELL CONN_CONFIG: SLV_MD_CONFIG (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_CONFIG_EXTEND_CU_TX_WIN_Pos (13UL)       /*!< BLE_BLELL CONN_CONFIG: EXTEND_CU_TX_WIN (Bit 13)          */
#define BLE_BLELL_CONN_CONFIG_EXTEND_CU_TX_WIN_Msk (0x2000UL)   /*!< BLE_BLELL CONN_CONFIG: EXTEND_CU_TX_WIN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_CONFIG_MASK_SUTO_AT_UPDT_Pos (14UL)      /*!< BLE_BLELL CONN_CONFIG: MASK_SUTO_AT_UPDT (Bit 14)         */
#define BLE_BLELL_CONN_CONFIG_MASK_SUTO_AT_UPDT_Msk (0x4000UL)  /*!< BLE_BLELL CONN_CONFIG: MASK_SUTO_AT_UPDT (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_CONFIG_CONN_REQ_1SLOT_EARLY_Pos (15UL)   /*!< BLE_BLELL CONN_CONFIG: CONN_REQ_1SLOT_EARLY (Bit 15)      */
#define BLE_BLELL_CONN_CONFIG_CONN_REQ_1SLOT_EARLY_Msk (0x8000UL) /*!< BLE_BLELL CONN_CONFIG: CONN_REQ_1SLOT_EARLY (Bitfield-Mask: 0x01)*/
/* =================================================  BLE_BLELL.CONN_PARAM1  ================================================= */
#define BLE_BLELL_CONN_PARAM1_SCA_PARAM_Pos (0UL)               /*!< BLE_BLELL CONN_PARAM1: SCA_PARAM (Bit 0)                  */
#define BLE_BLELL_CONN_PARAM1_SCA_PARAM_Msk (0x7UL)             /*!< BLE_BLELL CONN_PARAM1: SCA_PARAM (Bitfield-Mask: 0x07)    */
#define BLE_BLELL_CONN_PARAM1_HOP_INCREMENT_PARAM_Pos (3UL)     /*!< BLE_BLELL CONN_PARAM1: HOP_INCREMENT_PARAM (Bit 3)        */
#define BLE_BLELL_CONN_PARAM1_HOP_INCREMENT_PARAM_Msk (0xf8UL)  /*!< BLE_BLELL CONN_PARAM1: HOP_INCREMENT_PARAM (Bitfield-Mask: 0x1f)*/
#define BLE_BLELL_CONN_PARAM1_CRC_INIT_L_Pos (8UL)              /*!< BLE_BLELL CONN_PARAM1: CRC_INIT_L (Bit 8)                 */
#define BLE_BLELL_CONN_PARAM1_CRC_INIT_L_Msk (0xff00UL)         /*!< BLE_BLELL CONN_PARAM1: CRC_INIT_L (Bitfield-Mask: 0xff)   */
/* =================================================  BLE_BLELL.CONN_PARAM2  ================================================= */
#define BLE_BLELL_CONN_PARAM2_CRC_INIT_H_Pos (0UL)              /*!< BLE_BLELL CONN_PARAM2: CRC_INIT_H (Bit 0)                 */
#define BLE_BLELL_CONN_PARAM2_CRC_INIT_H_Msk (0xffffUL)         /*!< BLE_BLELL CONN_PARAM2: CRC_INIT_H (Bitfield-Mask: 0xffff) */
/* ===============================================  BLE_BLELL.CONN_INTR_MASK  ================================================ */
#define BLE_BLELL_CONN_INTR_MASK_CONN_CL_INT_EN_Pos (0UL)       /*!< BLE_BLELL CONN_INTR_MASK: CONN_CL_INT_EN (Bit 0)          */
#define BLE_BLELL_CONN_INTR_MASK_CONN_CL_INT_EN_Msk (0x1UL)     /*!< BLE_BLELL CONN_INTR_MASK: CONN_CL_INT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_MASK_CONN_ESTB_INT_EN_Pos (1UL)     /*!< BLE_BLELL CONN_INTR_MASK: CONN_ESTB_INT_EN (Bit 1)        */
#define BLE_BLELL_CONN_INTR_MASK_CONN_ESTB_INT_EN_Msk (0x2UL)   /*!< BLE_BLELL CONN_INTR_MASK: CONN_ESTB_INT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_MASK_MAP_UPDT_INT_EN_Pos (2UL)      /*!< BLE_BLELL CONN_INTR_MASK: MAP_UPDT_INT_EN (Bit 2)         */
#define BLE_BLELL_CONN_INTR_MASK_MAP_UPDT_INT_EN_Msk (0x4UL)    /*!< BLE_BLELL CONN_INTR_MASK: MAP_UPDT_INT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_MASK_START_CE_INT_EN_Pos (3UL)      /*!< BLE_BLELL CONN_INTR_MASK: START_CE_INT_EN (Bit 3)         */
#define BLE_BLELL_CONN_INTR_MASK_START_CE_INT_EN_Msk (0x8UL)    /*!< BLE_BLELL CONN_INTR_MASK: START_CE_INT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_MASK_CLOSE_CE_INT_EN_Pos (4UL)      /*!< BLE_BLELL CONN_INTR_MASK: CLOSE_CE_INT_EN (Bit 4)         */
#define BLE_BLELL_CONN_INTR_MASK_CLOSE_CE_INT_EN_Msk (0x10UL)   /*!< BLE_BLELL CONN_INTR_MASK: CLOSE_CE_INT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_MASK_CE_TX_ACK_INT_EN_Pos (5UL)     /*!< BLE_BLELL CONN_INTR_MASK: CE_TX_ACK_INT_EN (Bit 5)        */
#define BLE_BLELL_CONN_INTR_MASK_CE_TX_ACK_INT_EN_Msk (0x20UL)  /*!< BLE_BLELL CONN_INTR_MASK: CE_TX_ACK_INT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_MASK_CE_RX_INT_EN_Pos (6UL)         /*!< BLE_BLELL CONN_INTR_MASK: CE_RX_INT_EN (Bit 6)            */
#define BLE_BLELL_CONN_INTR_MASK_CE_RX_INT_EN_Msk (0x40UL)      /*!< BLE_BLELL CONN_INTR_MASK: CE_RX_INT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_MASK_CONN_UPDATE_INTR_EN_Pos (7UL)  /*!< BLE_BLELL CONN_INTR_MASK: CONN_UPDATE_INTR_EN (Bit 7)     */
#define BLE_BLELL_CONN_INTR_MASK_CONN_UPDATE_INTR_EN_Msk (0x80UL) /*!< BLE_BLELL CONN_INTR_MASK: CONN_UPDATE_INTR_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_MASK_RX_GOOD_PDU_INT_EN_Pos (8UL)   /*!< BLE_BLELL CONN_INTR_MASK: RX_GOOD_PDU_INT_EN (Bit 8)      */
#define BLE_BLELL_CONN_INTR_MASK_RX_GOOD_PDU_INT_EN_Msk (0x100UL) /*!< BLE_BLELL CONN_INTR_MASK: RX_GOOD_PDU_INT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_MASK_RX_BAD_PDU_INT_EN_Pos (9UL)    /*!< BLE_BLELL CONN_INTR_MASK: RX_BAD_PDU_INT_EN (Bit 9)       */
#define BLE_BLELL_CONN_INTR_MASK_RX_BAD_PDU_INT_EN_Msk (0x200UL) /*!< BLE_BLELL CONN_INTR_MASK: RX_BAD_PDU_INT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_MASK_PING_TIMER_EXPIRD_INTR_Pos (14UL) /*!< BLE_BLELL CONN_INTR_MASK: PING_TIMER_EXPIRD_INTR (Bit 14)*/
#define BLE_BLELL_CONN_INTR_MASK_PING_TIMER_EXPIRD_INTR_Msk (0x4000UL) /*!< BLE_BLELL CONN_INTR_MASK: PING_TIMER_EXPIRD_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_INTR_MASK_PING_NEARLY_EXPIRD_INTR_Pos (15UL) /*!< BLE_BLELL CONN_INTR_MASK: PING_NEARLY_EXPIRD_INTR (Bit 15)*/
#define BLE_BLELL_CONN_INTR_MASK_PING_NEARLY_EXPIRD_INTR_Msk (0x8000UL) /*!< BLE_BLELL CONN_INTR_MASK: PING_NEARLY_EXPIRD_INTR (Bitfield-Mask: 0x01)*/
/* ============================================  BLE_BLELL.SLAVE_TIMING_CONTROL  ============================================= */
#define BLE_BLELL_SLAVE_TIMING_CONTROL_SLAVE_TIME_SET_VAL_Pos (0UL) /*!< BLE_BLELL SLAVE_TIMING_CONTROL: SLAVE_TIME_SET_VAL (Bit 0)*/
#define BLE_BLELL_SLAVE_TIMING_CONTROL_SLAVE_TIME_SET_VAL_Msk (0xffUL) /*!< BLE_BLELL SLAVE_TIMING_CONTROL: SLAVE_TIME_SET_VAL (Bitfield-Mask: 0xff)*/
#define BLE_BLELL_SLAVE_TIMING_CONTROL_SLAVE_TIME_ADJ_VAL_Pos (8UL) /*!< BLE_BLELL SLAVE_TIMING_CONTROL: SLAVE_TIME_ADJ_VAL (Bit 8)*/
#define BLE_BLELL_SLAVE_TIMING_CONTROL_SLAVE_TIME_ADJ_VAL_Msk (0xff00UL) /*!< BLE_BLELL SLAVE_TIMING_CONTROL: SLAVE_TIME_ADJ_VAL (Bitfield-Mask: 0xff)*/
/* ==============================================  BLE_BLELL.RECEIVE_TRIG_CTRL  ============================================== */
#define BLE_BLELL_RECEIVE_TRIG_CTRL_ACC_TRIGGER_THRESHOLD_Pos (0UL) /*!< BLE_BLELL RECEIVE_TRIG_CTRL: ACC_TRIGGER_THRESHOLD (Bit 0)*/
#define BLE_BLELL_RECEIVE_TRIG_CTRL_ACC_TRIGGER_THRESHOLD_Msk (0x3fUL) /*!< BLE_BLELL RECEIVE_TRIG_CTRL: ACC_TRIGGER_THRESHOLD (Bitfield-Mask: 0x3f)*/
#define BLE_BLELL_RECEIVE_TRIG_CTRL_ACC_TRIGGER_TIMEOUT_Pos (8UL) /*!< BLE_BLELL RECEIVE_TRIG_CTRL: ACC_TRIGGER_TIMEOUT (Bit 8)*/
#define BLE_BLELL_RECEIVE_TRIG_CTRL_ACC_TRIGGER_TIMEOUT_Msk (0xff00UL) /*!< BLE_BLELL RECEIVE_TRIG_CTRL: ACC_TRIGGER_TIMEOUT (Bitfield-Mask: 0xff)*/
/* ==================================================  BLE_BLELL.LL_DBG_1  =================================================== */
#define BLE_BLELL_LL_DBG_1_CONN_RX_WR_PTR_Pos (0UL)             /*!< BLE_BLELL LL_DBG_1: CONN_RX_WR_PTR (Bit 0)                */
#define BLE_BLELL_LL_DBG_1_CONN_RX_WR_PTR_Msk (0x3ffUL)         /*!< BLE_BLELL LL_DBG_1: CONN_RX_WR_PTR (Bitfield-Mask: 0x3ff) */
/* ==================================================  BLE_BLELL.LL_DBG_2  =================================================== */
#define BLE_BLELL_LL_DBG_2_CONN_RX_RD_PTR_Pos (0UL)             /*!< BLE_BLELL LL_DBG_2: CONN_RX_RD_PTR (Bit 0)                */
#define BLE_BLELL_LL_DBG_2_CONN_RX_RD_PTR_Msk (0x3ffUL)         /*!< BLE_BLELL LL_DBG_2: CONN_RX_RD_PTR (Bitfield-Mask: 0x3ff) */
/* ==================================================  BLE_BLELL.LL_DBG_3  =================================================== */
#define BLE_BLELL_LL_DBG_3_CONN_RX_WR_PTR_STORE_Pos (0UL)       /*!< BLE_BLELL LL_DBG_3: CONN_RX_WR_PTR_STORE (Bit 0)          */
#define BLE_BLELL_LL_DBG_3_CONN_RX_WR_PTR_STORE_Msk (0x3ffUL)   /*!< BLE_BLELL LL_DBG_3: CONN_RX_WR_PTR_STORE (Bitfield-Mask: 0x3ff)*/
/* ==================================================  BLE_BLELL.LL_DBG_4  =================================================== */
#define BLE_BLELL_LL_DBG_4_CONNECTION_FSM_STATE_Pos (0UL)       /*!< BLE_BLELL LL_DBG_4: CONNECTION_FSM_STATE (Bit 0)          */
#define BLE_BLELL_LL_DBG_4_CONNECTION_FSM_STATE_Msk (0xfUL)     /*!< BLE_BLELL LL_DBG_4: CONNECTION_FSM_STATE (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_LL_DBG_4_SLAVE_LATENCY_FSM_STATE_Pos (4UL)    /*!< BLE_BLELL LL_DBG_4: SLAVE_LATENCY_FSM_STATE (Bit 4)       */
#define BLE_BLELL_LL_DBG_4_SLAVE_LATENCY_FSM_STATE_Msk (0x30UL) /*!< BLE_BLELL LL_DBG_4: SLAVE_LATENCY_FSM_STATE (Bitfield-Mask: 0x03)*/
#define BLE_BLELL_LL_DBG_4_ADVERTISER_FSM_STATE_Pos (6UL)       /*!< BLE_BLELL LL_DBG_4: ADVERTISER_FSM_STATE (Bit 6)          */
#define BLE_BLELL_LL_DBG_4_ADVERTISER_FSM_STATE_Msk (0x7c0UL)   /*!< BLE_BLELL LL_DBG_4: ADVERTISER_FSM_STATE (Bitfield-Mask: 0x1f)*/
/* ==================================================  BLE_BLELL.LL_DBG_5  =================================================== */
#define BLE_BLELL_LL_DBG_5_INIT_FSM_STATE_Pos (0UL)             /*!< BLE_BLELL LL_DBG_5: INIT_FSM_STATE (Bit 0)                */
#define BLE_BLELL_LL_DBG_5_INIT_FSM_STATE_Msk (0x1fUL)          /*!< BLE_BLELL LL_DBG_5: INIT_FSM_STATE (Bitfield-Mask: 0x1f)  */
#define BLE_BLELL_LL_DBG_5_SCAN_FSM_STATE_Pos (5UL)             /*!< BLE_BLELL LL_DBG_5: SCAN_FSM_STATE (Bit 5)                */
#define BLE_BLELL_LL_DBG_5_SCAN_FSM_STATE_Msk (0x3e0UL)         /*!< BLE_BLELL LL_DBG_5: SCAN_FSM_STATE (Bitfield-Mask: 0x1f)  */
/* ==================================================  BLE_BLELL.LL_DBG_6  =================================================== */
#define BLE_BLELL_LL_DBG_6_ADV_TX_WR_PTR_Pos (0UL)              /*!< BLE_BLELL LL_DBG_6: ADV_TX_WR_PTR (Bit 0)                 */
#define BLE_BLELL_LL_DBG_6_ADV_TX_WR_PTR_Msk (0xfUL)            /*!< BLE_BLELL LL_DBG_6: ADV_TX_WR_PTR (Bitfield-Mask: 0x0f)   */
#define BLE_BLELL_LL_DBG_6_SCAN_RSP_TX_WR_PTR_Pos (4UL)         /*!< BLE_BLELL LL_DBG_6: SCAN_RSP_TX_WR_PTR (Bit 4)            */
#define BLE_BLELL_LL_DBG_6_SCAN_RSP_TX_WR_PTR_Msk (0xf0UL)      /*!< BLE_BLELL LL_DBG_6: SCAN_RSP_TX_WR_PTR (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_LL_DBG_6_ADV_TX_RD_PTR_Pos (8UL)              /*!< BLE_BLELL LL_DBG_6: ADV_TX_RD_PTR (Bit 8)                 */
#define BLE_BLELL_LL_DBG_6_ADV_TX_RD_PTR_Msk (0x3f00UL)         /*!< BLE_BLELL LL_DBG_6: ADV_TX_RD_PTR (Bitfield-Mask: 0x3f)   */
/* ==================================================  BLE_BLELL.LL_DBG_7  =================================================== */
#define BLE_BLELL_LL_DBG_7_ADV_RX_WR_PTR_Pos (0UL)              /*!< BLE_BLELL LL_DBG_7: ADV_RX_WR_PTR (Bit 0)                 */
#define BLE_BLELL_LL_DBG_7_ADV_RX_WR_PTR_Msk (0x7fUL)           /*!< BLE_BLELL LL_DBG_7: ADV_RX_WR_PTR (Bitfield-Mask: 0x7f)   */
#define BLE_BLELL_LL_DBG_7_ADV_RX_RD_PTR_Pos (7UL)              /*!< BLE_BLELL LL_DBG_7: ADV_RX_RD_PTR (Bit 7)                 */
#define BLE_BLELL_LL_DBG_7_ADV_RX_RD_PTR_Msk (0x3f80UL)         /*!< BLE_BLELL LL_DBG_7: ADV_RX_RD_PTR (Bitfield-Mask: 0x7f)   */
/* ==================================================  BLE_BLELL.LL_DBG_8  =================================================== */
#define BLE_BLELL_LL_DBG_8_ADV_RX_WR_PTR_STORE_Pos (0UL)        /*!< BLE_BLELL LL_DBG_8: ADV_RX_WR_PTR_STORE (Bit 0)           */
#define BLE_BLELL_LL_DBG_8_ADV_RX_WR_PTR_STORE_Msk (0x7fUL)     /*!< BLE_BLELL LL_DBG_8: ADV_RX_WR_PTR_STORE (Bitfield-Mask: 0x7f)*/
#define BLE_BLELL_LL_DBG_8_WLF_PTR_Pos    (7UL)                 /*!< BLE_BLELL LL_DBG_8: WLF_PTR (Bit 7)                       */
#define BLE_BLELL_LL_DBG_8_WLF_PTR_Msk    (0x3f80UL)            /*!< BLE_BLELL LL_DBG_8: WLF_PTR (Bitfield-Mask: 0x7f)         */
/* ==================================================  BLE_BLELL.LL_DBG_9  =================================================== */
#define BLE_BLELL_LL_DBG_9_WINDOW_WIDEN_Pos (0UL)               /*!< BLE_BLELL LL_DBG_9: WINDOW_WIDEN (Bit 0)                  */
#define BLE_BLELL_LL_DBG_9_WINDOW_WIDEN_Msk (0xffffUL)          /*!< BLE_BLELL LL_DBG_9: WINDOW_WIDEN (Bitfield-Mask: 0xffff)  */
/* ==================================================  BLE_BLELL.LL_DBG_10  ================================================== */
#define BLE_BLELL_LL_DBG_10_RF_CHANNEL_NUM_Pos (0UL)            /*!< BLE_BLELL LL_DBG_10: RF_CHANNEL_NUM (Bit 0)               */
#define BLE_BLELL_LL_DBG_10_RF_CHANNEL_NUM_Msk (0x3fUL)         /*!< BLE_BLELL LL_DBG_10: RF_CHANNEL_NUM (Bitfield-Mask: 0x3f) */
/* ==============================================  BLE_BLELL.PEER_ADDR_INIT_L  =============================================== */
#define BLE_BLELL_PEER_ADDR_INIT_L_PEER_ADDR_L_Pos (0UL)        /*!< BLE_BLELL PEER_ADDR_INIT_L: PEER_ADDR_L (Bit 0)           */
#define BLE_BLELL_PEER_ADDR_INIT_L_PEER_ADDR_L_Msk (0xffffUL)   /*!< BLE_BLELL PEER_ADDR_INIT_L: PEER_ADDR_L (Bitfield-Mask: 0xffff)*/
/* ==============================================  BLE_BLELL.PEER_ADDR_INIT_M  =============================================== */
#define BLE_BLELL_PEER_ADDR_INIT_M_PEER_ADDR_M_Pos (0UL)        /*!< BLE_BLELL PEER_ADDR_INIT_M: PEER_ADDR_M (Bit 0)           */
#define BLE_BLELL_PEER_ADDR_INIT_M_PEER_ADDR_M_Msk (0xffffUL)   /*!< BLE_BLELL PEER_ADDR_INIT_M: PEER_ADDR_M (Bitfield-Mask: 0xffff)*/
/* ==============================================  BLE_BLELL.PEER_ADDR_INIT_H  =============================================== */
#define BLE_BLELL_PEER_ADDR_INIT_H_PEER_ADDR_H_Pos (0UL)        /*!< BLE_BLELL PEER_ADDR_INIT_H: PEER_ADDR_H (Bit 0)           */
#define BLE_BLELL_PEER_ADDR_INIT_H_PEER_ADDR_H_Msk (0xffffUL)   /*!< BLE_BLELL PEER_ADDR_INIT_H: PEER_ADDR_H (Bitfield-Mask: 0xffff)*/
/* ===========================================  BLE_BLELL.INIT_WINDOW_TIMER_CTRL  ============================================ */
#define BLE_BLELL_INIT_WINDOW_TIMER_CTRL_INIT_WINDOW_OFFSET_SEL_Pos (0UL) /*!< BLE_BLELL INIT_WINDOW_TIMER_CTRL: INIT_WINDOW_OFFSET_SEL (Bit 0)*/
#define BLE_BLELL_INIT_WINDOW_TIMER_CTRL_INIT_WINDOW_OFFSET_SEL_Msk (0x1UL) /*!< BLE_BLELL INIT_WINDOW_TIMER_CTRL: INIT_WINDOW_OFFSET_SEL (Bitfield-Mask: 0x01)*/
/* ===============================================  BLE_BLELL.CONN_CONFIG_EXT  =============================================== */
#define BLE_BLELL_CONN_CONFIG_EXT_CONN_REQ_2SLOT_EARLY_Pos (0UL) /*!< BLE_BLELL CONN_CONFIG_EXT: CONN_REQ_2SLOT_EARLY (Bit 0)  */
#define BLE_BLELL_CONN_CONFIG_EXT_CONN_REQ_2SLOT_EARLY_Msk (0x1UL) /*!< BLE_BLELL CONN_CONFIG_EXT: CONN_REQ_2SLOT_EARLY (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_CONFIG_EXT_CONN_REQ_3SLOT_EARLY_Pos (1UL) /*!< BLE_BLELL CONN_CONFIG_EXT: CONN_REQ_3SLOT_EARLY (Bit 1)  */
#define BLE_BLELL_CONN_CONFIG_EXT_CONN_REQ_3SLOT_EARLY_Msk (0x2UL) /*!< BLE_BLELL CONN_CONFIG_EXT: CONN_REQ_3SLOT_EARLY (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_CONFIG_EXT_FW_PKT_RCV_CONN_INDEX_Pos (2UL) /*!< BLE_BLELL CONN_CONFIG_EXT: FW_PKT_RCV_CONN_INDEX (Bit 2)*/
#define BLE_BLELL_CONN_CONFIG_EXT_FW_PKT_RCV_CONN_INDEX_Msk (0x7cUL) /*!< BLE_BLELL CONN_CONFIG_EXT: FW_PKT_RCV_CONN_INDEX (Bitfield-Mask: 0x1f)*/
#define BLE_BLELL_CONN_CONFIG_EXT_MMMS_RX_PKT_LIMIT_Pos (8UL)   /*!< BLE_BLELL CONN_CONFIG_EXT: MMMS_RX_PKT_LIMIT (Bit 8)      */
#define BLE_BLELL_CONN_CONFIG_EXT_MMMS_RX_PKT_LIMIT_Msk (0x3f00UL) /*!< BLE_BLELL CONN_CONFIG_EXT: MMMS_RX_PKT_LIMIT (Bitfield-Mask: 0x3f)*/
#define BLE_BLELL_CONN_CONFIG_EXT_DEBUG_CE_EXPIRE_Pos (14UL)    /*!< BLE_BLELL CONN_CONFIG_EXT: DEBUG_CE_EXPIRE (Bit 14)       */
#define BLE_BLELL_CONN_CONFIG_EXT_DEBUG_CE_EXPIRE_Msk (0x4000UL) /*!< BLE_BLELL CONN_CONFIG_EXT: DEBUG_CE_EXPIRE (Bitfield-Mask: 0x01)*/
/* =================================================  BLE_BLELL.DPLL_CONFIG  ================================================= */
#define BLE_BLELL_DPLL_CONFIG_DPLL_CORREL_CONFIG_Pos (0UL)      /*!< BLE_BLELL DPLL_CONFIG: DPLL_CORREL_CONFIG (Bit 0)         */
#define BLE_BLELL_DPLL_CONFIG_DPLL_CORREL_CONFIG_Msk (0xffffUL) /*!< BLE_BLELL DPLL_CONFIG: DPLL_CORREL_CONFIG (Bitfield-Mask: 0xffff)*/
/* =================================================  BLE_BLELL.INIT_NI_VAL  ================================================= */
#define BLE_BLELL_INIT_NI_VAL_INIT_NI_VAL_Pos (0UL)             /*!< BLE_BLELL INIT_NI_VAL: INIT_NI_VAL (Bit 0)                */
#define BLE_BLELL_INIT_NI_VAL_INIT_NI_VAL_Msk (0xffffUL)        /*!< BLE_BLELL INIT_NI_VAL: INIT_NI_VAL (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_BLELL.INIT_WINDOW_OFFSET  ============================================== */
#define BLE_BLELL_INIT_WINDOW_OFFSET_INIT_WINDOW_NI_Pos (0UL)   /*!< BLE_BLELL INIT_WINDOW_OFFSET: INIT_WINDOW_NI (Bit 0)      */
#define BLE_BLELL_INIT_WINDOW_OFFSET_INIT_WINDOW_NI_Msk (0xffffUL) /*!< BLE_BLELL INIT_WINDOW_OFFSET: INIT_WINDOW_NI (Bitfield-Mask: 0xffff)*/
/* ==========================================  BLE_BLELL.INIT_WINDOW_NI_ANCHOR_PT  =========================================== */
#define BLE_BLELL_INIT_WINDOW_NI_ANCHOR_PT_INIT_INT_OFF_CAPT_Pos (0UL) /*!< BLE_BLELL INIT_WINDOW_NI_ANCHOR_PT: INIT_INT_OFF_CAPT (Bit 0)*/
#define BLE_BLELL_INIT_WINDOW_NI_ANCHOR_PT_INIT_INT_OFF_CAPT_Msk (0xffffUL) /*!< BLE_BLELL INIT_WINDOW_NI_ANCHOR_PT: INIT_INT_OFF_CAPT (Bitfield-Mask: 0xffff)*/
/* ==========================================  BLE_BLELL.CONN_UPDATE_NEW_INTERVAL  =========================================== */
#define BLE_BLELL_CONN_UPDATE_NEW_INTERVAL_CONN_UPDT_INTERVAL_Pos (0UL) /*!< BLE_BLELL CONN_UPDATE_NEW_INTERVAL: CONN_UPDT_INTERVAL (Bit 0)*/
#define BLE_BLELL_CONN_UPDATE_NEW_INTERVAL_CONN_UPDT_INTERVAL_Msk (0xffffUL) /*!< BLE_BLELL CONN_UPDATE_NEW_INTERVAL: CONN_UPDT_INTERVAL (Bitfield-Mask: 0xffff)*/
/* ===========================================  BLE_BLELL.CONN_UPDATE_NEW_LATENCY  =========================================== */
#define BLE_BLELL_CONN_UPDATE_NEW_LATENCY_CONN_UPDT_SLV_LATENCY_Pos (0UL) /*!< BLE_BLELL CONN_UPDATE_NEW_LATENCY: CONN_UPDT_SLV_LATENCY (Bit 0)*/
#define BLE_BLELL_CONN_UPDATE_NEW_LATENCY_CONN_UPDT_SLV_LATENCY_Msk (0xffffUL) /*!< BLE_BLELL CONN_UPDATE_NEW_LATENCY: CONN_UPDT_SLV_LATENCY (Bitfield-Mask: 0xffff)*/
/* ===========================================  BLE_BLELL.CONN_UPDATE_NEW_SUP_TO  ============================================ */
#define BLE_BLELL_CONN_UPDATE_NEW_SUP_TO_CONN_UPDT_SUP_TO_Pos (0UL) /*!< BLE_BLELL CONN_UPDATE_NEW_SUP_TO: CONN_UPDT_SUP_TO (Bit 0)*/
#define BLE_BLELL_CONN_UPDATE_NEW_SUP_TO_CONN_UPDT_SUP_TO_Msk (0xffffUL) /*!< BLE_BLELL CONN_UPDATE_NEW_SUP_TO: CONN_UPDT_SUP_TO (Bitfield-Mask: 0xffff)*/
/* =========================================  BLE_BLELL.CONN_UPDATE_NEW_SL_INTERVAL  ========================================= */
#define BLE_BLELL_CONN_UPDATE_NEW_SL_INTERVAL_SL_CONN_INTERVAL_VAL_Pos (0UL) /*!< BLE_BLELL CONN_UPDATE_NEW_SL_INTERVAL: SL_CONN_INTERVAL_VAL (Bit 0)*/
#define BLE_BLELL_CONN_UPDATE_NEW_SL_INTERVAL_SL_CONN_INTERVAL_VAL_Msk (0xffffUL) /*!< BLE_BLELL CONN_UPDATE_NEW_SL_INTERVAL: SL_CONN_INTERVAL_VAL (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD0  ================================================ */
#define BLE_BLELL_CONN_REQ_WORD0_ACCESS_ADDR_LOWER_Pos (0UL)    /*!< BLE_BLELL CONN_REQ_WORD0: ACCESS_ADDR_LOWER (Bit 0)       */
#define BLE_BLELL_CONN_REQ_WORD0_ACCESS_ADDR_LOWER_Msk (0xffffUL) /*!< BLE_BLELL CONN_REQ_WORD0: ACCESS_ADDR_LOWER (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD1  ================================================ */
#define BLE_BLELL_CONN_REQ_WORD1_ACCESS_ADDR_UPPER_Pos (0UL)    /*!< BLE_BLELL CONN_REQ_WORD1: ACCESS_ADDR_UPPER (Bit 0)       */
#define BLE_BLELL_CONN_REQ_WORD1_ACCESS_ADDR_UPPER_Msk (0xffffUL) /*!< BLE_BLELL CONN_REQ_WORD1: ACCESS_ADDR_UPPER (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD2  ================================================ */
#define BLE_BLELL_CONN_REQ_WORD2_TX_WINDOW_SIZE_VAL_Pos (0UL)   /*!< BLE_BLELL CONN_REQ_WORD2: TX_WINDOW_SIZE_VAL (Bit 0)      */
#define BLE_BLELL_CONN_REQ_WORD2_TX_WINDOW_SIZE_VAL_Msk (0xffUL) /*!< BLE_BLELL CONN_REQ_WORD2: TX_WINDOW_SIZE_VAL (Bitfield-Mask: 0xff)*/
#define BLE_BLELL_CONN_REQ_WORD2_CRC_INIT_LOWER_Pos (8UL)       /*!< BLE_BLELL CONN_REQ_WORD2: CRC_INIT_LOWER (Bit 8)          */
#define BLE_BLELL_CONN_REQ_WORD2_CRC_INIT_LOWER_Msk (0xff00UL)  /*!< BLE_BLELL CONN_REQ_WORD2: CRC_INIT_LOWER (Bitfield-Mask: 0xff)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD3  ================================================ */
#define BLE_BLELL_CONN_REQ_WORD3_CRC_INIT_UPPER_Pos (0UL)       /*!< BLE_BLELL CONN_REQ_WORD3: CRC_INIT_UPPER (Bit 0)          */
#define BLE_BLELL_CONN_REQ_WORD3_CRC_INIT_UPPER_Msk (0xffffUL)  /*!< BLE_BLELL CONN_REQ_WORD3: CRC_INIT_UPPER (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD4  ================================================ */
#define BLE_BLELL_CONN_REQ_WORD4_TX_WINDOW_OFFSET_Pos (0UL)     /*!< BLE_BLELL CONN_REQ_WORD4: TX_WINDOW_OFFSET (Bit 0)        */
#define BLE_BLELL_CONN_REQ_WORD4_TX_WINDOW_OFFSET_Msk (0xffffUL) /*!< BLE_BLELL CONN_REQ_WORD4: TX_WINDOW_OFFSET (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD5  ================================================ */
#define BLE_BLELL_CONN_REQ_WORD5_CONNECTION_INTERVAL_VAL_Pos (0UL) /*!< BLE_BLELL CONN_REQ_WORD5: CONNECTION_INTERVAL_VAL (Bit 0)*/
#define BLE_BLELL_CONN_REQ_WORD5_CONNECTION_INTERVAL_VAL_Msk (0xffffUL) /*!< BLE_BLELL CONN_REQ_WORD5: CONNECTION_INTERVAL_VAL (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD6  ================================================ */
#define BLE_BLELL_CONN_REQ_WORD6_SLAVE_LATENCY_VAL_Pos (0UL)    /*!< BLE_BLELL CONN_REQ_WORD6: SLAVE_LATENCY_VAL (Bit 0)       */
#define BLE_BLELL_CONN_REQ_WORD6_SLAVE_LATENCY_VAL_Msk (0xffffUL) /*!< BLE_BLELL CONN_REQ_WORD6: SLAVE_LATENCY_VAL (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD7  ================================================ */
#define BLE_BLELL_CONN_REQ_WORD7_SUPERVISION_TIMEOUT_VAL_Pos (0UL) /*!< BLE_BLELL CONN_REQ_WORD7: SUPERVISION_TIMEOUT_VAL (Bit 0)*/
#define BLE_BLELL_CONN_REQ_WORD7_SUPERVISION_TIMEOUT_VAL_Msk (0xffffUL) /*!< BLE_BLELL CONN_REQ_WORD7: SUPERVISION_TIMEOUT_VAL (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD8  ================================================ */
