ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
#define BLE_BLELL_CONN_REQ_WORD8_DATA_CHANNELS_LOWER_Pos (0UL)  /*!< BLE_BLELL CONN_REQ_WORD8: DATA_CHANNELS_LOWER (Bit 0)     */
#define BLE_BLELL_CONN_REQ_WORD8_DATA_CHANNELS_LOWER_Msk (0xffffUL) /*!< BLE_BLELL CONN_REQ_WORD8: DATA_CHANNELS_LOWER (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD9  ================================================ */
#define BLE_BLELL_CONN_REQ_WORD9_DATA_CHANNELS_MID_Pos (0UL)    /*!< BLE_BLELL CONN_REQ_WORD9: DATA_CHANNELS_MID (Bit 0)       */
#define BLE_BLELL_CONN_REQ_WORD9_DATA_CHANNELS_MID_Msk (0xffffUL) /*!< BLE_BLELL CONN_REQ_WORD9: DATA_CHANNELS_MID (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD10  =============================================== */
#define BLE_BLELL_CONN_REQ_WORD10_DATA_CHANNELS_UPPER_Pos (0UL) /*!< BLE_BLELL CONN_REQ_WORD10: DATA_CHANNELS_UPPER (Bit 0)    */
#define BLE_BLELL_CONN_REQ_WORD10_DATA_CHANNELS_UPPER_Msk (0x1fUL) /*!< BLE_BLELL CONN_REQ_WORD10: DATA_CHANNELS_UPPER (Bitfield-Mask: 0x1f)*/
/* ===============================================  BLE_BLELL.CONN_REQ_WORD11  =============================================== */
#define BLE_BLELL_CONN_REQ_WORD11_HOP_INCREMENT_2_Pos (0UL)     /*!< BLE_BLELL CONN_REQ_WORD11: HOP_INCREMENT_2 (Bit 0)        */
#define BLE_BLELL_CONN_REQ_WORD11_HOP_INCREMENT_2_Msk (0x1fUL)  /*!< BLE_BLELL CONN_REQ_WORD11: HOP_INCREMENT_2 (Bitfield-Mask: 0x1f)*/
#define BLE_BLELL_CONN_REQ_WORD11_SCA_2_Pos (5UL)               /*!< BLE_BLELL CONN_REQ_WORD11: SCA_2 (Bit 5)                  */
#define BLE_BLELL_CONN_REQ_WORD11_SCA_2_Msk (0xe0UL)            /*!< BLE_BLELL CONN_REQ_WORD11: SCA_2 (Bitfield-Mask: 0x07)    */
/* ===============================================  BLE_BLELL.PDU_RESP_TIMER  ================================================ */
#define BLE_BLELL_PDU_RESP_TIMER_PDU_RESP_TIME_VAL_Pos (0UL)    /*!< BLE_BLELL PDU_RESP_TIMER: PDU_RESP_TIME_VAL (Bit 0)       */
#define BLE_BLELL_PDU_RESP_TIMER_PDU_RESP_TIME_VAL_Msk (0xffffUL) /*!< BLE_BLELL PDU_RESP_TIMER: PDU_RESP_TIME_VAL (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_BLELL.NEXT_RESP_TIMER_EXP  ============================================= */
#define BLE_BLELL_NEXT_RESP_TIMER_EXP_NEXT_RESPONSE_INSTANT_Pos (0UL) /*!< BLE_BLELL NEXT_RESP_TIMER_EXP: NEXT_RESPONSE_INSTANT (Bit 0)*/
#define BLE_BLELL_NEXT_RESP_TIMER_EXP_NEXT_RESPONSE_INSTANT_Msk (0xffffUL) /*!< BLE_BLELL NEXT_RESP_TIMER_EXP: NEXT_RESPONSE_INSTANT (Bitfield-Mask: 0xffff)*/
/* =================================================  BLE_BLELL.NEXT_SUP_TO  ================================================= */
#define BLE_BLELL_NEXT_SUP_TO_NEXT_TIMEOUT_INSTANT_Pos (0UL)    /*!< BLE_BLELL NEXT_SUP_TO: NEXT_TIMEOUT_INSTANT (Bit 0)       */
#define BLE_BLELL_NEXT_SUP_TO_NEXT_TIMEOUT_INSTANT_Msk (0xffffUL) /*!< BLE_BLELL NEXT_SUP_TO: NEXT_TIMEOUT_INSTANT (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_BLELL.LLH_FEATURE_CONFIG  ============================================== */
#define BLE_BLELL_LLH_FEATURE_CONFIG_QUICK_TRANSMIT_Pos (0UL)   /*!< BLE_BLELL LLH_FEATURE_CONFIG: QUICK_TRANSMIT (Bit 0)      */
#define BLE_BLELL_LLH_FEATURE_CONFIG_QUICK_TRANSMIT_Msk (0x1UL) /*!< BLE_BLELL LLH_FEATURE_CONFIG: QUICK_TRANSMIT (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LLH_FEATURE_CONFIG_SL_DSM_EN_Pos (1UL)        /*!< BLE_BLELL LLH_FEATURE_CONFIG: SL_DSM_EN (Bit 1)           */
#define BLE_BLELL_LLH_FEATURE_CONFIG_SL_DSM_EN_Msk (0x2UL)      /*!< BLE_BLELL LLH_FEATURE_CONFIG: SL_DSM_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LLH_FEATURE_CONFIG_US_COUNTER_OFFSET_ADJ_Pos (2UL) /*!< BLE_BLELL LLH_FEATURE_CONFIG: US_COUNTER_OFFSET_ADJ (Bit 2)*/
#define BLE_BLELL_LLH_FEATURE_CONFIG_US_COUNTER_OFFSET_ADJ_Msk (0x4UL) /*!< BLE_BLELL LLH_FEATURE_CONFIG: US_COUNTER_OFFSET_ADJ (Bitfield-Mask: 0x01)*/
/* ==============================================  BLE_BLELL.WIN_MIN_STEP_SIZE  ============================================== */
#define BLE_BLELL_WIN_MIN_STEP_SIZE_STEPDN_Pos (0UL)            /*!< BLE_BLELL WIN_MIN_STEP_SIZE: STEPDN (Bit 0)               */
#define BLE_BLELL_WIN_MIN_STEP_SIZE_STEPDN_Msk (0xfUL)          /*!< BLE_BLELL WIN_MIN_STEP_SIZE: STEPDN (Bitfield-Mask: 0x0f) */
#define BLE_BLELL_WIN_MIN_STEP_SIZE_STEPUP_Pos (4UL)            /*!< BLE_BLELL WIN_MIN_STEP_SIZE: STEPUP (Bit 4)               */
#define BLE_BLELL_WIN_MIN_STEP_SIZE_STEPUP_Msk (0xf0UL)         /*!< BLE_BLELL WIN_MIN_STEP_SIZE: STEPUP (Bitfield-Mask: 0x0f) */
#define BLE_BLELL_WIN_MIN_STEP_SIZE_WINDOW_MIN_FW_Pos (8UL)     /*!< BLE_BLELL WIN_MIN_STEP_SIZE: WINDOW_MIN_FW (Bit 8)        */
#define BLE_BLELL_WIN_MIN_STEP_SIZE_WINDOW_MIN_FW_Msk (0xff00UL) /*!< BLE_BLELL WIN_MIN_STEP_SIZE: WINDOW_MIN_FW (Bitfield-Mask: 0xff)*/
/* =================================================  BLE_BLELL.SLV_WIN_ADJ  ================================================= */
#define BLE_BLELL_SLV_WIN_ADJ_SLV_WIN_ADJ_Pos (0UL)             /*!< BLE_BLELL SLV_WIN_ADJ: SLV_WIN_ADJ (Bit 0)                */
#define BLE_BLELL_SLV_WIN_ADJ_SLV_WIN_ADJ_Msk (0x7ffUL)         /*!< BLE_BLELL SLV_WIN_ADJ: SLV_WIN_ADJ (Bitfield-Mask: 0x7ff) */
/* ==============================================  BLE_BLELL.SL_CONN_INTERVAL  =============================================== */
#define BLE_BLELL_SL_CONN_INTERVAL_SL_CONN_INTERVAL_VAL_Pos (0UL) /*!< BLE_BLELL SL_CONN_INTERVAL: SL_CONN_INTERVAL_VAL (Bit 0)*/
#define BLE_BLELL_SL_CONN_INTERVAL_SL_CONN_INTERVAL_VAL_Msk (0xffffUL) /*!< BLE_BLELL SL_CONN_INTERVAL: SL_CONN_INTERVAL_VAL (Bitfield-Mask: 0xffff)*/
/* =============================================  BLE_BLELL.LE_PING_TIMER_ADDR  ============================================== */
#define BLE_BLELL_LE_PING_TIMER_ADDR_CONN_PING_TIMER_ADDR_Pos (0UL) /*!< BLE_BLELL LE_PING_TIMER_ADDR: CONN_PING_TIMER_ADDR (Bit 0)*/
#define BLE_BLELL_LE_PING_TIMER_ADDR_CONN_PING_TIMER_ADDR_Msk (0xffffUL) /*!< BLE_BLELL LE_PING_TIMER_ADDR: CONN_PING_TIMER_ADDR (Bitfield-Mask: 0xffff)*/
/* ============================================  BLE_BLELL.LE_PING_TIMER_OFFSET  ============================================= */
#define BLE_BLELL_LE_PING_TIMER_OFFSET_CONN_PING_TIMER_OFFSET_Pos (0UL) /*!< BLE_BLELL LE_PING_TIMER_OFFSET: CONN_PING_TIMER_OFFSET (Bit 0)*/
#define BLE_BLELL_LE_PING_TIMER_OFFSET_CONN_PING_TIMER_OFFSET_Msk (0xffffUL) /*!< BLE_BLELL LE_PING_TIMER_OFFSET: CONN_PING_TIMER_OFFSET (Bitfield-Mask: 0xffff)*/
/* ===========================================  BLE_BLELL.LE_PING_TIMER_NEXT_EXP  ============================================ */
#define BLE_BLELL_LE_PING_TIMER_NEXT_EXP_CONN_PING_TIMER_NEXT_EXP_Pos (0UL) /*!< BLE_BLELL LE_PING_TIMER_NEXT_EXP: CONN_PING_TIMER_NEXT_EXP (Bit 0)*/
#define BLE_BLELL_LE_PING_TIMER_NEXT_EXP_CONN_PING_TIMER_NEXT_EXP_Msk (0xffffUL) /*!< BLE_BLELL LE_PING_TIMER_NEXT_EXP: CONN_PING_TIMER_NEXT_EXP (Bitfield-Mask: 0xffff)*/
/* ==========================================  BLE_BLELL.LE_PING_TIMER_WRAP_COUNT  =========================================== */
#define BLE_BLELL_LE_PING_TIMER_WRAP_COUNT_CONN_SEC_CURRENT_WRAP_Pos (0UL) /*!< BLE_BLELL LE_PING_TIMER_WRAP_COUNT: CONN_SEC_CURRENT_WRAP (Bit 0)*/
#define BLE_BLELL_LE_PING_TIMER_WRAP_COUNT_CONN_SEC_CURRENT_WRAP_Msk (0xffffUL) /*!< BLE_BLELL LE_PING_TIMER_WRAP_COUNT: CONN_SEC_CURRENT_WRAP (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.TX_EN_EXT_DELAY  =============================================== */
#define BLE_BLELL_TX_EN_EXT_DELAY_TXEN_EXT_DELAY_Pos (0UL)      /*!< BLE_BLELL TX_EN_EXT_DELAY: TXEN_EXT_DELAY (Bit 0)         */
#define BLE_BLELL_TX_EN_EXT_DELAY_TXEN_EXT_DELAY_Msk (0xfUL)    /*!< BLE_BLELL TX_EN_EXT_DELAY: TXEN_EXT_DELAY (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_TX_EN_EXT_DELAY_RXEN_EXT_DELAY_Pos (4UL)      /*!< BLE_BLELL TX_EN_EXT_DELAY: RXEN_EXT_DELAY (Bit 4)         */
#define BLE_BLELL_TX_EN_EXT_DELAY_RXEN_EXT_DELAY_Msk (0xf0UL)   /*!< BLE_BLELL TX_EN_EXT_DELAY: RXEN_EXT_DELAY (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_TX_EN_EXT_DELAY_DEMOD_2M_COMP_DLY_Pos (8UL)   /*!< BLE_BLELL TX_EN_EXT_DELAY: DEMOD_2M_COMP_DLY (Bit 8)      */
#define BLE_BLELL_TX_EN_EXT_DELAY_DEMOD_2M_COMP_DLY_Msk (0xf00UL) /*!< BLE_BLELL TX_EN_EXT_DELAY: DEMOD_2M_COMP_DLY (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_TX_EN_EXT_DELAY_MOD_2M_COMP_DLY_Pos (12UL)    /*!< BLE_BLELL TX_EN_EXT_DELAY: MOD_2M_COMP_DLY (Bit 12)       */
#define BLE_BLELL_TX_EN_EXT_DELAY_MOD_2M_COMP_DLY_Msk (0xf000UL) /*!< BLE_BLELL TX_EN_EXT_DELAY: MOD_2M_COMP_DLY (Bitfield-Mask: 0x0f)*/
/* ==============================================  BLE_BLELL.TX_RX_SYNTH_DELAY  ============================================== */
#define BLE_BLELL_TX_RX_SYNTH_DELAY_RX_EN_DELAY_Pos (0UL)       /*!< BLE_BLELL TX_RX_SYNTH_DELAY: RX_EN_DELAY (Bit 0)          */
#define BLE_BLELL_TX_RX_SYNTH_DELAY_RX_EN_DELAY_Msk (0xffUL)    /*!< BLE_BLELL TX_RX_SYNTH_DELAY: RX_EN_DELAY (Bitfield-Mask: 0xff)*/
#define BLE_BLELL_TX_RX_SYNTH_DELAY_TX_EN_DELAY_Pos (8UL)       /*!< BLE_BLELL TX_RX_SYNTH_DELAY: TX_EN_DELAY (Bit 8)          */
#define BLE_BLELL_TX_RX_SYNTH_DELAY_TX_EN_DELAY_Msk (0xff00UL)  /*!< BLE_BLELL TX_RX_SYNTH_DELAY: TX_EN_DELAY (Bitfield-Mask: 0xff)*/
/* =============================================  BLE_BLELL.EXT_PA_LNA_DLY_CNFG  ============================================= */
#define BLE_BLELL_EXT_PA_LNA_DLY_CNFG_LNA_CTL_DELAY_Pos (0UL)   /*!< BLE_BLELL EXT_PA_LNA_DLY_CNFG: LNA_CTL_DELAY (Bit 0)      */
#define BLE_BLELL_EXT_PA_LNA_DLY_CNFG_LNA_CTL_DELAY_Msk (0xffUL) /*!< BLE_BLELL EXT_PA_LNA_DLY_CNFG: LNA_CTL_DELAY (Bitfield-Mask: 0xff)*/
#define BLE_BLELL_EXT_PA_LNA_DLY_CNFG_PA_CTL_DELAY_Pos (8UL)    /*!< BLE_BLELL EXT_PA_LNA_DLY_CNFG: PA_CTL_DELAY (Bit 8)       */
#define BLE_BLELL_EXT_PA_LNA_DLY_CNFG_PA_CTL_DELAY_Msk (0xff00UL) /*!< BLE_BLELL EXT_PA_LNA_DLY_CNFG: PA_CTL_DELAY (Bitfield-Mask: 0xff)*/
/* ==================================================  BLE_BLELL.LL_CONFIG  ================================================== */
#define BLE_BLELL_LL_CONFIG_RSSI_SEL_Pos  (0UL)                 /*!< BLE_BLELL LL_CONFIG: RSSI_SEL (Bit 0)                     */
#define BLE_BLELL_LL_CONFIG_RSSI_SEL_Msk  (0x1UL)               /*!< BLE_BLELL LL_CONFIG: RSSI_SEL (Bitfield-Mask: 0x01)       */
#define BLE_BLELL_LL_CONFIG_TX_RX_CTRL_SEL_Pos (1UL)            /*!< BLE_BLELL LL_CONFIG: TX_RX_CTRL_SEL (Bit 1)               */
#define BLE_BLELL_LL_CONFIG_TX_RX_CTRL_SEL_Msk (0x2UL)          /*!< BLE_BLELL LL_CONFIG: TX_RX_CTRL_SEL (Bitfield-Mask: 0x01) */
#define BLE_BLELL_LL_CONFIG_TIFS_ENABLE_Pos (2UL)               /*!< BLE_BLELL LL_CONFIG: TIFS_ENABLE (Bit 2)                  */
#define BLE_BLELL_LL_CONFIG_TIFS_ENABLE_Msk (0x4UL)             /*!< BLE_BLELL LL_CONFIG: TIFS_ENABLE (Bitfield-Mask: 0x01)    */
#define BLE_BLELL_LL_CONFIG_TIMER_LF_SLOT_ENABLE_Pos (3UL)      /*!< BLE_BLELL LL_CONFIG: TIMER_LF_SLOT_ENABLE (Bit 3)         */
#define BLE_BLELL_LL_CONFIG_TIMER_LF_SLOT_ENABLE_Msk (0x8UL)    /*!< BLE_BLELL LL_CONFIG: TIMER_LF_SLOT_ENABLE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONFIG_RSSI_INTR_SEL_Pos (5UL)             /*!< BLE_BLELL LL_CONFIG: RSSI_INTR_SEL (Bit 5)                */
#define BLE_BLELL_LL_CONFIG_RSSI_INTR_SEL_Msk (0x20UL)          /*!< BLE_BLELL LL_CONFIG: RSSI_INTR_SEL (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_LL_CONFIG_RSSI_EARLY_CNFG_Pos (6UL)           /*!< BLE_BLELL LL_CONFIG: RSSI_EARLY_CNFG (Bit 6)              */
#define BLE_BLELL_LL_CONFIG_RSSI_EARLY_CNFG_Msk (0x40UL)        /*!< BLE_BLELL LL_CONFIG: RSSI_EARLY_CNFG (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONFIG_TX_RX_PIN_DLY_Pos (7UL)             /*!< BLE_BLELL LL_CONFIG: TX_RX_PIN_DLY (Bit 7)                */
#define BLE_BLELL_LL_CONFIG_TX_RX_PIN_DLY_Msk (0x80UL)          /*!< BLE_BLELL LL_CONFIG: TX_RX_PIN_DLY (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_LL_CONFIG_TX_PA_PWR_LVL_TYPE_Pos (8UL)        /*!< BLE_BLELL LL_CONFIG: TX_PA_PWR_LVL_TYPE (Bit 8)           */
#define BLE_BLELL_LL_CONFIG_TX_PA_PWR_LVL_TYPE_Msk (0x100UL)    /*!< BLE_BLELL LL_CONFIG: TX_PA_PWR_LVL_TYPE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONFIG_RSSI_ENERGY_RD_Pos (9UL)            /*!< BLE_BLELL LL_CONFIG: RSSI_ENERGY_RD (Bit 9)               */
#define BLE_BLELL_LL_CONFIG_RSSI_ENERGY_RD_Msk (0x200UL)        /*!< BLE_BLELL LL_CONFIG: RSSI_ENERGY_RD (Bitfield-Mask: 0x01) */
#define BLE_BLELL_LL_CONFIG_RSSI_EACH_PKT_Pos (10UL)            /*!< BLE_BLELL LL_CONFIG: RSSI_EACH_PKT (Bit 10)               */
#define BLE_BLELL_LL_CONFIG_RSSI_EACH_PKT_Msk (0x400UL)         /*!< BLE_BLELL LL_CONFIG: RSSI_EACH_PKT (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_LL_CONFIG_FORCE_TRIG_RCB_UPDATE_Pos (11UL)    /*!< BLE_BLELL LL_CONFIG: FORCE_TRIG_RCB_UPDATE (Bit 11)       */
#define BLE_BLELL_LL_CONFIG_FORCE_TRIG_RCB_UPDATE_Msk (0x800UL) /*!< BLE_BLELL LL_CONFIG: FORCE_TRIG_RCB_UPDATE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONFIG_CHECK_DUP_CONN_Pos (12UL)           /*!< BLE_BLELL LL_CONFIG: CHECK_DUP_CONN (Bit 12)              */
#define BLE_BLELL_LL_CONFIG_CHECK_DUP_CONN_Msk (0x1000UL)       /*!< BLE_BLELL LL_CONFIG: CHECK_DUP_CONN (Bitfield-Mask: 0x01) */
#define BLE_BLELL_LL_CONFIG_MULTI_ENGINE_LPM_Pos (13UL)         /*!< BLE_BLELL LL_CONFIG: MULTI_ENGINE_LPM (Bit 13)            */
#define BLE_BLELL_LL_CONFIG_MULTI_ENGINE_LPM_Msk (0x2000UL)     /*!< BLE_BLELL LL_CONFIG: MULTI_ENGINE_LPM (Bitfield-Mask: 0x01)*/
/* =================================================  BLE_BLELL.LL_CONTROL  ================================================== */
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_Pos (0UL)                 /*!< BLE_BLELL LL_CONTROL: PRIV_1_2 (Bit 0)                    */
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_Msk (0x1UL)               /*!< BLE_BLELL LL_CONTROL: PRIV_1_2 (Bitfield-Mask: 0x01)      */
#define BLE_BLELL_LL_CONTROL_DLE_Pos      (1UL)                 /*!< BLE_BLELL LL_CONTROL: DLE (Bit 1)                         */
#define BLE_BLELL_LL_CONTROL_DLE_Msk      (0x2UL)               /*!< BLE_BLELL LL_CONTROL: DLE (Bitfield-Mask: 0x01)           */
#define BLE_BLELL_LL_CONTROL_WL_READ_AS_MEM_Pos (2UL)           /*!< BLE_BLELL LL_CONTROL: WL_READ_AS_MEM (Bit 2)              */
#define BLE_BLELL_LL_CONTROL_WL_READ_AS_MEM_Msk (0x4UL)         /*!< BLE_BLELL LL_CONTROL: WL_READ_AS_MEM (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONTROL_ADVCH_FIFO_PRIV_1_2_FLUSH_CTRL_Pos (3UL) /*!< BLE_BLELL LL_CONTROL: ADVCH_FIFO_PRIV_1_2_FLUSH_CTRL (Bit 3)*/
#define BLE_BLELL_LL_CONTROL_ADVCH_FIFO_PRIV_1_2_FLUSH_CTRL_Msk (0x8UL) /*!< BLE_BLELL LL_CONTROL: ADVCH_FIFO_PRIV_1_2_FLUSH_CTRL (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONTROL_HW_RSLV_LIST_FULL_Pos (4UL)        /*!< BLE_BLELL LL_CONTROL: HW_RSLV_LIST_FULL (Bit 4)           */
#define BLE_BLELL_LL_CONTROL_HW_RSLV_LIST_FULL_Msk (0x10UL)     /*!< BLE_BLELL LL_CONTROL: HW_RSLV_LIST_FULL (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONTROL_RPT_INIT_ADDR_MATCH_PRIV_MISMATCH_ADV_Pos (5UL) /*!< BLE_BLELL LL_CONTROL: RPT_INIT_ADDR_MATCH_PRIV_MISMATCH_ADV (Bit 5)*/
#define BLE_BLELL_LL_CONTROL_RPT_INIT_ADDR_MATCH_PRIV_MISMATCH_ADV_Msk (0x20UL) /*!< BLE_BLELL LL_CONTROL: RPT_INIT_ADDR_MATCH_PRIV_MISMATCH_ADV (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONTROL_RPT_SCAN_ADDR_MATCH_PRIV_MISMATCH_ADV_Pos (6UL) /*!< BLE_BLELL LL_CONTROL: RPT_SCAN_ADDR_MATCH_PRIV_MISMATCH_ADV (Bit 6)*/
#define BLE_BLELL_LL_CONTROL_RPT_SCAN_ADDR_MATCH_PRIV_MISMATCH_ADV_Msk (0x40UL) /*!< BLE_BLELL LL_CONTROL: RPT_SCAN_ADDR_MATCH_PRIV_MISMATCH_ADV (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONTROL_RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_SCN_Pos (7UL) /*!< BLE_BLELL LL_CONTROL: RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_SCN (Bit 7)*/
#define BLE_BLELL_LL_CONTROL_RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_SCN_Msk (0x80UL) /*!< BLE_BLELL LL_CONTROL: RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_SCN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONTROL_RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_INI_Pos (8UL) /*!< BLE_BLELL LL_CONTROL: RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_INI (Bit 8)*/
#define BLE_BLELL_LL_CONTROL_RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_INI_Msk (0x100UL) /*!< BLE_BLELL LL_CONTROL: RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_INI (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONTROL_RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_INI_Pos (9UL) /*!< BLE_BLELL LL_CONTROL: RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_INI (Bit 9)*/
#define BLE_BLELL_LL_CONTROL_RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_INI_Msk (0x200UL) /*!< BLE_BLELL LL_CONTROL: RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_INI (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_ADV_Pos (10UL)            /*!< BLE_BLELL LL_CONTROL: PRIV_1_2_ADV (Bit 10)               */
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_ADV_Msk (0x400UL)         /*!< BLE_BLELL LL_CONTROL: PRIV_1_2_ADV (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_SCAN_Pos (11UL)           /*!< BLE_BLELL LL_CONTROL: PRIV_1_2_SCAN (Bit 11)              */
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_SCAN_Msk (0x800UL)        /*!< BLE_BLELL LL_CONTROL: PRIV_1_2_SCAN (Bitfield-Mask: 0x01) */
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_INIT_Pos (12UL)           /*!< BLE_BLELL LL_CONTROL: PRIV_1_2_INIT (Bit 12)              */
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_INIT_Msk (0x1000UL)       /*!< BLE_BLELL LL_CONTROL: PRIV_1_2_INIT (Bitfield-Mask: 0x01) */
#define BLE_BLELL_LL_CONTROL_EN_CONN_RX_EN_MOD_Pos (13UL)       /*!< BLE_BLELL LL_CONTROL: EN_CONN_RX_EN_MOD (Bit 13)          */
#define BLE_BLELL_LL_CONTROL_EN_CONN_RX_EN_MOD_Msk (0x2000UL)   /*!< BLE_BLELL LL_CONTROL: EN_CONN_RX_EN_MOD (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONTROL_SLV_CONN_PEER_RPA_NOT_RSLVD_Pos (14UL) /*!< BLE_BLELL LL_CONTROL: SLV_CONN_PEER_RPA_NOT_RSLVD (Bit 14)*/
#define BLE_BLELL_LL_CONTROL_SLV_CONN_PEER_RPA_NOT_RSLVD_Msk (0x4000UL) /*!< BLE_BLELL LL_CONTROL: SLV_CONN_PEER_RPA_NOT_RSLVD (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_LL_CONTROL_ADVCH_FIFO_FLUSH_Pos (15UL)        /*!< BLE_BLELL LL_CONTROL: ADVCH_FIFO_FLUSH (Bit 15)           */
#define BLE_BLELL_LL_CONTROL_ADVCH_FIFO_FLUSH_Msk (0x8000UL)    /*!< BLE_BLELL LL_CONTROL: ADVCH_FIFO_FLUSH (Bitfield-Mask: 0x01)*/
/* ================================================  BLE_BLELL.DEV_PA_ADDR_L  ================================================ */
#define BLE_BLELL_DEV_PA_ADDR_L_DEV_PA_ADDR_L_Pos (0UL)         /*!< BLE_BLELL DEV_PA_ADDR_L: DEV_PA_ADDR_L (Bit 0)            */
#define BLE_BLELL_DEV_PA_ADDR_L_DEV_PA_ADDR_L_Msk (0xffffUL)    /*!< BLE_BLELL DEV_PA_ADDR_L: DEV_PA_ADDR_L (Bitfield-Mask: 0xffff)*/
/* ================================================  BLE_BLELL.DEV_PA_ADDR_M  ================================================ */
#define BLE_BLELL_DEV_PA_ADDR_M_DEV_PA_ADDR_M_Pos (0UL)         /*!< BLE_BLELL DEV_PA_ADDR_M: DEV_PA_ADDR_M (Bit 0)            */
#define BLE_BLELL_DEV_PA_ADDR_M_DEV_PA_ADDR_M_Msk (0xffffUL)    /*!< BLE_BLELL DEV_PA_ADDR_M: DEV_PA_ADDR_M (Bitfield-Mask: 0xffff)*/
/* ================================================  BLE_BLELL.DEV_PA_ADDR_H  ================================================ */
#define BLE_BLELL_DEV_PA_ADDR_H_DEV_PA_ADDR_H_Pos (0UL)         /*!< BLE_BLELL DEV_PA_ADDR_H: DEV_PA_ADDR_H (Bit 0)            */
#define BLE_BLELL_DEV_PA_ADDR_H_DEV_PA_ADDR_H_Msk (0xffffUL)    /*!< BLE_BLELL DEV_PA_ADDR_H: DEV_PA_ADDR_H (Bitfield-Mask: 0xffff)*/
/* ==============================================  BLE_BLELL.RSLV_LIST_ENABLE  =============================================== */
#define BLE_BLELL_RSLV_LIST_ENABLE_VALID_ENTRY_Pos (0UL)        /*!< BLE_BLELL RSLV_LIST_ENABLE: VALID_ENTRY (Bit 0)           */
#define BLE_BLELL_RSLV_LIST_ENABLE_VALID_ENTRY_Msk (0x1UL)      /*!< BLE_BLELL RSLV_LIST_ENABLE: VALID_ENTRY (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_PEER_ADDR_IRK_SET_Pos (1UL)  /*!< BLE_BLELL RSLV_LIST_ENABLE: PEER_ADDR_IRK_SET (Bit 1)     */
#define BLE_BLELL_RSLV_LIST_ENABLE_PEER_ADDR_IRK_SET_Msk (0x2UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: PEER_ADDR_IRK_SET (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_SELF_ADDR_IRK_SET_RX_Pos (2UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: SELF_ADDR_IRK_SET_RX (Bit 2)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_SELF_ADDR_IRK_SET_RX_Msk (0x4UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: SELF_ADDR_IRK_SET_RX (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_WHITELISTED_PEER_Pos (3UL)   /*!< BLE_BLELL RSLV_LIST_ENABLE: WHITELISTED_PEER (Bit 3)      */
#define BLE_BLELL_RSLV_LIST_ENABLE_WHITELISTED_PEER_Msk (0x8UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: WHITELISTED_PEER (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_PEER_ADDR_TYPE_Pos (4UL)     /*!< BLE_BLELL RSLV_LIST_ENABLE: PEER_ADDR_TYPE (Bit 4)        */
#define BLE_BLELL_RSLV_LIST_ENABLE_PEER_ADDR_TYPE_Msk (0x10UL)  /*!< BLE_BLELL RSLV_LIST_ENABLE: PEER_ADDR_TYPE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_PEER_ADDR_RPA_VAL_Pos (5UL)  /*!< BLE_BLELL RSLV_LIST_ENABLE: PEER_ADDR_RPA_VAL (Bit 5)     */
#define BLE_BLELL_RSLV_LIST_ENABLE_PEER_ADDR_RPA_VAL_Msk (0x20UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: PEER_ADDR_RPA_VAL (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_SELF_ADDR_RXD_RPA_VAL_Pos (6UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: SELF_ADDR_RXD_RPA_VAL (Bit 6)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_SELF_ADDR_RXD_RPA_VAL_Msk (0x40UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: SELF_ADDR_RXD_RPA_VAL (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_SELF_ADDR_TX_RPA_VAL_Pos (7UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: SELF_ADDR_TX_RPA_VAL (Bit 7)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_SELF_ADDR_TX_RPA_VAL_Msk (0x80UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: SELF_ADDR_TX_RPA_VAL (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_SELF_ADDR_INIT_RPA_SEL_Pos (8UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: SELF_ADDR_INIT_RPA_SEL (Bit 8)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_SELF_ADDR_INIT_RPA_SEL_Msk (0x100UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: SELF_ADDR_INIT_RPA_SEL (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_SELF_ADDR_TYPE_TX_Pos (9UL)  /*!< BLE_BLELL RSLV_LIST_ENABLE: SELF_ADDR_TYPE_TX (Bit 9)     */
#define BLE_BLELL_RSLV_LIST_ENABLE_SELF_ADDR_TYPE_TX_Msk (0x200UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: SELF_ADDR_TYPE_TX (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_RSLV_LIST_ENABLE_ENTRY_CONNECTED_Pos (10UL)   /*!< BLE_BLELL RSLV_LIST_ENABLE: ENTRY_CONNECTED (Bit 10)      */
#define BLE_BLELL_RSLV_LIST_ENABLE_ENTRY_CONNECTED_Msk (0x400UL) /*!< BLE_BLELL RSLV_LIST_ENABLE: ENTRY_CONNECTED (Bitfield-Mask: 0x01)*/
/* ============================================  BLE_BLELL.WL_CONNECTION_STATUS  ============================================= */
#define BLE_BLELL_WL_CONNECTION_STATUS_WL_ENTRY_CONNECTED_Pos (0UL) /*!< BLE_BLELL WL_CONNECTION_STATUS: WL_ENTRY_CONNECTED (Bit 0)*/
#define BLE_BLELL_WL_CONNECTION_STATUS_WL_ENTRY_CONNECTED_Msk (0xffffUL) /*!< BLE_BLELL WL_CONNECTION_STATUS: WL_ENTRY_CONNECTED (Bitfield-Mask: 0xffff)*/
/* ==========================================  BLE_BLELL.CONN_RXMEM_BASE_ADDR_DLE  =========================================== */
#define BLE_BLELL_CONN_RXMEM_BASE_ADDR_DLE_CONN_RX_MEM_BASE_ADDR_DLE_Pos (0UL) /*!< BLE_BLELL CONN_RXMEM_BASE_ADDR_DLE: CONN_RX_MEM_BASE_ADDR_DLE (Bit 0)*/
#define BLE_BLELL_CONN_RXMEM_BASE_ADDR_DLE_CONN_RX_MEM_BASE_ADDR_DLE_Msk (0xffffffffUL) /*!< BLE_BLELL CONN_RXMEM_BASE_ADDR_DLE: CONN_RX_MEM_BASE_ADDR_DLE (Bitfield-Mask: 0xffffffff)*/
/* ==========================================  BLE_BLELL.CONN_TXMEM_BASE_ADDR_DLE  =========================================== */
#define BLE_BLELL_CONN_TXMEM_BASE_ADDR_DLE_CONN_TX_MEM_BASE_ADDR_DLE_Pos (0UL) /*!< BLE_BLELL CONN_TXMEM_BASE_ADDR_DLE: CONN_TX_MEM_BASE_ADDR_DLE (Bit 0)*/
#define BLE_BLELL_CONN_TXMEM_BASE_ADDR_DLE_CONN_TX_MEM_BASE_ADDR_DLE_Msk (0xffffffffUL) /*!< BLE_BLELL CONN_TXMEM_BASE_ADDR_DLE: CONN_TX_MEM_BASE_ADDR_DLE (Bitfield-Mask: 0xffffffff)*/
/* =========================================  BLE_BLELL.CONN_1_PARAM_MEM_BASE_ADDR  ========================================== */
