ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
#define BLE_BLELL_CONN_1_PARAM_MEM_BASE_ADDR_CONN_1_PARAM_Pos (0UL) /*!< BLE_BLELL CONN_1_PARAM_MEM_BASE_ADDR: CONN_1_PARAM (Bit 0)*/
#define BLE_BLELL_CONN_1_PARAM_MEM_BASE_ADDR_CONN_1_PARAM_Msk (0xffffUL) /*!< BLE_BLELL CONN_1_PARAM_MEM_BASE_ADDR: CONN_1_PARAM (Bitfield-Mask: 0xffff)*/
/* =========================================  BLE_BLELL.CONN_2_PARAM_MEM_BASE_ADDR  ========================================== */
#define BLE_BLELL_CONN_2_PARAM_MEM_BASE_ADDR_CONN_2_PARAM_Pos (0UL) /*!< BLE_BLELL CONN_2_PARAM_MEM_BASE_ADDR: CONN_2_PARAM (Bit 0)*/
#define BLE_BLELL_CONN_2_PARAM_MEM_BASE_ADDR_CONN_2_PARAM_Msk (0xffffUL) /*!< BLE_BLELL CONN_2_PARAM_MEM_BASE_ADDR: CONN_2_PARAM (Bitfield-Mask: 0xffff)*/
/* =========================================  BLE_BLELL.CONN_3_PARAM_MEM_BASE_ADDR  ========================================== */
#define BLE_BLELL_CONN_3_PARAM_MEM_BASE_ADDR_CONN_3_PARAM_Pos (0UL) /*!< BLE_BLELL CONN_3_PARAM_MEM_BASE_ADDR: CONN_3_PARAM (Bit 0)*/
#define BLE_BLELL_CONN_3_PARAM_MEM_BASE_ADDR_CONN_3_PARAM_Msk (0xffffUL) /*!< BLE_BLELL CONN_3_PARAM_MEM_BASE_ADDR: CONN_3_PARAM (Bitfield-Mask: 0xffff)*/
/* =========================================  BLE_BLELL.CONN_4_PARAM_MEM_BASE_ADDR  ========================================== */
#define BLE_BLELL_CONN_4_PARAM_MEM_BASE_ADDR_CONN_4_PARAM_Pos (0UL) /*!< BLE_BLELL CONN_4_PARAM_MEM_BASE_ADDR: CONN_4_PARAM (Bit 0)*/
#define BLE_BLELL_CONN_4_PARAM_MEM_BASE_ADDR_CONN_4_PARAM_Msk (0xffffUL) /*!< BLE_BLELL CONN_4_PARAM_MEM_BASE_ADDR: CONN_4_PARAM (Bitfield-Mask: 0xffff)*/
/* ==================================================  BLE_BLELL.NI_TIMER  =================================================== */
#define BLE_BLELL_NI_TIMER_NI_TIMER_Pos   (0UL)                 /*!< BLE_BLELL NI_TIMER: NI_TIMER (Bit 0)                      */
#define BLE_BLELL_NI_TIMER_NI_TIMER_Msk   (0xffffUL)            /*!< BLE_BLELL NI_TIMER: NI_TIMER (Bitfield-Mask: 0xffff)      */
/* ==================================================  BLE_BLELL.US_OFFSET  ================================================== */
#define BLE_BLELL_US_OFFSET_US_OFFSET_SLOT_BOUNDARY_Pos (0UL)   /*!< BLE_BLELL US_OFFSET: US_OFFSET_SLOT_BOUNDARY (Bit 0)      */
#define BLE_BLELL_US_OFFSET_US_OFFSET_SLOT_BOUNDARY_Msk (0x3ffUL) /*!< BLE_BLELL US_OFFSET: US_OFFSET_SLOT_BOUNDARY (Bitfield-Mask: 0x3ff)*/
/* ==================================================  BLE_BLELL.NEXT_CONN  ================================================== */
#define BLE_BLELL_NEXT_CONN_NEXT_CONN_INDEX_Pos (0UL)           /*!< BLE_BLELL NEXT_CONN: NEXT_CONN_INDEX (Bit 0)              */
#define BLE_BLELL_NEXT_CONN_NEXT_CONN_INDEX_Msk (0x1fUL)        /*!< BLE_BLELL NEXT_CONN: NEXT_CONN_INDEX (Bitfield-Mask: 0x1f)*/
#define BLE_BLELL_NEXT_CONN_NEXT_CONN_TYPE_Pos (5UL)            /*!< BLE_BLELL NEXT_CONN: NEXT_CONN_TYPE (Bit 5)               */
#define BLE_BLELL_NEXT_CONN_NEXT_CONN_TYPE_Msk (0x20UL)         /*!< BLE_BLELL NEXT_CONN: NEXT_CONN_TYPE (Bitfield-Mask: 0x01) */
#define BLE_BLELL_NEXT_CONN_NI_VALID_Pos  (6UL)                 /*!< BLE_BLELL NEXT_CONN: NI_VALID (Bit 6)                     */
#define BLE_BLELL_NEXT_CONN_NI_VALID_Msk  (0x40UL)              /*!< BLE_BLELL NEXT_CONN: NI_VALID (Bitfield-Mask: 0x01)       */
/* ==================================================  BLE_BLELL.NI_ABORT  =================================================== */
#define BLE_BLELL_NI_ABORT_NI_ABORT_Pos   (0UL)                 /*!< BLE_BLELL NI_ABORT: NI_ABORT (Bit 0)                      */
#define BLE_BLELL_NI_ABORT_NI_ABORT_Msk   (0x1UL)               /*!< BLE_BLELL NI_ABORT: NI_ABORT (Bitfield-Mask: 0x01)        */
#define BLE_BLELL_NI_ABORT_ABORT_ACK_Pos  (1UL)                 /*!< BLE_BLELL NI_ABORT: ABORT_ACK (Bit 1)                     */
#define BLE_BLELL_NI_ABORT_ABORT_ACK_Msk  (0x2UL)               /*!< BLE_BLELL NI_ABORT: ABORT_ACK (Bitfield-Mask: 0x01)       */
/* ===============================================  BLE_BLELL.CONN_NI_STATUS  ================================================ */
#define BLE_BLELL_CONN_NI_STATUS_CONN_NI_Pos (0UL)              /*!< BLE_BLELL CONN_NI_STATUS: CONN_NI (Bit 0)                 */
#define BLE_BLELL_CONN_NI_STATUS_CONN_NI_Msk (0xffffUL)         /*!< BLE_BLELL CONN_NI_STATUS: CONN_NI (Bitfield-Mask: 0xffff) */
/* =============================================  BLE_BLELL.NEXT_SUP_TO_STATUS  ============================================== */
#define BLE_BLELL_NEXT_SUP_TO_STATUS_NEXT_SUP_TO_Pos (0UL)      /*!< BLE_BLELL NEXT_SUP_TO_STATUS: NEXT_SUP_TO (Bit 0)         */
#define BLE_BLELL_NEXT_SUP_TO_STATUS_NEXT_SUP_TO_Msk (0xffffUL) /*!< BLE_BLELL NEXT_SUP_TO_STATUS: NEXT_SUP_TO (Bitfield-Mask: 0xffff)*/
/* ==============================================  BLE_BLELL.MMMS_CONN_STATUS  =============================================== */
#define BLE_BLELL_MMMS_CONN_STATUS_CURR_CONN_INDEX_Pos (0UL)    /*!< BLE_BLELL MMMS_CONN_STATUS: CURR_CONN_INDEX (Bit 0)       */
#define BLE_BLELL_MMMS_CONN_STATUS_CURR_CONN_INDEX_Msk (0x1fUL) /*!< BLE_BLELL MMMS_CONN_STATUS: CURR_CONN_INDEX (Bitfield-Mask: 0x1f)*/
#define BLE_BLELL_MMMS_CONN_STATUS_CURR_CONN_TYPE_Pos (5UL)     /*!< BLE_BLELL MMMS_CONN_STATUS: CURR_CONN_TYPE (Bit 5)        */
#define BLE_BLELL_MMMS_CONN_STATUS_CURR_CONN_TYPE_Msk (0x20UL)  /*!< BLE_BLELL MMMS_CONN_STATUS: CURR_CONN_TYPE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_CONN_STATUS_SN_CURR_Pos (6UL)            /*!< BLE_BLELL MMMS_CONN_STATUS: SN_CURR (Bit 6)               */
#define BLE_BLELL_MMMS_CONN_STATUS_SN_CURR_Msk (0x40UL)         /*!< BLE_BLELL MMMS_CONN_STATUS: SN_CURR (Bitfield-Mask: 0x01) */
#define BLE_BLELL_MMMS_CONN_STATUS_NESN_CURR_Pos (7UL)          /*!< BLE_BLELL MMMS_CONN_STATUS: NESN_CURR (Bit 7)             */
#define BLE_BLELL_MMMS_CONN_STATUS_NESN_CURR_Msk (0x80UL)       /*!< BLE_BLELL MMMS_CONN_STATUS: NESN_CURR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_CONN_STATUS_LAST_UNMAPPED_CHANNEL_Pos (8UL) /*!< BLE_BLELL MMMS_CONN_STATUS: LAST_UNMAPPED_CHANNEL (Bit 8)*/
#define BLE_BLELL_MMMS_CONN_STATUS_LAST_UNMAPPED_CHANNEL_Msk (0x3f00UL) /*!< BLE_BLELL MMMS_CONN_STATUS: LAST_UNMAPPED_CHANNEL (Bitfield-Mask: 0x3f)*/
#define BLE_BLELL_MMMS_CONN_STATUS_PKT_MISS_Pos (14UL)          /*!< BLE_BLELL MMMS_CONN_STATUS: PKT_MISS (Bit 14)             */
#define BLE_BLELL_MMMS_CONN_STATUS_PKT_MISS_Msk (0x4000UL)      /*!< BLE_BLELL MMMS_CONN_STATUS: PKT_MISS (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_CONN_STATUS_ANCHOR_PT_STATE_Pos (15UL)   /*!< BLE_BLELL MMMS_CONN_STATUS: ANCHOR_PT_STATE (Bit 15)      */
#define BLE_BLELL_MMMS_CONN_STATUS_ANCHOR_PT_STATE_Msk (0x8000UL) /*!< BLE_BLELL MMMS_CONN_STATUS: ANCHOR_PT_STATE (Bitfield-Mask: 0x01)*/
/* =============================================  BLE_BLELL.BT_SLOT_CAPT_STATUS  ============================================= */
#define BLE_BLELL_BT_SLOT_CAPT_STATUS_BT_SLOT_Pos (0UL)         /*!< BLE_BLELL BT_SLOT_CAPT_STATUS: BT_SLOT (Bit 0)            */
#define BLE_BLELL_BT_SLOT_CAPT_STATUS_BT_SLOT_Msk (0xffffUL)    /*!< BLE_BLELL BT_SLOT_CAPT_STATUS: BT_SLOT (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLELL.US_CAPT_STATUS  ================================================ */
#define BLE_BLELL_US_CAPT_STATUS_US_CAPT_Pos (0UL)              /*!< BLE_BLELL US_CAPT_STATUS: US_CAPT (Bit 0)                 */
#define BLE_BLELL_US_CAPT_STATUS_US_CAPT_Msk (0x3ffUL)          /*!< BLE_BLELL US_CAPT_STATUS: US_CAPT (Bitfield-Mask: 0x3ff)  */
/* ==============================================  BLE_BLELL.US_OFFSET_STATUS  =============================================== */
#define BLE_BLELL_US_OFFSET_STATUS_US_OFFSET_Pos (0UL)          /*!< BLE_BLELL US_OFFSET_STATUS: US_OFFSET (Bit 0)             */
#define BLE_BLELL_US_OFFSET_STATUS_US_OFFSET_Msk (0xffffUL)     /*!< BLE_BLELL US_OFFSET_STATUS: US_OFFSET (Bitfield-Mask: 0xffff)*/
/* ==========================================  BLE_BLELL.ACCU_WINDOW_WIDEN_STATUS  =========================================== */
#define BLE_BLELL_ACCU_WINDOW_WIDEN_STATUS_ACCU_WINDOW_WIDEN_Pos (0UL) /*!< BLE_BLELL ACCU_WINDOW_WIDEN_STATUS: ACCU_WINDOW_WIDEN (Bit 0)*/
#define BLE_BLELL_ACCU_WINDOW_WIDEN_STATUS_ACCU_WINDOW_WIDEN_Msk (0xffffUL) /*!< BLE_BLELL ACCU_WINDOW_WIDEN_STATUS: ACCU_WINDOW_WIDEN (Bitfield-Mask: 0xffff)*/
/* ==============================================  BLE_BLELL.EARLY_INTR_STATUS  ============================================== */
#define BLE_BLELL_EARLY_INTR_STATUS_CONN_INDEX_FOR_EARLY_INTR_Pos (0UL) /*!< BLE_BLELL EARLY_INTR_STATUS: CONN_INDEX_FOR_EARLY_INTR (Bit 0)*/
#define BLE_BLELL_EARLY_INTR_STATUS_CONN_INDEX_FOR_EARLY_INTR_Msk (0x1fUL) /*!< BLE_BLELL EARLY_INTR_STATUS: CONN_INDEX_FOR_EARLY_INTR (Bitfield-Mask: 0x1f)*/
#define BLE_BLELL_EARLY_INTR_STATUS_CONN_TYPE_FOR_EARLY_INTR_Pos (5UL) /*!< BLE_BLELL EARLY_INTR_STATUS: CONN_TYPE_FOR_EARLY_INTR (Bit 5)*/
#define BLE_BLELL_EARLY_INTR_STATUS_CONN_TYPE_FOR_EARLY_INTR_Msk (0x20UL) /*!< BLE_BLELL EARLY_INTR_STATUS: CONN_TYPE_FOR_EARLY_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_EARLY_INTR_STATUS_US_FOR_EARLY_INTR_Pos (6UL) /*!< BLE_BLELL EARLY_INTR_STATUS: US_FOR_EARLY_INTR (Bit 6)    */
#define BLE_BLELL_EARLY_INTR_STATUS_US_FOR_EARLY_INTR_Msk (0xffc0UL) /*!< BLE_BLELL EARLY_INTR_STATUS: US_FOR_EARLY_INTR (Bitfield-Mask: 0x3ff)*/
/* =================================================  BLE_BLELL.MMMS_CONFIG  ================================================= */
#define BLE_BLELL_MMMS_CONFIG_MMMS_ENABLE_Pos (0UL)             /*!< BLE_BLELL MMMS_CONFIG: MMMS_ENABLE (Bit 0)                */
#define BLE_BLELL_MMMS_CONFIG_MMMS_ENABLE_Msk (0x1UL)           /*!< BLE_BLELL MMMS_CONFIG: MMMS_ENABLE (Bitfield-Mask: 0x01)  */
#define BLE_BLELL_MMMS_CONFIG_DISABLE_CONN_REQ_PARAM_IN_MEM_Pos (1UL) /*!< BLE_BLELL MMMS_CONFIG: DISABLE_CONN_REQ_PARAM_IN_MEM (Bit 1)*/
#define BLE_BLELL_MMMS_CONFIG_DISABLE_CONN_REQ_PARAM_IN_MEM_Msk (0x2UL) /*!< BLE_BLELL MMMS_CONFIG: DISABLE_CONN_REQ_PARAM_IN_MEM (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_CONFIG_DISABLE_CONN_PARAM_MEM_WR_Pos (2UL) /*!< BLE_BLELL MMMS_CONFIG: DISABLE_CONN_PARAM_MEM_WR (Bit 2)*/
#define BLE_BLELL_MMMS_CONFIG_DISABLE_CONN_PARAM_MEM_WR_Msk (0x4UL) /*!< BLE_BLELL MMMS_CONFIG: DISABLE_CONN_PARAM_MEM_WR (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_CONFIG_CONN_PARAM_FROM_REG_Pos (3UL)     /*!< BLE_BLELL MMMS_CONFIG: CONN_PARAM_FROM_REG (Bit 3)        */
#define BLE_BLELL_MMMS_CONFIG_CONN_PARAM_FROM_REG_Msk (0x8UL)   /*!< BLE_BLELL MMMS_CONFIG: CONN_PARAM_FROM_REG (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_CONFIG_ADV_CONN_INDEX_Pos (4UL)          /*!< BLE_BLELL MMMS_CONFIG: ADV_CONN_INDEX (Bit 4)             */
#define BLE_BLELL_MMMS_CONFIG_ADV_CONN_INDEX_Msk (0x1f0UL)      /*!< BLE_BLELL MMMS_CONFIG: ADV_CONN_INDEX (Bitfield-Mask: 0x1f)*/
#define BLE_BLELL_MMMS_CONFIG_CE_LEN_IMMEDIATE_EXPIRE_Pos (9UL) /*!< BLE_BLELL MMMS_CONFIG: CE_LEN_IMMEDIATE_EXPIRE (Bit 9)    */
#define BLE_BLELL_MMMS_CONFIG_CE_LEN_IMMEDIATE_EXPIRE_Msk (0x200UL) /*!< BLE_BLELL MMMS_CONFIG: CE_LEN_IMMEDIATE_EXPIRE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_CONFIG_RESET_RX_FIFO_PTR_Pos (10UL)      /*!< BLE_BLELL MMMS_CONFIG: RESET_RX_FIFO_PTR (Bit 10)         */
#define BLE_BLELL_MMMS_CONFIG_RESET_RX_FIFO_PTR_Msk (0x400UL)   /*!< BLE_BLELL MMMS_CONFIG: RESET_RX_FIFO_PTR (Bitfield-Mask: 0x01)*/
/* =================================================  BLE_BLELL.US_COUNTER  ================================================== */
#define BLE_BLELL_US_COUNTER_US_COUNTER_Pos (0UL)               /*!< BLE_BLELL US_COUNTER: US_COUNTER (Bit 0)                  */
#define BLE_BLELL_US_COUNTER_US_COUNTER_Msk (0x3ffUL)           /*!< BLE_BLELL US_COUNTER: US_COUNTER (Bitfield-Mask: 0x3ff)   */
/* ================================================  BLE_BLELL.US_CAPT_PREV  ================================================= */
#define BLE_BLELL_US_CAPT_PREV_US_CAPT_LOAD_Pos (0UL)           /*!< BLE_BLELL US_CAPT_PREV: US_CAPT_LOAD (Bit 0)              */
#define BLE_BLELL_US_CAPT_PREV_US_CAPT_LOAD_Msk (0x3ffUL)       /*!< BLE_BLELL US_CAPT_PREV: US_CAPT_LOAD (Bitfield-Mask: 0x3ff)*/
/* ================================================  BLE_BLELL.EARLY_INTR_NI  ================================================ */
#define BLE_BLELL_EARLY_INTR_NI_EARLY_INTR_NI_Pos (0UL)         /*!< BLE_BLELL EARLY_INTR_NI: EARLY_INTR_NI (Bit 0)            */
#define BLE_BLELL_EARLY_INTR_NI_EARLY_INTR_NI_Msk (0xffffUL)    /*!< BLE_BLELL EARLY_INTR_NI: EARLY_INTR_NI (Bitfield-Mask: 0xffff)*/
/* =========================================  BLE_BLELL.MMMS_MASTER_CREATE_BT_CAPT  ========================================== */
#define BLE_BLELL_MMMS_MASTER_CREATE_BT_CAPT_BT_SLOT_Pos (0UL)  /*!< BLE_BLELL MMMS_MASTER_CREATE_BT_CAPT: BT_SLOT (Bit 0)     */
#define BLE_BLELL_MMMS_MASTER_CREATE_BT_CAPT_BT_SLOT_Msk (0xffffUL) /*!< BLE_BLELL MMMS_MASTER_CREATE_BT_CAPT: BT_SLOT (Bitfield-Mask: 0xffff)*/
/* ==========================================  BLE_BLELL.MMMS_SLAVE_CREATE_BT_CAPT  ========================================== */
#define BLE_BLELL_MMMS_SLAVE_CREATE_BT_CAPT_US_CAPT_Pos (0UL)   /*!< BLE_BLELL MMMS_SLAVE_CREATE_BT_CAPT: US_CAPT (Bit 0)      */
#define BLE_BLELL_MMMS_SLAVE_CREATE_BT_CAPT_US_CAPT_Msk (0x3ffUL) /*!< BLE_BLELL MMMS_SLAVE_CREATE_BT_CAPT: US_CAPT (Bitfield-Mask: 0x3ff)*/
/* ==========================================  BLE_BLELL.MMMS_SLAVE_CREATE_US_CAPT  ========================================== */
#define BLE_BLELL_MMMS_SLAVE_CREATE_US_CAPT_US_OFFSET_SLAVE_CREATED_Pos (0UL) /*!< BLE_BLELL MMMS_SLAVE_CREATE_US_CAPT: US_OFFSET_SLAVE_CREATED (Bit 0)*/
#define BLE_BLELL_MMMS_SLAVE_CREATE_US_CAPT_US_OFFSET_SLAVE_CREATED_Msk (0xffffUL) /*!< BLE_BLELL MMMS_SLAVE_CREATE_US_CAPT: US_OFFSET_SLAVE_CREATED (Bitfield-Mask: 0xffff)*/
/* ==========================================  BLE_BLELL.MMMS_DATA_MEM_DESCRIPTOR  =========================================== */
#define BLE_BLELL_MMMS_DATA_MEM_DESCRIPTOR_LLID_C1_Pos (0UL)    /*!< BLE_BLELL MMMS_DATA_MEM_DESCRIPTOR: LLID_C1 (Bit 0)       */
#define BLE_BLELL_MMMS_DATA_MEM_DESCRIPTOR_LLID_C1_Msk (0x3UL)  /*!< BLE_BLELL MMMS_DATA_MEM_DESCRIPTOR: LLID_C1 (Bitfield-Mask: 0x03)*/
#define BLE_BLELL_MMMS_DATA_MEM_DESCRIPTOR_DATA_LENGTH_C1_Pos (2UL) /*!< BLE_BLELL MMMS_DATA_MEM_DESCRIPTOR: DATA_LENGTH_C1 (Bit 2)*/
#define BLE_BLELL_MMMS_DATA_MEM_DESCRIPTOR_DATA_LENGTH_C1_Msk (0x3fcUL) /*!< BLE_BLELL MMMS_DATA_MEM_DESCRIPTOR: DATA_LENGTH_C1 (Bitfield-Mask: 0xff)*/
/* ============================================  BLE_BLELL.CONN_1_DATA_LIST_SENT  ============================================ */
#define BLE_BLELL_CONN_1_DATA_LIST_SENT_LIST_INDEX__TX_SENT_3_0_C1_Pos (0UL) /*!< BLE_BLELL CONN_1_DATA_LIST_SENT: LIST_INDEX__TX_SENT_3_0_C1 (Bit 0)*/
#define BLE_BLELL_CONN_1_DATA_LIST_SENT_LIST_INDEX__TX_SENT_3_0_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_1_DATA_LIST_SENT: LIST_INDEX__TX_SENT_3_0_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_1_DATA_LIST_SENT_SET_CLEAR_C1_Pos (7UL)  /*!< BLE_BLELL CONN_1_DATA_LIST_SENT: SET_CLEAR_C1 (Bit 7)     */
#define BLE_BLELL_CONN_1_DATA_LIST_SENT_SET_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_1_DATA_LIST_SENT: SET_CLEAR_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_1_DATA_LIST_SENT_BUFFER_NUM_TX_SENT_3_0_C1_Pos (8UL) /*!< BLE_BLELL CONN_1_DATA_LIST_SENT: BUFFER_NUM_TX_SENT_3_0_C1 (Bit 8)*/
#define BLE_BLELL_CONN_1_DATA_LIST_SENT_BUFFER_NUM_TX_SENT_3_0_C1_Msk (0xf00UL) /*!< BLE_BLELL CONN_1_DATA_LIST_SENT: BUFFER_NUM_TX_SENT_3_0_C1 (Bitfield-Mask: 0x0f)*/
/* ============================================  BLE_BLELL.CONN_1_DATA_LIST_ACK  ============================================= */
#define BLE_BLELL_CONN_1_DATA_LIST_ACK_LIST_INDEX__TX_ACK_3_0_C1_Pos (0UL) /*!< BLE_BLELL CONN_1_DATA_LIST_ACK: LIST_INDEX__TX_ACK_3_0_C1 (Bit 0)*/
#define BLE_BLELL_CONN_1_DATA_LIST_ACK_LIST_INDEX__TX_ACK_3_0_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_1_DATA_LIST_ACK: LIST_INDEX__TX_ACK_3_0_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_1_DATA_LIST_ACK_SET_CLEAR_C1_Pos (7UL)   /*!< BLE_BLELL CONN_1_DATA_LIST_ACK: SET_CLEAR_C1 (Bit 7)      */
#define BLE_BLELL_CONN_1_DATA_LIST_ACK_SET_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_1_DATA_LIST_ACK: SET_CLEAR_C1 (Bitfield-Mask: 0x01)*/
/* ===========================================  BLE_BLELL.CONN_1_CE_DATA_LIST_CFG  =========================================== */
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_DATA_LIST_INDEX_LAST_ACK_INDEX_C1_Pos (0UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: DATA_LIST_INDEX_LAST_ACK_INDEX_C1 (Bit 0)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_DATA_LIST_INDEX_LAST_ACK_INDEX_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: DATA_LIST_INDEX_LAST_ACK_INDEX_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_DATA_LIST_HEAD_UP_C1_Pos (4UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: DATA_LIST_HEAD_UP_C1 (Bit 4)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_DATA_LIST_HEAD_UP_C1_Msk (0x10UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: DATA_LIST_HEAD_UP_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_SLV_MD_CONFIG_C1_Pos (5UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: SLV_MD_CONFIG_C1 (Bit 5)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_SLV_MD_CONFIG_C1_Msk (0x20UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: SLV_MD_CONFIG_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_MD_C1_Pos (6UL)       /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: MD_C1 (Bit 6)          */
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_MD_C1_Msk (0x40UL)    /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: MD_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_MD_BIT_CLEAR_C1_Pos (7UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: MD_BIT_CLEAR_C1 (Bit 7)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_MD_BIT_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: MD_BIT_CLEAR_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_PAUSE_DATA_C1_Pos (8UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: PAUSE_DATA_C1 (Bit 8)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_PAUSE_DATA_C1_Msk (0x100UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: PAUSE_DATA_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_KILL_CONN_Pos (9UL)   /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: KILL_CONN (Bit 9)      */
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_KILL_CONN_Msk (0x200UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: KILL_CONN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_KILL_CONN_AFTER_TX_Pos (10UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: KILL_CONN_AFTER_TX (Bit 10)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_KILL_CONN_AFTER_TX_Msk (0x400UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: KILL_CONN_AFTER_TX (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_EMPTYPDU_SENT_Pos (11UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: EMPTYPDU_SENT (Bit 11)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_EMPTYPDU_SENT_Msk (0x800UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: EMPTYPDU_SENT (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_CURRENT_PDU_INDEX_C1_Pos (12UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: CURRENT_PDU_INDEX_C1 (Bit 12)*/
#define BLE_BLELL_CONN_1_CE_DATA_LIST_CFG_CURRENT_PDU_INDEX_C1_Msk (0xf000UL) /*!< BLE_BLELL CONN_1_CE_DATA_LIST_CFG: CURRENT_PDU_INDEX_C1 (Bitfield-Mask: 0x0f)*/
/* ============================================  BLE_BLELL.CONN_2_DATA_LIST_SENT  ============================================ */
#define BLE_BLELL_CONN_2_DATA_LIST_SENT_LIST_INDEX__TX_SENT_3_0_C1_Pos (0UL) /*!< BLE_BLELL CONN_2_DATA_LIST_SENT: LIST_INDEX__TX_SENT_3_0_C1 (Bit 0)*/
#define BLE_BLELL_CONN_2_DATA_LIST_SENT_LIST_INDEX__TX_SENT_3_0_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_2_DATA_LIST_SENT: LIST_INDEX__TX_SENT_3_0_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_2_DATA_LIST_SENT_SET_CLEAR_C1_Pos (7UL)  /*!< BLE_BLELL CONN_2_DATA_LIST_SENT: SET_CLEAR_C1 (Bit 7)     */
#define BLE_BLELL_CONN_2_DATA_LIST_SENT_SET_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_2_DATA_LIST_SENT: SET_CLEAR_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_2_DATA_LIST_SENT_BUFFER_NUM_TX_SENT_3_0_C1_Pos (8UL) /*!< BLE_BLELL CONN_2_DATA_LIST_SENT: BUFFER_NUM_TX_SENT_3_0_C1 (Bit 8)*/
#define BLE_BLELL_CONN_2_DATA_LIST_SENT_BUFFER_NUM_TX_SENT_3_0_C1_Msk (0xf00UL) /*!< BLE_BLELL CONN_2_DATA_LIST_SENT: BUFFER_NUM_TX_SENT_3_0_C1 (Bitfield-Mask: 0x0f)*/
/* ============================================  BLE_BLELL.CONN_2_DATA_LIST_ACK  ============================================= */
#define BLE_BLELL_CONN_2_DATA_LIST_ACK_LIST_INDEX__TX_ACK_3_0_C1_Pos (0UL) /*!< BLE_BLELL CONN_2_DATA_LIST_ACK: LIST_INDEX__TX_ACK_3_0_C1 (Bit 0)*/
#define BLE_BLELL_CONN_2_DATA_LIST_ACK_LIST_INDEX__TX_ACK_3_0_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_2_DATA_LIST_ACK: LIST_INDEX__TX_ACK_3_0_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_2_DATA_LIST_ACK_SET_CLEAR_C1_Pos (7UL)   /*!< BLE_BLELL CONN_2_DATA_LIST_ACK: SET_CLEAR_C1 (Bit 7)      */
#define BLE_BLELL_CONN_2_DATA_LIST_ACK_SET_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_2_DATA_LIST_ACK: SET_CLEAR_C1 (Bitfield-Mask: 0x01)*/
/* ===========================================  BLE_BLELL.CONN_2_CE_DATA_LIST_CFG  =========================================== */
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_DATA_LIST_INDEX_LAST_ACK_INDEX_C1_Pos (0UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: DATA_LIST_INDEX_LAST_ACK_INDEX_C1 (Bit 0)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_DATA_LIST_INDEX_LAST_ACK_INDEX_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: DATA_LIST_INDEX_LAST_ACK_INDEX_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_DATA_LIST_HEAD_UP_C1_Pos (4UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: DATA_LIST_HEAD_UP_C1 (Bit 4)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_DATA_LIST_HEAD_UP_C1_Msk (0x10UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: DATA_LIST_HEAD_UP_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_SLV_MD_CONFIG_C1_Pos (5UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: SLV_MD_CONFIG_C1 (Bit 5)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_SLV_MD_CONFIG_C1_Msk (0x20UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: SLV_MD_CONFIG_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_MD_C1_Pos (6UL)       /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: MD_C1 (Bit 6)          */
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_MD_C1_Msk (0x40UL)    /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: MD_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_MD_BIT_CLEAR_C1_Pos (7UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: MD_BIT_CLEAR_C1 (Bit 7)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_MD_BIT_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: MD_BIT_CLEAR_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_PAUSE_DATA_C1_Pos (8UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: PAUSE_DATA_C1 (Bit 8)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_PAUSE_DATA_C1_Msk (0x100UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: PAUSE_DATA_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_KILL_CONN_Pos (9UL)   /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: KILL_CONN (Bit 9)      */
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_KILL_CONN_Msk (0x200UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: KILL_CONN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_KILL_CONN_AFTER_TX_Pos (10UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: KILL_CONN_AFTER_TX (Bit 10)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_KILL_CONN_AFTER_TX_Msk (0x400UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: KILL_CONN_AFTER_TX (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_EMPTYPDU_SENT_Pos (11UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: EMPTYPDU_SENT (Bit 11)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_EMPTYPDU_SENT_Msk (0x800UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: EMPTYPDU_SENT (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_CURRENT_PDU_INDEX_C1_Pos (12UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: CURRENT_PDU_INDEX_C1 (Bit 12)*/
