ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
#define BLE_BLELL_CONN_2_CE_DATA_LIST_CFG_CURRENT_PDU_INDEX_C1_Msk (0xf000UL) /*!< BLE_BLELL CONN_2_CE_DATA_LIST_CFG: CURRENT_PDU_INDEX_C1 (Bitfield-Mask: 0x0f)*/
/* ============================================  BLE_BLELL.CONN_3_DATA_LIST_SENT  ============================================ */
#define BLE_BLELL_CONN_3_DATA_LIST_SENT_LIST_INDEX__TX_SENT_3_0_C1_Pos (0UL) /*!< BLE_BLELL CONN_3_DATA_LIST_SENT: LIST_INDEX__TX_SENT_3_0_C1 (Bit 0)*/
#define BLE_BLELL_CONN_3_DATA_LIST_SENT_LIST_INDEX__TX_SENT_3_0_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_3_DATA_LIST_SENT: LIST_INDEX__TX_SENT_3_0_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_3_DATA_LIST_SENT_SET_CLEAR_C1_Pos (7UL)  /*!< BLE_BLELL CONN_3_DATA_LIST_SENT: SET_CLEAR_C1 (Bit 7)     */
#define BLE_BLELL_CONN_3_DATA_LIST_SENT_SET_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_3_DATA_LIST_SENT: SET_CLEAR_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_3_DATA_LIST_SENT_BUFFER_NUM_TX_SENT_3_0_C1_Pos (8UL) /*!< BLE_BLELL CONN_3_DATA_LIST_SENT: BUFFER_NUM_TX_SENT_3_0_C1 (Bit 8)*/
#define BLE_BLELL_CONN_3_DATA_LIST_SENT_BUFFER_NUM_TX_SENT_3_0_C1_Msk (0xf00UL) /*!< BLE_BLELL CONN_3_DATA_LIST_SENT: BUFFER_NUM_TX_SENT_3_0_C1 (Bitfield-Mask: 0x0f)*/
/* ============================================  BLE_BLELL.CONN_3_DATA_LIST_ACK  ============================================= */
#define BLE_BLELL_CONN_3_DATA_LIST_ACK_LIST_INDEX__TX_ACK_3_0_C1_Pos (0UL) /*!< BLE_BLELL CONN_3_DATA_LIST_ACK: LIST_INDEX__TX_ACK_3_0_C1 (Bit 0)*/
#define BLE_BLELL_CONN_3_DATA_LIST_ACK_LIST_INDEX__TX_ACK_3_0_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_3_DATA_LIST_ACK: LIST_INDEX__TX_ACK_3_0_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_3_DATA_LIST_ACK_SET_CLEAR_C1_Pos (7UL)   /*!< BLE_BLELL CONN_3_DATA_LIST_ACK: SET_CLEAR_C1 (Bit 7)      */
#define BLE_BLELL_CONN_3_DATA_LIST_ACK_SET_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_3_DATA_LIST_ACK: SET_CLEAR_C1 (Bitfield-Mask: 0x01)*/
/* ===========================================  BLE_BLELL.CONN_3_CE_DATA_LIST_CFG  =========================================== */
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_DATA_LIST_INDEX_LAST_ACK_INDEX_C1_Pos (0UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: DATA_LIST_INDEX_LAST_ACK_INDEX_C1 (Bit 0)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_DATA_LIST_INDEX_LAST_ACK_INDEX_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: DATA_LIST_INDEX_LAST_ACK_INDEX_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_DATA_LIST_HEAD_UP_C1_Pos (4UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: DATA_LIST_HEAD_UP_C1 (Bit 4)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_DATA_LIST_HEAD_UP_C1_Msk (0x10UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: DATA_LIST_HEAD_UP_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_SLV_MD_CONFIG_C1_Pos (5UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: SLV_MD_CONFIG_C1 (Bit 5)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_SLV_MD_CONFIG_C1_Msk (0x20UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: SLV_MD_CONFIG_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_MD_C1_Pos (6UL)       /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: MD_C1 (Bit 6)          */
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_MD_C1_Msk (0x40UL)    /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: MD_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_MD_BIT_CLEAR_C1_Pos (7UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: MD_BIT_CLEAR_C1 (Bit 7)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_MD_BIT_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: MD_BIT_CLEAR_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_PAUSE_DATA_C1_Pos (8UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: PAUSE_DATA_C1 (Bit 8)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_PAUSE_DATA_C1_Msk (0x100UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: PAUSE_DATA_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_KILL_CONN_Pos (9UL)   /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: KILL_CONN (Bit 9)      */
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_KILL_CONN_Msk (0x200UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: KILL_CONN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_KILL_CONN_AFTER_TX_Pos (10UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: KILL_CONN_AFTER_TX (Bit 10)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_KILL_CONN_AFTER_TX_Msk (0x400UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: KILL_CONN_AFTER_TX (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_EMPTYPDU_SENT_Pos (11UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: EMPTYPDU_SENT (Bit 11)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_EMPTYPDU_SENT_Msk (0x800UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: EMPTYPDU_SENT (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_CURRENT_PDU_INDEX_C1_Pos (12UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: CURRENT_PDU_INDEX_C1 (Bit 12)*/
#define BLE_BLELL_CONN_3_CE_DATA_LIST_CFG_CURRENT_PDU_INDEX_C1_Msk (0xf000UL) /*!< BLE_BLELL CONN_3_CE_DATA_LIST_CFG: CURRENT_PDU_INDEX_C1 (Bitfield-Mask: 0x0f)*/
/* ============================================  BLE_BLELL.CONN_4_DATA_LIST_SENT  ============================================ */
#define BLE_BLELL_CONN_4_DATA_LIST_SENT_LIST_INDEX__TX_SENT_3_0_C1_Pos (0UL) /*!< BLE_BLELL CONN_4_DATA_LIST_SENT: LIST_INDEX__TX_SENT_3_0_C1 (Bit 0)*/
#define BLE_BLELL_CONN_4_DATA_LIST_SENT_LIST_INDEX__TX_SENT_3_0_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_4_DATA_LIST_SENT: LIST_INDEX__TX_SENT_3_0_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_4_DATA_LIST_SENT_SET_CLEAR_C1_Pos (7UL)  /*!< BLE_BLELL CONN_4_DATA_LIST_SENT: SET_CLEAR_C1 (Bit 7)     */
#define BLE_BLELL_CONN_4_DATA_LIST_SENT_SET_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_4_DATA_LIST_SENT: SET_CLEAR_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_4_DATA_LIST_SENT_BUFFER_NUM_TX_SENT_3_0_C1_Pos (8UL) /*!< BLE_BLELL CONN_4_DATA_LIST_SENT: BUFFER_NUM_TX_SENT_3_0_C1 (Bit 8)*/
#define BLE_BLELL_CONN_4_DATA_LIST_SENT_BUFFER_NUM_TX_SENT_3_0_C1_Msk (0xf00UL) /*!< BLE_BLELL CONN_4_DATA_LIST_SENT: BUFFER_NUM_TX_SENT_3_0_C1 (Bitfield-Mask: 0x0f)*/
/* ============================================  BLE_BLELL.CONN_4_DATA_LIST_ACK  ============================================= */
#define BLE_BLELL_CONN_4_DATA_LIST_ACK_LIST_INDEX__TX_ACK_3_0_C1_Pos (0UL) /*!< BLE_BLELL CONN_4_DATA_LIST_ACK: LIST_INDEX__TX_ACK_3_0_C1 (Bit 0)*/
#define BLE_BLELL_CONN_4_DATA_LIST_ACK_LIST_INDEX__TX_ACK_3_0_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_4_DATA_LIST_ACK: LIST_INDEX__TX_ACK_3_0_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_4_DATA_LIST_ACK_SET_CLEAR_C1_Pos (7UL)   /*!< BLE_BLELL CONN_4_DATA_LIST_ACK: SET_CLEAR_C1 (Bit 7)      */
#define BLE_BLELL_CONN_4_DATA_LIST_ACK_SET_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_4_DATA_LIST_ACK: SET_CLEAR_C1 (Bitfield-Mask: 0x01)*/
/* ===========================================  BLE_BLELL.CONN_4_CE_DATA_LIST_CFG  =========================================== */
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_DATA_LIST_INDEX_LAST_ACK_INDEX_C1_Pos (0UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: DATA_LIST_INDEX_LAST_ACK_INDEX_C1 (Bit 0)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_DATA_LIST_INDEX_LAST_ACK_INDEX_C1_Msk (0xfUL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: DATA_LIST_INDEX_LAST_ACK_INDEX_C1 (Bitfield-Mask: 0x0f)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_DATA_LIST_HEAD_UP_C1_Pos (4UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: DATA_LIST_HEAD_UP_C1 (Bit 4)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_DATA_LIST_HEAD_UP_C1_Msk (0x10UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: DATA_LIST_HEAD_UP_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_SLV_MD_CONFIG_C1_Pos (5UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: SLV_MD_CONFIG_C1 (Bit 5)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_SLV_MD_CONFIG_C1_Msk (0x20UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: SLV_MD_CONFIG_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_MD_C1_Pos (6UL)       /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: MD_C1 (Bit 6)          */
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_MD_C1_Msk (0x40UL)    /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: MD_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_MD_BIT_CLEAR_C1_Pos (7UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: MD_BIT_CLEAR_C1 (Bit 7)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_MD_BIT_CLEAR_C1_Msk (0x80UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: MD_BIT_CLEAR_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_PAUSE_DATA_C1_Pos (8UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: PAUSE_DATA_C1 (Bit 8)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_PAUSE_DATA_C1_Msk (0x100UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: PAUSE_DATA_C1 (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_KILL_CONN_Pos (9UL)   /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: KILL_CONN (Bit 9)      */
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_KILL_CONN_Msk (0x200UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: KILL_CONN (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_KILL_CONN_AFTER_TX_Pos (10UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: KILL_CONN_AFTER_TX (Bit 10)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_KILL_CONN_AFTER_TX_Msk (0x400UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: KILL_CONN_AFTER_TX (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_EMPTYPDU_SENT_Pos (11UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: EMPTYPDU_SENT (Bit 11)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_EMPTYPDU_SENT_Msk (0x800UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: EMPTYPDU_SENT (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_CURRENT_PDU_INDEX_C1_Pos (12UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: CURRENT_PDU_INDEX_C1 (Bit 12)*/
#define BLE_BLELL_CONN_4_CE_DATA_LIST_CFG_CURRENT_PDU_INDEX_C1_Msk (0xf000UL) /*!< BLE_BLELL CONN_4_CE_DATA_LIST_CFG: CURRENT_PDU_INDEX_C1 (Bitfield-Mask: 0x0f)*/
/* ============================================  BLE_BLELL.MMMS_ADVCH_NI_ENABLE  ============================================= */
#define BLE_BLELL_MMMS_ADVCH_NI_ENABLE_ADV_NI_ENABLE_Pos (0UL)  /*!< BLE_BLELL MMMS_ADVCH_NI_ENABLE: ADV_NI_ENABLE (Bit 0)     */
#define BLE_BLELL_MMMS_ADVCH_NI_ENABLE_ADV_NI_ENABLE_Msk (0x1UL) /*!< BLE_BLELL MMMS_ADVCH_NI_ENABLE: ADV_NI_ENABLE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_ADVCH_NI_ENABLE_SCAN_NI_ENABLE_Pos (1UL) /*!< BLE_BLELL MMMS_ADVCH_NI_ENABLE: SCAN_NI_ENABLE (Bit 1)    */
#define BLE_BLELL_MMMS_ADVCH_NI_ENABLE_SCAN_NI_ENABLE_Msk (0x2UL) /*!< BLE_BLELL MMMS_ADVCH_NI_ENABLE: SCAN_NI_ENABLE (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_ADVCH_NI_ENABLE_INIT_NI_ENABLE_Pos (2UL) /*!< BLE_BLELL MMMS_ADVCH_NI_ENABLE: INIT_NI_ENABLE (Bit 2)    */
#define BLE_BLELL_MMMS_ADVCH_NI_ENABLE_INIT_NI_ENABLE_Msk (0x4UL) /*!< BLE_BLELL MMMS_ADVCH_NI_ENABLE: INIT_NI_ENABLE (Bitfield-Mask: 0x01)*/
/* =============================================  BLE_BLELL.MMMS_ADVCH_NI_VALID  ============================================= */
#define BLE_BLELL_MMMS_ADVCH_NI_VALID_ADV_NI_VALID_Pos (0UL)    /*!< BLE_BLELL MMMS_ADVCH_NI_VALID: ADV_NI_VALID (Bit 0)       */
#define BLE_BLELL_MMMS_ADVCH_NI_VALID_ADV_NI_VALID_Msk (0x1UL)  /*!< BLE_BLELL MMMS_ADVCH_NI_VALID: ADV_NI_VALID (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_ADVCH_NI_VALID_SCAN_NI_VALID_Pos (1UL)   /*!< BLE_BLELL MMMS_ADVCH_NI_VALID: SCAN_NI_VALID (Bit 1)      */
#define BLE_BLELL_MMMS_ADVCH_NI_VALID_SCAN_NI_VALID_Msk (0x2UL) /*!< BLE_BLELL MMMS_ADVCH_NI_VALID: SCAN_NI_VALID (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_ADVCH_NI_VALID_INIT_NI_VALID_Pos (2UL)   /*!< BLE_BLELL MMMS_ADVCH_NI_VALID: INIT_NI_VALID (Bit 2)      */
#define BLE_BLELL_MMMS_ADVCH_NI_VALID_INIT_NI_VALID_Msk (0x4UL) /*!< BLE_BLELL MMMS_ADVCH_NI_VALID: INIT_NI_VALID (Bitfield-Mask: 0x01)*/
/* =============================================  BLE_BLELL.MMMS_ADVCH_NI_ABORT  ============================================= */
#define BLE_BLELL_MMMS_ADVCH_NI_ABORT_ADVCH_NI_ABORT_Pos (0UL)  /*!< BLE_BLELL MMMS_ADVCH_NI_ABORT: ADVCH_NI_ABORT (Bit 0)     */
#define BLE_BLELL_MMMS_ADVCH_NI_ABORT_ADVCH_NI_ABORT_Msk (0x1UL) /*!< BLE_BLELL MMMS_ADVCH_NI_ABORT: ADVCH_NI_ABORT (Bitfield-Mask: 0x01)*/
#define BLE_BLELL_MMMS_ADVCH_NI_ABORT_ADVCH_ABORT_STATUS_Pos (1UL) /*!< BLE_BLELL MMMS_ADVCH_NI_ABORT: ADVCH_ABORT_STATUS (Bit 1)*/
#define BLE_BLELL_MMMS_ADVCH_NI_ABORT_ADVCH_ABORT_STATUS_Msk (0x2UL) /*!< BLE_BLELL MMMS_ADVCH_NI_ABORT: ADVCH_ABORT_STATUS (Bitfield-Mask: 0x01)*/
/* ===========================================  BLE_BLELL.CONN_PARAM_NEXT_SUP_TO  ============================================ */
#define BLE_BLELL_CONN_PARAM_NEXT_SUP_TO_NEXT_SUP_TO_LOAD_Pos (0UL) /*!< BLE_BLELL CONN_PARAM_NEXT_SUP_TO: NEXT_SUP_TO_LOAD (Bit 0)*/
#define BLE_BLELL_CONN_PARAM_NEXT_SUP_TO_NEXT_SUP_TO_LOAD_Msk (0xffffUL) /*!< BLE_BLELL CONN_PARAM_NEXT_SUP_TO: NEXT_SUP_TO_LOAD (Bitfield-Mask: 0xffff)*/
/* ==========================================  BLE_BLELL.CONN_PARAM_ACC_WIN_WIDEN  =========================================== */
#define BLE_BLELL_CONN_PARAM_ACC_WIN_WIDEN_ACC_WINDOW_WIDEN_Pos (0UL) /*!< BLE_BLELL CONN_PARAM_ACC_WIN_WIDEN: ACC_WINDOW_WIDEN (Bit 0)*/
#define BLE_BLELL_CONN_PARAM_ACC_WIN_WIDEN_ACC_WINDOW_WIDEN_Msk (0x3ffUL) /*!< BLE_BLELL CONN_PARAM_ACC_WIN_WIDEN: ACC_WINDOW_WIDEN (Bitfield-Mask: 0x3ff)*/
/* ===============================================  BLE_BLELL.HW_LOAD_OFFSET  ================================================ */
#define BLE_BLELL_HW_LOAD_OFFSET_LOAD_OFFSET_Pos (0UL)          /*!< BLE_BLELL HW_LOAD_OFFSET: LOAD_OFFSET (Bit 0)             */
#define BLE_BLELL_HW_LOAD_OFFSET_LOAD_OFFSET_Msk (0x1fUL)       /*!< BLE_BLELL HW_LOAD_OFFSET: LOAD_OFFSET (Bitfield-Mask: 0x1f)*/
/* ==================================================  BLE_BLELL.ADV_RAND  =================================================== */
#define BLE_BLELL_ADV_RAND_ADV_RAND_Pos   (0UL)                 /*!< BLE_BLELL ADV_RAND: ADV_RAND (Bit 0)                      */
#define BLE_BLELL_ADV_RAND_ADV_RAND_Msk   (0xfUL)               /*!< BLE_BLELL ADV_RAND: ADV_RAND (Bitfield-Mask: 0x0f)        */
/* ==============================================  BLE_BLELL.MMMS_RX_PKT_CNTR  =============================================== */
#define BLE_BLELL_MMMS_RX_PKT_CNTR_MMMS_RX_PKT_CNT_Pos (0UL)    /*!< BLE_BLELL MMMS_RX_PKT_CNTR: MMMS_RX_PKT_CNT (Bit 0)       */
#define BLE_BLELL_MMMS_RX_PKT_CNTR_MMMS_RX_PKT_CNT_Msk (0x3fUL) /*!< BLE_BLELL MMMS_RX_PKT_CNTR: MMMS_RX_PKT_CNT (Bitfield-Mask: 0x3f)*/
/* ==============================================  BLE_BLELL.CONN_RX_PKT_CNTR  =============================================== */
#define BLE_BLELL_CONN_RX_PKT_CNTR_RX_PKT_CNT_Pos (0UL)         /*!< BLE_BLELL CONN_RX_PKT_CNTR: RX_PKT_CNT (Bit 0)            */
#define BLE_BLELL_CONN_RX_PKT_CNTR_RX_PKT_CNT_Msk (0x3fUL)      /*!< BLE_BLELL CONN_RX_PKT_CNTR: RX_PKT_CNT (Bitfield-Mask: 0x3f)*/
/* =============================================  BLE_BLELL.WHITELIST_BASE_ADDR  ============================================= */
#define BLE_BLELL_WHITELIST_BASE_ADDR_WL_BASE_ADDR_Pos (0UL)    /*!< BLE_BLELL WHITELIST_BASE_ADDR: WL_BASE_ADDR (Bit 0)       */
#define BLE_BLELL_WHITELIST_BASE_ADDR_WL_BASE_ADDR_Msk (0xffffUL) /*!< BLE_BLELL WHITELIST_BASE_ADDR: WL_BASE_ADDR (Bitfield-Mask: 0xffff)*/
/* =======================================  BLE_BLELL.RSLV_LIST_PEER_IDNTT_BASE_ADDR  ======================================== */
#define BLE_BLELL_RSLV_LIST_PEER_IDNTT_BASE_ADDR_RSLV_LIST_PEER_IDNTT_BASE_ADDR_Pos (0UL) /*!< BLE_BLELL RSLV_LIST_PEER_IDNTT_BASE_ADDR: RSLV_LIST_PEER_IDNTT_BASE_ADDR (Bit 0)*/
#define BLE_BLELL_RSLV_LIST_PEER_IDNTT_BASE_ADDR_RSLV_LIST_PEER_IDNTT_BASE_ADDR_Msk (0xffffUL) /*!< BLE_BLELL RSLV_LIST_PEER_IDNTT_BASE_ADDR: RSLV_LIST_PEER_IDNTT_BASE_ADDR (Bitfield-Mask: 0xffff)*/
/* ========================================  BLE_BLELL.RSLV_LIST_PEER_RPA_BASE_ADDR  ========================================= */
#define BLE_BLELL_RSLV_LIST_PEER_RPA_BASE_ADDR_RSLV_LIST_PEER_RPA_BASE_ADDR_Pos (0UL) /*!< BLE_BLELL RSLV_LIST_PEER_RPA_BASE_ADDR: RSLV_LIST_PEER_RPA_BASE_ADDR (Bit 0)*/
#define BLE_BLELL_RSLV_LIST_PEER_RPA_BASE_ADDR_RSLV_LIST_PEER_RPA_BASE_ADDR_Msk (0xffffUL) /*!< BLE_BLELL RSLV_LIST_PEER_RPA_BASE_ADDR: RSLV_LIST_PEER_RPA_BASE_ADDR (Bitfield-Mask: 0xffff)*/
/* ======================================  BLE_BLELL.RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR  ====================================== */
#define BLE_BLELL_RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR_RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR_Pos (0UL) /*!< BLE_BLELL RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR: RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR (Bit 0)*/
#define BLE_BLELL_RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR_RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR_Msk (0xffffUL) /*!< BLE_BLELL RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR: RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR (Bitfield-Mask: 0xffff)*/
/* =======================================  BLE_BLELL.RSLV_LIST_TX_INIT_RPA_BASE_ADDR  ======================================= */
#define BLE_BLELL_RSLV_LIST_TX_INIT_RPA_BASE_ADDR_RSLV_LIST_TX_INIT_RPA_BASE_ADDR_Pos (0UL) /*!< BLE_BLELL RSLV_LIST_TX_INIT_RPA_BASE_ADDR: RSLV_LIST_TX_INIT_RPA_BASE_ADDR (Bit 0)*/
#define BLE_BLELL_RSLV_LIST_TX_INIT_RPA_BASE_ADDR_RSLV_LIST_TX_INIT_RPA_BASE_ADDR_Msk (0xffffUL) /*!< BLE_BLELL RSLV_LIST_TX_INIT_RPA_BASE_ADDR: RSLV_LIST_TX_INIT_RPA_BASE_ADDR (Bitfield-Mask: 0xffff)*/


