ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
/* =================================================  BLE_BLESS.DDFT_CONFIG  ================================================= */
#define BLE_BLESS_DDFT_CONFIG_DDFT_ENABLE_Pos (0UL)             /*!< BLE_BLESS DDFT_CONFIG: DDFT_ENABLE (Bit 0)                */
#define BLE_BLESS_DDFT_CONFIG_DDFT_ENABLE_Msk (0x1UL)           /*!< BLE_BLESS DDFT_CONFIG: DDFT_ENABLE (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_DDFT_CONFIG_BLERD_DDFT_EN_Pos (1UL)           /*!< BLE_BLESS DDFT_CONFIG: BLERD_DDFT_EN (Bit 1)              */
#define BLE_BLESS_DDFT_CONFIG_BLERD_DDFT_EN_Msk (0x2UL)         /*!< BLE_BLESS DDFT_CONFIG: BLERD_DDFT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_DDFT_CONFIG_DDFT_MUX_CFG1_Pos (8UL)           /*!< BLE_BLESS DDFT_CONFIG: DDFT_MUX_CFG1 (Bit 8)              */
#define BLE_BLESS_DDFT_CONFIG_DDFT_MUX_CFG1_Msk (0x1f00UL)      /*!< BLE_BLESS DDFT_CONFIG: DDFT_MUX_CFG1 (Bitfield-Mask: 0x1f)*/
#define BLE_BLESS_DDFT_CONFIG_DDFT_MUX_CFG2_Pos (16UL)          /*!< BLE_BLESS DDFT_CONFIG: DDFT_MUX_CFG2 (Bit 16)             */
#define BLE_BLESS_DDFT_CONFIG_DDFT_MUX_CFG2_Msk (0x1f0000UL)    /*!< BLE_BLESS DDFT_CONFIG: DDFT_MUX_CFG2 (Bitfield-Mask: 0x1f)*/
/* =============================================  BLE_BLESS.XTAL_CLK_DIV_CONFIG  ============================================= */
#define BLE_BLESS_XTAL_CLK_DIV_CONFIG_SYSCLK_DIV_Pos (0UL)      /*!< BLE_BLESS XTAL_CLK_DIV_CONFIG: SYSCLK_DIV (Bit 0)         */
#define BLE_BLESS_XTAL_CLK_DIV_CONFIG_SYSCLK_DIV_Msk (0x3UL)    /*!< BLE_BLESS XTAL_CLK_DIV_CONFIG: SYSCLK_DIV (Bitfield-Mask: 0x03)*/
#define BLE_BLESS_XTAL_CLK_DIV_CONFIG_LLCLK_DIV_Pos (2UL)       /*!< BLE_BLESS XTAL_CLK_DIV_CONFIG: LLCLK_DIV (Bit 2)          */
#define BLE_BLESS_XTAL_CLK_DIV_CONFIG_LLCLK_DIV_Msk (0xcUL)     /*!< BLE_BLESS XTAL_CLK_DIV_CONFIG: LLCLK_DIV (Bitfield-Mask: 0x03)*/
/* ==================================================  BLE_BLESS.INTR_STAT  ================================================== */
#define BLE_BLESS_INTR_STAT_DSM_ENTERED_INTR_Pos (0UL)          /*!< BLE_BLESS INTR_STAT: DSM_ENTERED_INTR (Bit 0)             */
#define BLE_BLESS_INTR_STAT_DSM_ENTERED_INTR_Msk (0x1UL)        /*!< BLE_BLESS INTR_STAT: DSM_ENTERED_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_STAT_DSM_EXITED_INTR_Pos (1UL)           /*!< BLE_BLESS INTR_STAT: DSM_EXITED_INTR (Bit 1)              */
#define BLE_BLESS_INTR_STAT_DSM_EXITED_INTR_Msk (0x2UL)         /*!< BLE_BLESS INTR_STAT: DSM_EXITED_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_STAT_RCBLL_DONE_INTR_Pos (2UL)           /*!< BLE_BLESS INTR_STAT: RCBLL_DONE_INTR (Bit 2)              */
#define BLE_BLESS_INTR_STAT_RCBLL_DONE_INTR_Msk (0x4UL)         /*!< BLE_BLESS INTR_STAT: RCBLL_DONE_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_STAT_BLERD_ACTIVE_INTR_Pos (3UL)         /*!< BLE_BLESS INTR_STAT: BLERD_ACTIVE_INTR (Bit 3)            */
#define BLE_BLESS_INTR_STAT_BLERD_ACTIVE_INTR_Msk (0x8UL)       /*!< BLE_BLESS INTR_STAT: BLERD_ACTIVE_INTR (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_STAT_RCB_INTR_Pos  (4UL)                 /*!< BLE_BLESS INTR_STAT: RCB_INTR (Bit 4)                     */
#define BLE_BLESS_INTR_STAT_RCB_INTR_Msk  (0x10UL)              /*!< BLE_BLESS INTR_STAT: RCB_INTR (Bitfield-Mask: 0x01)       */
#define BLE_BLESS_INTR_STAT_LL_INTR_Pos   (5UL)                 /*!< BLE_BLESS INTR_STAT: LL_INTR (Bit 5)                      */
#define BLE_BLESS_INTR_STAT_LL_INTR_Msk   (0x20UL)              /*!< BLE_BLESS INTR_STAT: LL_INTR (Bitfield-Mask: 0x01)        */
#define BLE_BLESS_INTR_STAT_GPIO_INTR_Pos (6UL)                 /*!< BLE_BLESS INTR_STAT: GPIO_INTR (Bit 6)                    */
#define BLE_BLESS_INTR_STAT_GPIO_INTR_Msk (0x40UL)              /*!< BLE_BLESS INTR_STAT: GPIO_INTR (Bitfield-Mask: 0x01)      */
#define BLE_BLESS_INTR_STAT_EFUSE_INTR_Pos (7UL)                /*!< BLE_BLESS INTR_STAT: EFUSE_INTR (Bit 7)                   */
#define BLE_BLESS_INTR_STAT_EFUSE_INTR_Msk (0x80UL)             /*!< BLE_BLESS INTR_STAT: EFUSE_INTR (Bitfield-Mask: 0x01)     */
#define BLE_BLESS_INTR_STAT_XTAL_ON_INTR_Pos (8UL)              /*!< BLE_BLESS INTR_STAT: XTAL_ON_INTR (Bit 8)                 */
#define BLE_BLESS_INTR_STAT_XTAL_ON_INTR_Msk (0x100UL)          /*!< BLE_BLESS INTR_STAT: XTAL_ON_INTR (Bitfield-Mask: 0x01)   */
#define BLE_BLESS_INTR_STAT_ENC_INTR_Pos  (9UL)                 /*!< BLE_BLESS INTR_STAT: ENC_INTR (Bit 9)                     */
#define BLE_BLESS_INTR_STAT_ENC_INTR_Msk  (0x200UL)             /*!< BLE_BLESS INTR_STAT: ENC_INTR (Bitfield-Mask: 0x01)       */
#define BLE_BLESS_INTR_STAT_HVLDO_LV_DETECT_POS_Pos (10UL)      /*!< BLE_BLESS INTR_STAT: HVLDO_LV_DETECT_POS (Bit 10)         */
#define BLE_BLESS_INTR_STAT_HVLDO_LV_DETECT_POS_Msk (0x400UL)   /*!< BLE_BLESS INTR_STAT: HVLDO_LV_DETECT_POS (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_STAT_HVLDO_LV_DETECT_NEG_Pos (11UL)      /*!< BLE_BLESS INTR_STAT: HVLDO_LV_DETECT_NEG (Bit 11)         */
#define BLE_BLESS_INTR_STAT_HVLDO_LV_DETECT_NEG_Msk (0x800UL)   /*!< BLE_BLESS INTR_STAT: HVLDO_LV_DETECT_NEG (Bitfield-Mask: 0x01)*/
/* ==================================================  BLE_BLESS.INTR_MASK  ================================================== */
#define BLE_BLESS_INTR_MASK_DSM_EXIT_Pos  (0UL)                 /*!< BLE_BLESS INTR_MASK: DSM_EXIT (Bit 0)                     */
#define BLE_BLESS_INTR_MASK_DSM_EXIT_Msk  (0x1UL)               /*!< BLE_BLESS INTR_MASK: DSM_EXIT (Bitfield-Mask: 0x01)       */
#define BLE_BLESS_INTR_MASK_DSM_ENTERED_INTR_MASK_Pos (1UL)     /*!< BLE_BLESS INTR_MASK: DSM_ENTERED_INTR_MASK (Bit 1)        */
#define BLE_BLESS_INTR_MASK_DSM_ENTERED_INTR_MASK_Msk (0x2UL)   /*!< BLE_BLESS INTR_MASK: DSM_ENTERED_INTR_MASK (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_MASK_DSM_EXITED_INTR_MASK_Pos (2UL)      /*!< BLE_BLESS INTR_MASK: DSM_EXITED_INTR_MASK (Bit 2)         */
#define BLE_BLESS_INTR_MASK_DSM_EXITED_INTR_MASK_Msk (0x4UL)    /*!< BLE_BLESS INTR_MASK: DSM_EXITED_INTR_MASK (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_MASK_XTAL_ON_INTR_MASK_Pos (3UL)         /*!< BLE_BLESS INTR_MASK: XTAL_ON_INTR_MASK (Bit 3)            */
#define BLE_BLESS_INTR_MASK_XTAL_ON_INTR_MASK_Msk (0x8UL)       /*!< BLE_BLESS INTR_MASK: XTAL_ON_INTR_MASK (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_MASK_RCBLL_INTR_MASK_Pos (4UL)           /*!< BLE_BLESS INTR_MASK: RCBLL_INTR_MASK (Bit 4)              */
#define BLE_BLESS_INTR_MASK_RCBLL_INTR_MASK_Msk (0x10UL)        /*!< BLE_BLESS INTR_MASK: RCBLL_INTR_MASK (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_MASK_BLERD_ACTIVE_INTR_MASK_Pos (5UL)    /*!< BLE_BLESS INTR_MASK: BLERD_ACTIVE_INTR_MASK (Bit 5)       */
#define BLE_BLESS_INTR_MASK_BLERD_ACTIVE_INTR_MASK_Msk (0x20UL) /*!< BLE_BLESS INTR_MASK: BLERD_ACTIVE_INTR_MASK (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_MASK_RCB_INTR_MASK_Pos (6UL)             /*!< BLE_BLESS INTR_MASK: RCB_INTR_MASK (Bit 6)                */
#define BLE_BLESS_INTR_MASK_RCB_INTR_MASK_Msk (0x40UL)          /*!< BLE_BLESS INTR_MASK: RCB_INTR_MASK (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_INTR_MASK_LL_INTR_MASK_Pos (7UL)              /*!< BLE_BLESS INTR_MASK: LL_INTR_MASK (Bit 7)                 */
#define BLE_BLESS_INTR_MASK_LL_INTR_MASK_Msk (0x80UL)           /*!< BLE_BLESS INTR_MASK: LL_INTR_MASK (Bitfield-Mask: 0x01)   */
#define BLE_BLESS_INTR_MASK_GPIO_INTR_MASK_Pos (8UL)            /*!< BLE_BLESS INTR_MASK: GPIO_INTR_MASK (Bit 8)               */
#define BLE_BLESS_INTR_MASK_GPIO_INTR_MASK_Msk (0x100UL)        /*!< BLE_BLESS INTR_MASK: GPIO_INTR_MASK (Bitfield-Mask: 0x01) */
#define BLE_BLESS_INTR_MASK_EFUSE_INTR_MASK_Pos (9UL)           /*!< BLE_BLESS INTR_MASK: EFUSE_INTR_MASK (Bit 9)              */
#define BLE_BLESS_INTR_MASK_EFUSE_INTR_MASK_Msk (0x200UL)       /*!< BLE_BLESS INTR_MASK: EFUSE_INTR_MASK (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_MASK_ENC_INTR_MASK_Pos (10UL)            /*!< BLE_BLESS INTR_MASK: ENC_INTR_MASK (Bit 10)               */
#define BLE_BLESS_INTR_MASK_ENC_INTR_MASK_Msk (0x400UL)         /*!< BLE_BLESS INTR_MASK: ENC_INTR_MASK (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_INTR_MASK_HVLDO_LV_DETECT_POS_MASK_Pos (11UL) /*!< BLE_BLESS INTR_MASK: HVLDO_LV_DETECT_POS_MASK (Bit 11)    */
#define BLE_BLESS_INTR_MASK_HVLDO_LV_DETECT_POS_MASK_Msk (0x800UL) /*!< BLE_BLESS INTR_MASK: HVLDO_LV_DETECT_POS_MASK (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_INTR_MASK_HVLDO_LV_DETECT_NEG_MASK_Pos (12UL) /*!< BLE_BLESS INTR_MASK: HVLDO_LV_DETECT_NEG_MASK (Bit 12)    */
#define BLE_BLESS_INTR_MASK_HVLDO_LV_DETECT_NEG_MASK_Msk (0x1000UL) /*!< BLE_BLESS INTR_MASK: HVLDO_LV_DETECT_NEG_MASK (Bitfield-Mask: 0x01)*/
/* ==================================================  BLE_BLESS.LL_CLK_EN  ================================================== */
#define BLE_BLESS_LL_CLK_EN_CLK_EN_Pos    (0UL)                 /*!< BLE_BLESS LL_CLK_EN: CLK_EN (Bit 0)                       */
#define BLE_BLESS_LL_CLK_EN_CLK_EN_Msk    (0x1UL)               /*!< BLE_BLESS LL_CLK_EN: CLK_EN (Bitfield-Mask: 0x01)         */
#define BLE_BLESS_LL_CLK_EN_CY_CORREL_EN_Pos (1UL)              /*!< BLE_BLESS LL_CLK_EN: CY_CORREL_EN (Bit 1)                 */
#define BLE_BLESS_LL_CLK_EN_CY_CORREL_EN_Msk (0x2UL)            /*!< BLE_BLESS LL_CLK_EN: CY_CORREL_EN (Bitfield-Mask: 0x01)   */
#define BLE_BLESS_LL_CLK_EN_MXD_IF_OPTION_Pos (2UL)             /*!< BLE_BLESS LL_CLK_EN: MXD_IF_OPTION (Bit 2)                */
#define BLE_BLESS_LL_CLK_EN_MXD_IF_OPTION_Msk (0x4UL)           /*!< BLE_BLESS LL_CLK_EN: MXD_IF_OPTION (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_LL_CLK_EN_SEL_RCB_CLK_Pos (3UL)               /*!< BLE_BLESS LL_CLK_EN: SEL_RCB_CLK (Bit 3)                  */
#define BLE_BLESS_LL_CLK_EN_SEL_RCB_CLK_Msk (0x8UL)             /*!< BLE_BLESS LL_CLK_EN: SEL_RCB_CLK (Bitfield-Mask: 0x01)    */
#define BLE_BLESS_LL_CLK_EN_BLESS_RESET_Pos (4UL)               /*!< BLE_BLESS LL_CLK_EN: BLESS_RESET (Bit 4)                  */
#define BLE_BLESS_LL_CLK_EN_BLESS_RESET_Msk (0x10UL)            /*!< BLE_BLESS LL_CLK_EN: BLESS_RESET (Bitfield-Mask: 0x01)    */
#define BLE_BLESS_LL_CLK_EN_DPSLP_HWRCB_EN_Pos (5UL)            /*!< BLE_BLESS LL_CLK_EN: DPSLP_HWRCB_EN (Bit 5)               */
#define BLE_BLESS_LL_CLK_EN_DPSLP_HWRCB_EN_Msk (0x20UL)         /*!< BLE_BLESS LL_CLK_EN: DPSLP_HWRCB_EN (Bitfield-Mask: 0x01) */
/* =================================================  BLE_BLESS.LF_CLK_CTRL  ================================================= */
#define BLE_BLESS_LF_CLK_CTRL_DISABLE_LF_CLK_Pos (0UL)          /*!< BLE_BLESS LF_CLK_CTRL: DISABLE_LF_CLK (Bit 0)             */
#define BLE_BLESS_LF_CLK_CTRL_DISABLE_LF_CLK_Msk (0x1UL)        /*!< BLE_BLESS LF_CLK_CTRL: DISABLE_LF_CLK (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_LF_CLK_CTRL_ENABLE_ENC_CLK_Pos (1UL)          /*!< BLE_BLESS LF_CLK_CTRL: ENABLE_ENC_CLK (Bit 1)             */
#define BLE_BLESS_LF_CLK_CTRL_ENABLE_ENC_CLK_Msk (0x2UL)        /*!< BLE_BLESS LF_CLK_CTRL: ENABLE_ENC_CLK (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_LF_CLK_CTRL_M0S8BLESS_REV_ID_Pos (29UL)       /*!< BLE_BLESS LF_CLK_CTRL: M0S8BLESS_REV_ID (Bit 29)          */
#define BLE_BLESS_LF_CLK_CTRL_M0S8BLESS_REV_ID_Msk (0xe0000000UL) /*!< BLE_BLESS LF_CLK_CTRL: M0S8BLESS_REV_ID (Bitfield-Mask: 0x07)*/
/* ===============================================  BLE_BLESS.EXT_PA_LNA_CTRL  =============================================== */
#define BLE_BLESS_EXT_PA_LNA_CTRL_ENABLE_EXT_PA_LNA_Pos (1UL)   /*!< BLE_BLESS EXT_PA_LNA_CTRL: ENABLE_EXT_PA_LNA (Bit 1)      */
#define BLE_BLESS_EXT_PA_LNA_CTRL_ENABLE_EXT_PA_LNA_Msk (0x2UL) /*!< BLE_BLESS EXT_PA_LNA_CTRL: ENABLE_EXT_PA_LNA (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_EXT_PA_LNA_CTRL_CHIP_EN_POL_Pos (2UL)         /*!< BLE_BLESS EXT_PA_LNA_CTRL: CHIP_EN_POL (Bit 2)            */
#define BLE_BLESS_EXT_PA_LNA_CTRL_CHIP_EN_POL_Msk (0x4UL)       /*!< BLE_BLESS EXT_PA_LNA_CTRL: CHIP_EN_POL (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_EXT_PA_LNA_CTRL_PA_CTRL_POL_Pos (3UL)         /*!< BLE_BLESS EXT_PA_LNA_CTRL: PA_CTRL_POL (Bit 3)            */
#define BLE_BLESS_EXT_PA_LNA_CTRL_PA_CTRL_POL_Msk (0x8UL)       /*!< BLE_BLESS EXT_PA_LNA_CTRL: PA_CTRL_POL (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_EXT_PA_LNA_CTRL_LNA_CTRL_POL_Pos (4UL)        /*!< BLE_BLESS EXT_PA_LNA_CTRL: LNA_CTRL_POL (Bit 4)           */
#define BLE_BLESS_EXT_PA_LNA_CTRL_LNA_CTRL_POL_Msk (0x10UL)     /*!< BLE_BLESS EXT_PA_LNA_CTRL: LNA_CTRL_POL (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_EXT_PA_LNA_CTRL_OUT_EN_DRIVE_VAL_Pos (5UL)    /*!< BLE_BLESS EXT_PA_LNA_CTRL: OUT_EN_DRIVE_VAL (Bit 5)       */
#define BLE_BLESS_EXT_PA_LNA_CTRL_OUT_EN_DRIVE_VAL_Msk (0x20UL) /*!< BLE_BLESS EXT_PA_LNA_CTRL: OUT_EN_DRIVE_VAL (Bitfield-Mask: 0x01)*/
/* ============================================  BLE_BLESS.LL_PKT_RSSI_CH_ENERGY  ============================================ */
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_RSSI_Pos (0UL)          /*!< BLE_BLESS LL_PKT_RSSI_CH_ENERGY: RSSI (Bit 0)             */
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_RSSI_Msk (0xffffUL)     /*!< BLE_BLESS LL_PKT_RSSI_CH_ENERGY: RSSI (Bitfield-Mask: 0xffff)*/
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_RX_CHANNEL_Pos (16UL)   /*!< BLE_BLESS LL_PKT_RSSI_CH_ENERGY: RX_CHANNEL (Bit 16)      */
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_RX_CHANNEL_Msk (0x3f0000UL) /*!< BLE_BLESS LL_PKT_RSSI_CH_ENERGY: RX_CHANNEL (Bitfield-Mask: 0x3f)*/
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_PKT_RSSI_OR_CH_ENERGY_Pos (22UL) /*!< BLE_BLESS LL_PKT_RSSI_CH_ENERGY: PKT_RSSI_OR_CH_ENERGY (Bit 22)*/
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_PKT_RSSI_OR_CH_ENERGY_Msk (0x400000UL) /*!< BLE_BLESS LL_PKT_RSSI_CH_ENERGY: PKT_RSSI_OR_CH_ENERGY (Bitfield-Mask: 0x01)*/
/* ===================================================  BLE_BLESS.MT_CFG  ==================================================== */
#define BLE_BLESS_MT_CFG_ENABLE_BLERD_Pos (0UL)                 /*!< BLE_BLESS MT_CFG: ENABLE_BLERD (Bit 0)                    */
#define BLE_BLESS_MT_CFG_ENABLE_BLERD_Msk (0x1UL)               /*!< BLE_BLESS MT_CFG: ENABLE_BLERD (Bitfield-Mask: 0x01)      */
#define BLE_BLESS_MT_CFG_DEEPSLEEP_EXIT_CFG_Pos (1UL)           /*!< BLE_BLESS MT_CFG: DEEPSLEEP_EXIT_CFG (Bit 1)              */
#define BLE_BLESS_MT_CFG_DEEPSLEEP_EXIT_CFG_Msk (0x2UL)         /*!< BLE_BLESS MT_CFG: DEEPSLEEP_EXIT_CFG (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MT_CFG_DEEPSLEEP_EXITED_Pos (2UL)             /*!< BLE_BLESS MT_CFG: DEEPSLEEP_EXITED (Bit 2)                */
#define BLE_BLESS_MT_CFG_DEEPSLEEP_EXITED_Msk (0x4UL)           /*!< BLE_BLESS MT_CFG: DEEPSLEEP_EXITED (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_MT_CFG_ACT_LDO_NOT_BUCK_Pos (3UL)             /*!< BLE_BLESS MT_CFG: ACT_LDO_NOT_BUCK (Bit 3)                */
#define BLE_BLESS_MT_CFG_ACT_LDO_NOT_BUCK_Msk (0x8UL)           /*!< BLE_BLESS MT_CFG: ACT_LDO_NOT_BUCK (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_MT_CFG_OVERRIDE_HVLDO_BYPASS_Pos (4UL)        /*!< BLE_BLESS MT_CFG: OVERRIDE_HVLDO_BYPASS (Bit 4)           */
#define BLE_BLESS_MT_CFG_OVERRIDE_HVLDO_BYPASS_Msk (0x10UL)     /*!< BLE_BLESS MT_CFG: OVERRIDE_HVLDO_BYPASS (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MT_CFG_HVLDO_BYPASS_Pos (5UL)                 /*!< BLE_BLESS MT_CFG: HVLDO_BYPASS (Bit 5)                    */
#define BLE_BLESS_MT_CFG_HVLDO_BYPASS_Msk (0x20UL)              /*!< BLE_BLESS MT_CFG: HVLDO_BYPASS (Bitfield-Mask: 0x01)      */
#define BLE_BLESS_MT_CFG_OVERRIDE_ACT_REGULATOR_Pos (6UL)       /*!< BLE_BLESS MT_CFG: OVERRIDE_ACT_REGULATOR (Bit 6)          */
#define BLE_BLESS_MT_CFG_OVERRIDE_ACT_REGULATOR_Msk (0x40UL)    /*!< BLE_BLESS MT_CFG: OVERRIDE_ACT_REGULATOR (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MT_CFG_ACT_REGULATOR_EN_Pos (7UL)             /*!< BLE_BLESS MT_CFG: ACT_REGULATOR_EN (Bit 7)                */
#define BLE_BLESS_MT_CFG_ACT_REGULATOR_EN_Msk (0x80UL)          /*!< BLE_BLESS MT_CFG: ACT_REGULATOR_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_MT_CFG_OVERRIDE_DIG_REGULATOR_Pos (8UL)       /*!< BLE_BLESS MT_CFG: OVERRIDE_DIG_REGULATOR (Bit 8)          */
#define BLE_BLESS_MT_CFG_OVERRIDE_DIG_REGULATOR_Msk (0x100UL)   /*!< BLE_BLESS MT_CFG: OVERRIDE_DIG_REGULATOR (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MT_CFG_DIG_REGULATOR_EN_Pos (9UL)             /*!< BLE_BLESS MT_CFG: DIG_REGULATOR_EN (Bit 9)                */
#define BLE_BLESS_MT_CFG_DIG_REGULATOR_EN_Msk (0x200UL)         /*!< BLE_BLESS MT_CFG: DIG_REGULATOR_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_MT_CFG_OVERRIDE_RET_SWITCH_Pos (10UL)         /*!< BLE_BLESS MT_CFG: OVERRIDE_RET_SWITCH (Bit 10)            */
#define BLE_BLESS_MT_CFG_OVERRIDE_RET_SWITCH_Msk (0x400UL)      /*!< BLE_BLESS MT_CFG: OVERRIDE_RET_SWITCH (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MT_CFG_RET_SWITCH_Pos   (11UL)                /*!< BLE_BLESS MT_CFG: RET_SWITCH (Bit 11)                     */
#define BLE_BLESS_MT_CFG_RET_SWITCH_Msk   (0x800UL)             /*!< BLE_BLESS MT_CFG: RET_SWITCH (Bitfield-Mask: 0x01)        */
#define BLE_BLESS_MT_CFG_OVERRIDE_ISOLATE_Pos (12UL)            /*!< BLE_BLESS MT_CFG: OVERRIDE_ISOLATE (Bit 12)               */
#define BLE_BLESS_MT_CFG_OVERRIDE_ISOLATE_Msk (0x1000UL)        /*!< BLE_BLESS MT_CFG: OVERRIDE_ISOLATE (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_MT_CFG_ISOLATE_N_Pos    (13UL)                /*!< BLE_BLESS MT_CFG: ISOLATE_N (Bit 13)                      */
#define BLE_BLESS_MT_CFG_ISOLATE_N_Msk    (0x2000UL)            /*!< BLE_BLESS MT_CFG: ISOLATE_N (Bitfield-Mask: 0x01)         */
#define BLE_BLESS_MT_CFG_OVERRIDE_LL_CLK_EN_Pos (14UL)          /*!< BLE_BLESS MT_CFG: OVERRIDE_LL_CLK_EN (Bit 14)             */
#define BLE_BLESS_MT_CFG_OVERRIDE_LL_CLK_EN_Msk (0x4000UL)      /*!< BLE_BLESS MT_CFG: OVERRIDE_LL_CLK_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MT_CFG_LL_CLK_EN_Pos    (15UL)                /*!< BLE_BLESS MT_CFG: LL_CLK_EN (Bit 15)                      */
#define BLE_BLESS_MT_CFG_LL_CLK_EN_Msk    (0x8000UL)            /*!< BLE_BLESS MT_CFG: LL_CLK_EN (Bitfield-Mask: 0x01)         */
#define BLE_BLESS_MT_CFG_OVERRIDE_HVLDO_EN_Pos (16UL)           /*!< BLE_BLESS MT_CFG: OVERRIDE_HVLDO_EN (Bit 16)              */
#define BLE_BLESS_MT_CFG_OVERRIDE_HVLDO_EN_Msk (0x10000UL)      /*!< BLE_BLESS MT_CFG: OVERRIDE_HVLDO_EN (Bitfield-Mask: 0x01) */
#define BLE_BLESS_MT_CFG_HVLDO_EN_Pos     (17UL)                /*!< BLE_BLESS MT_CFG: HVLDO_EN (Bit 17)                       */
#define BLE_BLESS_MT_CFG_HVLDO_EN_Msk     (0x20000UL)           /*!< BLE_BLESS MT_CFG: HVLDO_EN (Bitfield-Mask: 0x01)          */
#define BLE_BLESS_MT_CFG_DPSLP_ECO_ON_Pos (18UL)                /*!< BLE_BLESS MT_CFG: DPSLP_ECO_ON (Bit 18)                   */
#define BLE_BLESS_MT_CFG_DPSLP_ECO_ON_Msk (0x40000UL)           /*!< BLE_BLESS MT_CFG: DPSLP_ECO_ON (Bitfield-Mask: 0x01)      */
#define BLE_BLESS_MT_CFG_OVERRIDE_RESET_N_Pos (19UL)            /*!< BLE_BLESS MT_CFG: OVERRIDE_RESET_N (Bit 19)               */
#define BLE_BLESS_MT_CFG_OVERRIDE_RESET_N_Msk (0x80000UL)       /*!< BLE_BLESS MT_CFG: OVERRIDE_RESET_N (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_MT_CFG_RESET_N_Pos      (20UL)                /*!< BLE_BLESS MT_CFG: RESET_N (Bit 20)                        */
#define BLE_BLESS_MT_CFG_RESET_N_Msk      (0x100000UL)          /*!< BLE_BLESS MT_CFG: RESET_N (Bitfield-Mask: 0x01)           */
#define BLE_BLESS_MT_CFG_OVERRIDE_XTAL_EN_Pos (21UL)            /*!< BLE_BLESS MT_CFG: OVERRIDE_XTAL_EN (Bit 21)               */
#define BLE_BLESS_MT_CFG_OVERRIDE_XTAL_EN_Msk (0x200000UL)      /*!< BLE_BLESS MT_CFG: OVERRIDE_XTAL_EN (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_MT_CFG_XTAL_EN_Pos      (22UL)                /*!< BLE_BLESS MT_CFG: XTAL_EN (Bit 22)                        */
#define BLE_BLESS_MT_CFG_XTAL_EN_Msk      (0x400000UL)          /*!< BLE_BLESS MT_CFG: XTAL_EN (Bitfield-Mask: 0x01)           */
#define BLE_BLESS_MT_CFG_OVERRIDE_CLK_EN_Pos (23UL)             /*!< BLE_BLESS MT_CFG: OVERRIDE_CLK_EN (Bit 23)                */
#define BLE_BLESS_MT_CFG_OVERRIDE_CLK_EN_Msk (0x800000UL)       /*!< BLE_BLESS MT_CFG: OVERRIDE_CLK_EN (Bitfield-Mask: 0x01)   */
#define BLE_BLESS_MT_CFG_BLERD_CLK_EN_Pos (24UL)                /*!< BLE_BLESS MT_CFG: BLERD_CLK_EN (Bit 24)                   */
#define BLE_BLESS_MT_CFG_BLERD_CLK_EN_Msk (0x1000000UL)         /*!< BLE_BLESS MT_CFG: BLERD_CLK_EN (Bitfield-Mask: 0x01)      */
#define BLE_BLESS_MT_CFG_OVERRIDE_RET_LDO_OL_Pos (25UL)         /*!< BLE_BLESS MT_CFG: OVERRIDE_RET_LDO_OL (Bit 25)            */
#define BLE_BLESS_MT_CFG_OVERRIDE_RET_LDO_OL_Msk (0x2000000UL)  /*!< BLE_BLESS MT_CFG: OVERRIDE_RET_LDO_OL (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MT_CFG_RET_LDO_OL_Pos   (26UL)                /*!< BLE_BLESS MT_CFG: RET_LDO_OL (Bit 26)                     */
#define BLE_BLESS_MT_CFG_RET_LDO_OL_Msk   (0x4000000UL)         /*!< BLE_BLESS MT_CFG: RET_LDO_OL (Bitfield-Mask: 0x01)        */
#define BLE_BLESS_MT_CFG_HVLDO_POR_HV_Pos (27UL)                /*!< BLE_BLESS MT_CFG: HVLDO_POR_HV (Bit 27)                   */
#define BLE_BLESS_MT_CFG_HVLDO_POR_HV_Msk (0x8000000UL)         /*!< BLE_BLESS MT_CFG: HVLDO_POR_HV (Bitfield-Mask: 0x01)      */
/* ================================================  BLE_BLESS.MT_DELAY_CFG  ================================================= */
#define BLE_BLESS_MT_DELAY_CFG_HVLDO_STARTUP_DELAY_Pos (0UL)    /*!< BLE_BLESS MT_DELAY_CFG: HVLDO_STARTUP_DELAY (Bit 0)       */
#define BLE_BLESS_MT_DELAY_CFG_HVLDO_STARTUP_DELAY_Msk (0xffUL) /*!< BLE_BLESS MT_DELAY_CFG: HVLDO_STARTUP_DELAY (Bitfield-Mask: 0xff)*/
#define BLE_BLESS_MT_DELAY_CFG_ISOLATE_DEASSERT_DELAY_Pos (8UL) /*!< BLE_BLESS MT_DELAY_CFG: ISOLATE_DEASSERT_DELAY (Bit 8)    */
#define BLE_BLESS_MT_DELAY_CFG_ISOLATE_DEASSERT_DELAY_Msk (0xff00UL) /*!< BLE_BLESS MT_DELAY_CFG: ISOLATE_DEASSERT_DELAY (Bitfield-Mask: 0xff)*/
#define BLE_BLESS_MT_DELAY_CFG_ACT_TO_SWITCH_DELAY_Pos (16UL)   /*!< BLE_BLESS MT_DELAY_CFG: ACT_TO_SWITCH_DELAY (Bit 16)      */
#define BLE_BLESS_MT_DELAY_CFG_ACT_TO_SWITCH_DELAY_Msk (0xff0000UL) /*!< BLE_BLESS MT_DELAY_CFG: ACT_TO_SWITCH_DELAY (Bitfield-Mask: 0xff)*/
#define BLE_BLESS_MT_DELAY_CFG_HVLDO_DISABLE_DELAY_Pos (24UL)   /*!< BLE_BLESS MT_DELAY_CFG: HVLDO_DISABLE_DELAY (Bit 24)      */
#define BLE_BLESS_MT_DELAY_CFG_HVLDO_DISABLE_DELAY_Msk (0xff000000UL) /*!< BLE_BLESS MT_DELAY_CFG: HVLDO_DISABLE_DELAY (Bitfield-Mask: 0xff)*/
/* ================================================  BLE_BLESS.MT_DELAY_CFG2  ================================================ */
#define BLE_BLESS_MT_DELAY_CFG2_OSC_STARTUP_DELAY_LF_Pos (0UL)  /*!< BLE_BLESS MT_DELAY_CFG2: OSC_STARTUP_DELAY_LF (Bit 0)     */
#define BLE_BLESS_MT_DELAY_CFG2_OSC_STARTUP_DELAY_LF_Msk (0xffUL) /*!< BLE_BLESS MT_DELAY_CFG2: OSC_STARTUP_DELAY_LF (Bitfield-Mask: 0xff)*/
#define BLE_BLESS_MT_DELAY_CFG2_DSM_OFFSET_TO_WAKEUP_INSTANT_LF_Pos (8UL) /*!< BLE_BLESS MT_DELAY_CFG2: DSM_OFFSET_TO_WAKEUP_INSTANT_LF (Bit 8)*/
#define BLE_BLESS_MT_DELAY_CFG2_DSM_OFFSET_TO_WAKEUP_INSTANT_LF_Msk (0xff00UL) /*!< BLE_BLESS MT_DELAY_CFG2: DSM_OFFSET_TO_WAKEUP_INSTANT_LF (Bitfield-Mask: 0xff)*/
#define BLE_BLESS_MT_DELAY_CFG2_ACT_STARTUP_DELAY_Pos (16UL)    /*!< BLE_BLESS MT_DELAY_CFG2: ACT_STARTUP_DELAY (Bit 16)       */
#define BLE_BLESS_MT_DELAY_CFG2_ACT_STARTUP_DELAY_Msk (0xff0000UL) /*!< BLE_BLESS MT_DELAY_CFG2: ACT_STARTUP_DELAY (Bitfield-Mask: 0xff)*/
#define BLE_BLESS_MT_DELAY_CFG2_DIG_LDO_STARTUP_DELAY_Pos (24UL) /*!< BLE_BLESS MT_DELAY_CFG2: DIG_LDO_STARTUP_DELAY (Bit 24)  */
#define BLE_BLESS_MT_DELAY_CFG2_DIG_LDO_STARTUP_DELAY_Msk (0xff000000UL) /*!< BLE_BLESS MT_DELAY_CFG2: DIG_LDO_STARTUP_DELAY (Bitfield-Mask: 0xff)*/
/* ================================================  BLE_BLESS.MT_DELAY_CFG3  ================================================ */
#define BLE_BLESS_MT_DELAY_CFG3_XTAL_DISABLE_DELAY_Pos (0UL)    /*!< BLE_BLESS MT_DELAY_CFG3: XTAL_DISABLE_DELAY (Bit 0)       */
#define BLE_BLESS_MT_DELAY_CFG3_XTAL_DISABLE_DELAY_Msk (0xffUL) /*!< BLE_BLESS MT_DELAY_CFG3: XTAL_DISABLE_DELAY (Bitfield-Mask: 0xff)*/
