ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_ble.h
#define BLE_BLESS_MT_DELAY_CFG3_DIG_LDO_DISABLE_DELAY_Pos (8UL) /*!< BLE_BLESS MT_DELAY_CFG3: DIG_LDO_DISABLE_DELAY (Bit 8)    */
#define BLE_BLESS_MT_DELAY_CFG3_DIG_LDO_DISABLE_DELAY_Msk (0xff00UL) /*!< BLE_BLESS MT_DELAY_CFG3: DIG_LDO_DISABLE_DELAY (Bitfield-Mask: 0xff)*/
#define BLE_BLESS_MT_DELAY_CFG3_VDDR_STABLE_DELAY_Pos (16UL)    /*!< BLE_BLESS MT_DELAY_CFG3: VDDR_STABLE_DELAY (Bit 16)       */
#define BLE_BLESS_MT_DELAY_CFG3_VDDR_STABLE_DELAY_Msk (0xff0000UL) /*!< BLE_BLESS MT_DELAY_CFG3: VDDR_STABLE_DELAY (Bitfield-Mask: 0xff)*/
/* =================================================  BLE_BLESS.MT_VIO_CTRL  ================================================= */
#define BLE_BLESS_MT_VIO_CTRL_SRSS_SWITCH_EN_Pos (0UL)          /*!< BLE_BLESS MT_VIO_CTRL: SRSS_SWITCH_EN (Bit 0)             */
#define BLE_BLESS_MT_VIO_CTRL_SRSS_SWITCH_EN_Msk (0x1UL)        /*!< BLE_BLESS MT_VIO_CTRL: SRSS_SWITCH_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MT_VIO_CTRL_SRSS_SWITCH_EN_DLY_Pos (1UL)      /*!< BLE_BLESS MT_VIO_CTRL: SRSS_SWITCH_EN_DLY (Bit 1)         */
#define BLE_BLESS_MT_VIO_CTRL_SRSS_SWITCH_EN_DLY_Msk (0x2UL)    /*!< BLE_BLESS MT_VIO_CTRL: SRSS_SWITCH_EN_DLY (Bitfield-Mask: 0x01)*/
/* ==================================================  BLE_BLESS.MT_STATUS  ================================================== */
#define BLE_BLESS_MT_STATUS_BLESS_STATE_Pos (0UL)               /*!< BLE_BLESS MT_STATUS: BLESS_STATE (Bit 0)                  */
#define BLE_BLESS_MT_STATUS_BLESS_STATE_Msk (0x1UL)             /*!< BLE_BLESS MT_STATUS: BLESS_STATE (Bitfield-Mask: 0x01)    */
#define BLE_BLESS_MT_STATUS_MT_CURR_STATE_Pos (1UL)             /*!< BLE_BLESS MT_STATUS: MT_CURR_STATE (Bit 1)                */
#define BLE_BLESS_MT_STATUS_MT_CURR_STATE_Msk (0x1eUL)          /*!< BLE_BLESS MT_STATUS: MT_CURR_STATE (Bitfield-Mask: 0x0f)  */
#define BLE_BLESS_MT_STATUS_HVLDO_STARTUP_CURR_STATE_Pos (5UL)  /*!< BLE_BLESS MT_STATUS: HVLDO_STARTUP_CURR_STATE (Bit 5)     */
#define BLE_BLESS_MT_STATUS_HVLDO_STARTUP_CURR_STATE_Msk (0xe0UL) /*!< BLE_BLESS MT_STATUS: HVLDO_STARTUP_CURR_STATE (Bitfield-Mask: 0x07)*/
/* ===============================================  BLE_BLESS.PWR_CTRL_SM_ST  ================================================ */
#define BLE_BLESS_PWR_CTRL_SM_ST_PWR_CTRL_SM_CURR_STATE_Pos (0UL) /*!< BLE_BLESS PWR_CTRL_SM_ST: PWR_CTRL_SM_CURR_STATE (Bit 0)*/
#define BLE_BLESS_PWR_CTRL_SM_ST_PWR_CTRL_SM_CURR_STATE_Msk (0xfUL) /*!< BLE_BLESS PWR_CTRL_SM_ST: PWR_CTRL_SM_CURR_STATE (Bitfield-Mask: 0x0f)*/
/* =================================================  BLE_BLESS.HVLDO_CTRL  ================================================== */
#define BLE_BLESS_HVLDO_CTRL_ADFT_EN_Pos  (0UL)                 /*!< BLE_BLESS HVLDO_CTRL: ADFT_EN (Bit 0)                     */
#define BLE_BLESS_HVLDO_CTRL_ADFT_EN_Msk  (0x1UL)               /*!< BLE_BLESS HVLDO_CTRL: ADFT_EN (Bitfield-Mask: 0x01)       */
#define BLE_BLESS_HVLDO_CTRL_ADFT_CTRL_Pos (1UL)                /*!< BLE_BLESS HVLDO_CTRL: ADFT_CTRL (Bit 1)                   */
#define BLE_BLESS_HVLDO_CTRL_ADFT_CTRL_Msk (0x1eUL)             /*!< BLE_BLESS HVLDO_CTRL: ADFT_CTRL (Bitfield-Mask: 0x0f)     */
#define BLE_BLESS_HVLDO_CTRL_VREF_EXT_EN_Pos (6UL)              /*!< BLE_BLESS HVLDO_CTRL: VREF_EXT_EN (Bit 6)                 */
#define BLE_BLESS_HVLDO_CTRL_VREF_EXT_EN_Msk (0x40UL)           /*!< BLE_BLESS HVLDO_CTRL: VREF_EXT_EN (Bitfield-Mask: 0x01)   */
#define BLE_BLESS_HVLDO_CTRL_STATUS_Pos   (31UL)                /*!< BLE_BLESS HVLDO_CTRL: STATUS (Bit 31)                     */
#define BLE_BLESS_HVLDO_CTRL_STATUS_Msk   (0x80000000UL)        /*!< BLE_BLESS HVLDO_CTRL: STATUS (Bitfield-Mask: 0x01)        */
/* ================================================  BLE_BLESS.MISC_EN_CTRL  ================================================= */
#define BLE_BLESS_MISC_EN_CTRL_BUCK_EN_CTRL_Pos (0UL)           /*!< BLE_BLESS MISC_EN_CTRL: BUCK_EN_CTRL (Bit 0)              */
#define BLE_BLESS_MISC_EN_CTRL_BUCK_EN_CTRL_Msk (0x1UL)         /*!< BLE_BLESS MISC_EN_CTRL: BUCK_EN_CTRL (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MISC_EN_CTRL_ACT_REG_EN_CTRL_Pos (1UL)        /*!< BLE_BLESS MISC_EN_CTRL: ACT_REG_EN_CTRL (Bit 1)           */
#define BLE_BLESS_MISC_EN_CTRL_ACT_REG_EN_CTRL_Msk (0x2UL)      /*!< BLE_BLESS MISC_EN_CTRL: ACT_REG_EN_CTRL (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MISC_EN_CTRL_LPM_DRIFT_EN_Pos (2UL)           /*!< BLE_BLESS MISC_EN_CTRL: LPM_DRIFT_EN (Bit 2)              */
#define BLE_BLESS_MISC_EN_CTRL_LPM_DRIFT_EN_Msk (0x4UL)         /*!< BLE_BLESS MISC_EN_CTRL: LPM_DRIFT_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MISC_EN_CTRL_LPM_DRIFT_MULTI_Pos (3UL)        /*!< BLE_BLESS MISC_EN_CTRL: LPM_DRIFT_MULTI (Bit 3)           */
#define BLE_BLESS_MISC_EN_CTRL_LPM_DRIFT_MULTI_Msk (0x8UL)      /*!< BLE_BLESS MISC_EN_CTRL: LPM_DRIFT_MULTI (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_MISC_EN_CTRL_LPM_ENTRY_CTRL_MODE_Pos (4UL)    /*!< BLE_BLESS MISC_EN_CTRL: LPM_ENTRY_CTRL_MODE (Bit 4)       */
#define BLE_BLESS_MISC_EN_CTRL_LPM_ENTRY_CTRL_MODE_Msk (0x10UL) /*!< BLE_BLESS MISC_EN_CTRL: LPM_ENTRY_CTRL_MODE (Bitfield-Mask: 0x01)*/
/* ================================================  BLE_BLESS.EFUSE_CONFIG  ================================================= */
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_MODE_Pos (0UL)             /*!< BLE_BLESS EFUSE_CONFIG: EFUSE_MODE (Bit 0)                */
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_MODE_Msk (0x1UL)           /*!< BLE_BLESS EFUSE_CONFIG: EFUSE_MODE (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_READ_Pos (1UL)             /*!< BLE_BLESS EFUSE_CONFIG: EFUSE_READ (Bit 1)                */
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_READ_Msk (0x2UL)           /*!< BLE_BLESS EFUSE_CONFIG: EFUSE_READ (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_WRITE_Pos (2UL)            /*!< BLE_BLESS EFUSE_CONFIG: EFUSE_WRITE (Bit 2)               */
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_WRITE_Msk (0x4UL)          /*!< BLE_BLESS EFUSE_CONFIG: EFUSE_WRITE (Bitfield-Mask: 0x01) */
/* ===============================================  BLE_BLESS.EFUSE_TIM_CTRL1  =============================================== */
#define BLE_BLESS_EFUSE_TIM_CTRL1_SCLK_HIGH_Pos (0UL)           /*!< BLE_BLESS EFUSE_TIM_CTRL1: SCLK_HIGH (Bit 0)              */
#define BLE_BLESS_EFUSE_TIM_CTRL1_SCLK_HIGH_Msk (0xffUL)        /*!< BLE_BLESS EFUSE_TIM_CTRL1: SCLK_HIGH (Bitfield-Mask: 0xff)*/
#define BLE_BLESS_EFUSE_TIM_CTRL1_SCLK_LOW_Pos (8UL)            /*!< BLE_BLESS EFUSE_TIM_CTRL1: SCLK_LOW (Bit 8)               */
#define BLE_BLESS_EFUSE_TIM_CTRL1_SCLK_LOW_Msk (0xff00UL)       /*!< BLE_BLESS EFUSE_TIM_CTRL1: SCLK_LOW (Bitfield-Mask: 0xff) */
#define BLE_BLESS_EFUSE_TIM_CTRL1_CS_SCLK_SETUP_TIME_Pos (16UL) /*!< BLE_BLESS EFUSE_TIM_CTRL1: CS_SCLK_SETUP_TIME (Bit 16)    */
#define BLE_BLESS_EFUSE_TIM_CTRL1_CS_SCLK_SETUP_TIME_Msk (0xf0000UL) /*!< BLE_BLESS EFUSE_TIM_CTRL1: CS_SCLK_SETUP_TIME (Bitfield-Mask: 0x0f)*/
#define BLE_BLESS_EFUSE_TIM_CTRL1_CS_SCLK_HOLD_TIME_Pos (20UL)  /*!< BLE_BLESS EFUSE_TIM_CTRL1: CS_SCLK_HOLD_TIME (Bit 20)     */
#define BLE_BLESS_EFUSE_TIM_CTRL1_CS_SCLK_HOLD_TIME_Msk (0xf00000UL) /*!< BLE_BLESS EFUSE_TIM_CTRL1: CS_SCLK_HOLD_TIME (Bitfield-Mask: 0x0f)*/
#define BLE_BLESS_EFUSE_TIM_CTRL1_RW_CS_SETUP_TIME_Pos (24UL)   /*!< BLE_BLESS EFUSE_TIM_CTRL1: RW_CS_SETUP_TIME (Bit 24)      */
#define BLE_BLESS_EFUSE_TIM_CTRL1_RW_CS_SETUP_TIME_Msk (0xf000000UL) /*!< BLE_BLESS EFUSE_TIM_CTRL1: RW_CS_SETUP_TIME (Bitfield-Mask: 0x0f)*/
#define BLE_BLESS_EFUSE_TIM_CTRL1_RW_CS_HOLD_TIME_Pos (28UL)    /*!< BLE_BLESS EFUSE_TIM_CTRL1: RW_CS_HOLD_TIME (Bit 28)       */
#define BLE_BLESS_EFUSE_TIM_CTRL1_RW_CS_HOLD_TIME_Msk (0xf0000000UL) /*!< BLE_BLESS EFUSE_TIM_CTRL1: RW_CS_HOLD_TIME (Bitfield-Mask: 0x0f)*/
/* ===============================================  BLE_BLESS.EFUSE_TIM_CTRL2  =============================================== */
#define BLE_BLESS_EFUSE_TIM_CTRL2_DATA_SAMPLE_TIME_Pos (0UL)    /*!< BLE_BLESS EFUSE_TIM_CTRL2: DATA_SAMPLE_TIME (Bit 0)       */
#define BLE_BLESS_EFUSE_TIM_CTRL2_DATA_SAMPLE_TIME_Msk (0xffUL) /*!< BLE_BLESS EFUSE_TIM_CTRL2: DATA_SAMPLE_TIME (Bitfield-Mask: 0xff)*/
#define BLE_BLESS_EFUSE_TIM_CTRL2_DOUT_CS_HOLD_TIME_Pos (8UL)   /*!< BLE_BLESS EFUSE_TIM_CTRL2: DOUT_CS_HOLD_TIME (Bit 8)      */
#define BLE_BLESS_EFUSE_TIM_CTRL2_DOUT_CS_HOLD_TIME_Msk (0xf00UL) /*!< BLE_BLESS EFUSE_TIM_CTRL2: DOUT_CS_HOLD_TIME (Bitfield-Mask: 0x0f)*/
/* ===============================================  BLE_BLESS.EFUSE_TIM_CTRL3  =============================================== */
#define BLE_BLESS_EFUSE_TIM_CTRL3_PGM_SCLK_SETUP_TIME_Pos (0UL) /*!< BLE_BLESS EFUSE_TIM_CTRL3: PGM_SCLK_SETUP_TIME (Bit 0)    */
#define BLE_BLESS_EFUSE_TIM_CTRL3_PGM_SCLK_SETUP_TIME_Msk (0xfUL) /*!< BLE_BLESS EFUSE_TIM_CTRL3: PGM_SCLK_SETUP_TIME (Bitfield-Mask: 0x0f)*/
#define BLE_BLESS_EFUSE_TIM_CTRL3_PGM_SCLK_HOLD_TIME_Pos (4UL)  /*!< BLE_BLESS EFUSE_TIM_CTRL3: PGM_SCLK_HOLD_TIME (Bit 4)     */
#define BLE_BLESS_EFUSE_TIM_CTRL3_PGM_SCLK_HOLD_TIME_Msk (0xf0UL) /*!< BLE_BLESS EFUSE_TIM_CTRL3: PGM_SCLK_HOLD_TIME (Bitfield-Mask: 0x0f)*/
#define BLE_BLESS_EFUSE_TIM_CTRL3_AVDD_CS_SETUP_TIME_Pos (8UL)  /*!< BLE_BLESS EFUSE_TIM_CTRL3: AVDD_CS_SETUP_TIME (Bit 8)     */
#define BLE_BLESS_EFUSE_TIM_CTRL3_AVDD_CS_SETUP_TIME_Msk (0xff00UL) /*!< BLE_BLESS EFUSE_TIM_CTRL3: AVDD_CS_SETUP_TIME (Bitfield-Mask: 0xff)*/
#define BLE_BLESS_EFUSE_TIM_CTRL3_AVDD_CS_HOLD_TIME_Pos (16UL)  /*!< BLE_BLESS EFUSE_TIM_CTRL3: AVDD_CS_HOLD_TIME (Bit 16)     */
#define BLE_BLESS_EFUSE_TIM_CTRL3_AVDD_CS_HOLD_TIME_Msk (0xff0000UL) /*!< BLE_BLESS EFUSE_TIM_CTRL3: AVDD_CS_HOLD_TIME (Bitfield-Mask: 0xff)*/
/* ================================================  BLE_BLESS.EFUSE_RDATA_L  ================================================ */
#define BLE_BLESS_EFUSE_RDATA_L_DATA_Pos  (0UL)                 /*!< BLE_BLESS EFUSE_RDATA_L: DATA (Bit 0)                     */
#define BLE_BLESS_EFUSE_RDATA_L_DATA_Msk  (0xffffffffUL)        /*!< BLE_BLESS EFUSE_RDATA_L: DATA (Bitfield-Mask: 0xffffffff) */
/* ================================================  BLE_BLESS.EFUSE_RDATA_H  ================================================ */
#define BLE_BLESS_EFUSE_RDATA_H_DATA_Pos  (0UL)                 /*!< BLE_BLESS EFUSE_RDATA_H: DATA (Bit 0)                     */
#define BLE_BLESS_EFUSE_RDATA_H_DATA_Msk  (0xffffffffUL)        /*!< BLE_BLESS EFUSE_RDATA_H: DATA (Bitfield-Mask: 0xffffffff) */
/* ================================================  BLE_BLESS.EFUSE_WDATA_L  ================================================ */
#define BLE_BLESS_EFUSE_WDATA_L_DATA_Pos  (0UL)                 /*!< BLE_BLESS EFUSE_WDATA_L: DATA (Bit 0)                     */
#define BLE_BLESS_EFUSE_WDATA_L_DATA_Msk  (0xffffffffUL)        /*!< BLE_BLESS EFUSE_WDATA_L: DATA (Bitfield-Mask: 0xffffffff) */
/* ================================================  BLE_BLESS.EFUSE_WDATA_H  ================================================ */
#define BLE_BLESS_EFUSE_WDATA_H_DATA_Pos  (0UL)                 /*!< BLE_BLESS EFUSE_WDATA_H: DATA (Bit 0)                     */
#define BLE_BLESS_EFUSE_WDATA_H_DATA_Msk  (0xffffffffUL)        /*!< BLE_BLESS EFUSE_WDATA_H: DATA (Bitfield-Mask: 0xffffffff) */
/* ===============================================  BLE_BLESS.DIV_BY_625_CFG  ================================================ */
#define BLE_BLESS_DIV_BY_625_CFG_ENABLE_Pos (1UL)               /*!< BLE_BLESS DIV_BY_625_CFG: ENABLE (Bit 1)                  */
#define BLE_BLESS_DIV_BY_625_CFG_ENABLE_Msk (0x2UL)             /*!< BLE_BLESS DIV_BY_625_CFG: ENABLE (Bitfield-Mask: 0x01)    */
#define BLE_BLESS_DIV_BY_625_CFG_DIVIDEND_Pos (8UL)             /*!< BLE_BLESS DIV_BY_625_CFG: DIVIDEND (Bit 8)                */
#define BLE_BLESS_DIV_BY_625_CFG_DIVIDEND_Msk (0xffff00UL)      /*!< BLE_BLESS DIV_BY_625_CFG: DIVIDEND (Bitfield-Mask: 0xffff)*/
/* ===============================================  BLE_BLESS.DIV_BY_625_STS  ================================================ */
#define BLE_BLESS_DIV_BY_625_STS_QUOTIENT_Pos (0UL)             /*!< BLE_BLESS DIV_BY_625_STS: QUOTIENT (Bit 0)                */
#define BLE_BLESS_DIV_BY_625_STS_QUOTIENT_Msk (0x3fUL)          /*!< BLE_BLESS DIV_BY_625_STS: QUOTIENT (Bitfield-Mask: 0x3f)  */
#define BLE_BLESS_DIV_BY_625_STS_REMAINDER_Pos (8UL)            /*!< BLE_BLESS DIV_BY_625_STS: REMAINDER (Bit 8)               */
#define BLE_BLESS_DIV_BY_625_STS_REMAINDER_Msk (0x3ff00UL)      /*!< BLE_BLESS DIV_BY_625_STS: REMAINDER (Bitfield-Mask: 0x3ff)*/
/* ===============================================  BLE_BLESS.PACKET_COUNTER0  =============================================== */
#define BLE_BLESS_PACKET_COUNTER0_PACKET_COUNTER_LOWER_Pos (0UL) /*!< BLE_BLESS PACKET_COUNTER0: PACKET_COUNTER_LOWER (Bit 0)  */
#define BLE_BLESS_PACKET_COUNTER0_PACKET_COUNTER_LOWER_Msk (0xffffffffUL) /*!< BLE_BLESS PACKET_COUNTER0: PACKET_COUNTER_LOWER (Bitfield-Mask: 0xffffffff)*/
/* ===============================================  BLE_BLESS.PACKET_COUNTER2  =============================================== */
#define BLE_BLESS_PACKET_COUNTER2_PACKET_COUNTER_UPPER_Pos (0UL) /*!< BLE_BLESS PACKET_COUNTER2: PACKET_COUNTER_UPPER (Bit 0)  */
#define BLE_BLESS_PACKET_COUNTER2_PACKET_COUNTER_UPPER_Msk (0xffUL) /*!< BLE_BLESS PACKET_COUNTER2: PACKET_COUNTER_UPPER (Bitfield-Mask: 0xff)*/
/* =================================================  BLE_BLESS.IV_MASTER0  ================================================== */
#define BLE_BLESS_IV_MASTER0_IV_MASTER_Pos (0UL)                /*!< BLE_BLESS IV_MASTER0: IV_MASTER (Bit 0)                   */
#define BLE_BLESS_IV_MASTER0_IV_MASTER_Msk (0xffffffffUL)       /*!< BLE_BLESS IV_MASTER0: IV_MASTER (Bitfield-Mask: 0xffffffff)*/
/* ==================================================  BLE_BLESS.IV_SLAVE0  ================================================== */
#define BLE_BLESS_IV_SLAVE0_IV_SLAVE_Pos  (0UL)                 /*!< BLE_BLESS IV_SLAVE0: IV_SLAVE (Bit 0)                     */
#define BLE_BLESS_IV_SLAVE0_IV_SLAVE_Msk  (0xffffffffUL)        /*!< BLE_BLESS IV_SLAVE0: IV_SLAVE (Bitfield-Mask: 0xffffffff) */
/* ===================================================  BLE_BLESS.ENC_KEY  =================================================== */
#define BLE_BLESS_ENC_KEY_ENC_KEY_Pos     (0UL)                 /*!< BLE_BLESS ENC_KEY: ENC_KEY (Bit 0)                        */
#define BLE_BLESS_ENC_KEY_ENC_KEY_Msk     (0xffffffffUL)        /*!< BLE_BLESS ENC_KEY: ENC_KEY (Bitfield-Mask: 0xffffffff)    */
/* ===================================================  BLE_BLESS.MIC_IN0  =================================================== */
#define BLE_BLESS_MIC_IN0_MIC_IN_Pos      (0UL)                 /*!< BLE_BLESS MIC_IN0: MIC_IN (Bit 0)                         */
#define BLE_BLESS_MIC_IN0_MIC_IN_Msk      (0xffffffffUL)        /*!< BLE_BLESS MIC_IN0: MIC_IN (Bitfield-Mask: 0xffffffff)     */
/* ==================================================  BLE_BLESS.MIC_OUT0  =================================================== */
#define BLE_BLESS_MIC_OUT0_MIC_OUT_Pos    (0UL)                 /*!< BLE_BLESS MIC_OUT0: MIC_OUT (Bit 0)                       */
#define BLE_BLESS_MIC_OUT0_MIC_OUT_Msk    (0xffffffffUL)        /*!< BLE_BLESS MIC_OUT0: MIC_OUT (Bitfield-Mask: 0xffffffff)   */
/* =================================================  BLE_BLESS.ENC_PARAMS  ================================================== */
#define BLE_BLESS_ENC_PARAMS_DATA_PDU_HEADER_Pos (0UL)          /*!< BLE_BLESS ENC_PARAMS: DATA_PDU_HEADER (Bit 0)             */
#define BLE_BLESS_ENC_PARAMS_DATA_PDU_HEADER_Msk (0x3UL)        /*!< BLE_BLESS ENC_PARAMS: DATA_PDU_HEADER (Bitfield-Mask: 0x03)*/
#define BLE_BLESS_ENC_PARAMS_PAYLOAD_LENGTH_LSB_Pos (2UL)       /*!< BLE_BLESS ENC_PARAMS: PAYLOAD_LENGTH_LSB (Bit 2)          */
#define BLE_BLESS_ENC_PARAMS_PAYLOAD_LENGTH_LSB_Msk (0x7cUL)    /*!< BLE_BLESS ENC_PARAMS: PAYLOAD_LENGTH_LSB (Bitfield-Mask: 0x1f)*/
#define BLE_BLESS_ENC_PARAMS_DIRECTION_Pos (7UL)                /*!< BLE_BLESS ENC_PARAMS: DIRECTION (Bit 7)                   */
#define BLE_BLESS_ENC_PARAMS_DIRECTION_Msk (0x80UL)             /*!< BLE_BLESS ENC_PARAMS: DIRECTION (Bitfield-Mask: 0x01)     */
#define BLE_BLESS_ENC_PARAMS_PAYLOAD_LENGTH_LSB_EXT_Pos (8UL)   /*!< BLE_BLESS ENC_PARAMS: PAYLOAD_LENGTH_LSB_EXT (Bit 8)      */
#define BLE_BLESS_ENC_PARAMS_PAYLOAD_LENGTH_LSB_EXT_Msk (0x700UL) /*!< BLE_BLESS ENC_PARAMS: PAYLOAD_LENGTH_LSB_EXT (Bitfield-Mask: 0x07)*/
#define BLE_BLESS_ENC_PARAMS_MEM_LATENCY_HIDE_Pos (11UL)        /*!< BLE_BLESS ENC_PARAMS: MEM_LATENCY_HIDE (Bit 11)           */
#define BLE_BLESS_ENC_PARAMS_MEM_LATENCY_HIDE_Msk (0x800UL)     /*!< BLE_BLESS ENC_PARAMS: MEM_LATENCY_HIDE (Bitfield-Mask: 0x01)*/
/* =================================================  BLE_BLESS.ENC_CONFIG  ================================================== */
#define BLE_BLESS_ENC_CONFIG_START_PROC_Pos (0UL)               /*!< BLE_BLESS ENC_CONFIG: START_PROC (Bit 0)                  */
#define BLE_BLESS_ENC_CONFIG_START_PROC_Msk (0x1UL)             /*!< BLE_BLESS ENC_CONFIG: START_PROC (Bitfield-Mask: 0x01)    */
#define BLE_BLESS_ENC_CONFIG_ECB_CCM_Pos  (1UL)                 /*!< BLE_BLESS ENC_CONFIG: ECB_CCM (Bit 1)                     */
#define BLE_BLESS_ENC_CONFIG_ECB_CCM_Msk  (0x2UL)               /*!< BLE_BLESS ENC_CONFIG: ECB_CCM (Bitfield-Mask: 0x01)       */
#define BLE_BLESS_ENC_CONFIG_DEC_ENC_Pos  (2UL)                 /*!< BLE_BLESS ENC_CONFIG: DEC_ENC (Bit 2)                     */
#define BLE_BLESS_ENC_CONFIG_DEC_ENC_Msk  (0x4UL)               /*!< BLE_BLESS ENC_CONFIG: DEC_ENC (Bitfield-Mask: 0x01)       */
#define BLE_BLESS_ENC_CONFIG_PAYLOAD_LENGTH_MSB_Pos (8UL)       /*!< BLE_BLESS ENC_CONFIG: PAYLOAD_LENGTH_MSB (Bit 8)          */
#define BLE_BLESS_ENC_CONFIG_PAYLOAD_LENGTH_MSB_Msk (0xff00UL)  /*!< BLE_BLESS ENC_CONFIG: PAYLOAD_LENGTH_MSB (Bitfield-Mask: 0xff)*/
#define BLE_BLESS_ENC_CONFIG_B0_FLAGS_Pos (16UL)                /*!< BLE_BLESS ENC_CONFIG: B0_FLAGS (Bit 16)                   */
#define BLE_BLESS_ENC_CONFIG_B0_FLAGS_Msk (0xff0000UL)          /*!< BLE_BLESS ENC_CONFIG: B0_FLAGS (Bitfield-Mask: 0xff)      */
#define BLE_BLESS_ENC_CONFIG_AES_B0_DATA_OVERRIDE_Pos (24UL)    /*!< BLE_BLESS ENC_CONFIG: AES_B0_DATA_OVERRIDE (Bit 24)       */
#define BLE_BLESS_ENC_CONFIG_AES_B0_DATA_OVERRIDE_Msk (0x1000000UL) /*!< BLE_BLESS ENC_CONFIG: AES_B0_DATA_OVERRIDE (Bitfield-Mask: 0x01)*/
/* =================================================  BLE_BLESS.ENC_INTR_EN  ================================================= */
#define BLE_BLESS_ENC_INTR_EN_AUTH_PASS_INTR_EN_Pos (0UL)       /*!< BLE_BLESS ENC_INTR_EN: AUTH_PASS_INTR_EN (Bit 0)          */
#define BLE_BLESS_ENC_INTR_EN_AUTH_PASS_INTR_EN_Msk (0x1UL)     /*!< BLE_BLESS ENC_INTR_EN: AUTH_PASS_INTR_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_ENC_INTR_EN_ECB_PROC_INTR_EN_Pos (1UL)        /*!< BLE_BLESS ENC_INTR_EN: ECB_PROC_INTR_EN (Bit 1)           */
#define BLE_BLESS_ENC_INTR_EN_ECB_PROC_INTR_EN_Msk (0x2UL)      /*!< BLE_BLESS ENC_INTR_EN: ECB_PROC_INTR_EN (Bitfield-Mask: 0x01)*/
#define BLE_BLESS_ENC_INTR_EN_CCM_PROC_INTR_EN_Pos (2UL)        /*!< BLE_BLESS ENC_INTR_EN: CCM_PROC_INTR_EN (Bit 2)           */
#define BLE_BLESS_ENC_INTR_EN_CCM_PROC_INTR_EN_Msk (0x4UL)      /*!< BLE_BLESS ENC_INTR_EN: CCM_PROC_INTR_EN (Bitfield-Mask: 0x01)*/
/* ==================================================  BLE_BLESS.ENC_INTR  =================================================== */
#define BLE_BLESS_ENC_INTR_AUTH_PASS_INTR_Pos (0UL)             /*!< BLE_BLESS ENC_INTR: AUTH_PASS_INTR (Bit 0)                */
#define BLE_BLESS_ENC_INTR_AUTH_PASS_INTR_Msk (0x1UL)           /*!< BLE_BLESS ENC_INTR: AUTH_PASS_INTR (Bitfield-Mask: 0x01)  */
#define BLE_BLESS_ENC_INTR_ECB_PROC_INTR_Pos (1UL)              /*!< BLE_BLESS ENC_INTR: ECB_PROC_INTR (Bit 1)                 */
#define BLE_BLESS_ENC_INTR_ECB_PROC_INTR_Msk (0x2UL)            /*!< BLE_BLESS ENC_INTR: ECB_PROC_INTR (Bitfield-Mask: 0x01)   */
#define BLE_BLESS_ENC_INTR_CCM_PROC_INTR_Pos (2UL)              /*!< BLE_BLESS ENC_INTR: CCM_PROC_INTR (Bit 2)                 */
#define BLE_BLESS_ENC_INTR_CCM_PROC_INTR_Msk (0x4UL)            /*!< BLE_BLESS ENC_INTR: CCM_PROC_INTR (Bitfield-Mask: 0x01)   */
#define BLE_BLESS_ENC_INTR_IN_DATA_CLEAR_Pos (3UL)              /*!< BLE_BLESS ENC_INTR: IN_DATA_CLEAR (Bit 3)                 */
#define BLE_BLESS_ENC_INTR_IN_DATA_CLEAR_Msk (0x8UL)            /*!< BLE_BLESS ENC_INTR: IN_DATA_CLEAR (Bitfield-Mask: 0x01)   */
/* =================================================  BLE_BLESS.B1_DATA_REG  ================================================= */
#define BLE_BLESS_B1_DATA_REG_B1_DATA_Pos (0UL)                 /*!< BLE_BLESS B1_DATA_REG: B1_DATA (Bit 0)                    */
#define BLE_BLESS_B1_DATA_REG_B1_DATA_Msk (0xffffffffUL)        /*!< BLE_BLESS B1_DATA_REG: B1_DATA (Bitfield-Mask: 0xffffffff)*/
/* ==============================================  BLE_BLESS.ENC_MEM_BASE_ADDR  ============================================== */
#define BLE_BLESS_ENC_MEM_BASE_ADDR_ENC_MEM_Pos (0UL)           /*!< BLE_BLESS ENC_MEM_BASE_ADDR: ENC_MEM (Bit 0)              */
#define BLE_BLESS_ENC_MEM_BASE_ADDR_ENC_MEM_Msk (0xffffffffUL)  /*!< BLE_BLESS ENC_MEM_BASE_ADDR: ENC_MEM (Bitfield-Mask: 0xffffffff)*/
/* =================================================  BLE_BLESS.TRIM_LDO_0  ================================================== */
#define BLE_BLESS_TRIM_LDO_0_ACT_LDO_VREG_Pos (0UL)             /*!< BLE_BLESS TRIM_LDO_0: ACT_LDO_VREG (Bit 0)                */
#define BLE_BLESS_TRIM_LDO_0_ACT_LDO_VREG_Msk (0xfUL)           /*!< BLE_BLESS TRIM_LDO_0: ACT_LDO_VREG (Bitfield-Mask: 0x0f)  */
#define BLE_BLESS_TRIM_LDO_0_ACT_LDO_ITAIL_Pos (4UL)            /*!< BLE_BLESS TRIM_LDO_0: ACT_LDO_ITAIL (Bit 4)               */
#define BLE_BLESS_TRIM_LDO_0_ACT_LDO_ITAIL_Msk (0xf0UL)         /*!< BLE_BLESS TRIM_LDO_0: ACT_LDO_ITAIL (Bitfield-Mask: 0x0f) */
/* =================================================  BLE_BLESS.TRIM_LDO_1  ================================================== */
#define BLE_BLESS_TRIM_LDO_1_ACT_REF_BGR_Pos (0UL)              /*!< BLE_BLESS TRIM_LDO_1: ACT_REF_BGR (Bit 0)                 */
#define BLE_BLESS_TRIM_LDO_1_ACT_REF_BGR_Msk (0xfUL)            /*!< BLE_BLESS TRIM_LDO_1: ACT_REF_BGR (Bitfield-Mask: 0x0f)   */
#define BLE_BLESS_TRIM_LDO_1_SB_BGRES_Pos (4UL)                 /*!< BLE_BLESS TRIM_LDO_1: SB_BGRES (Bit 4)                    */
#define BLE_BLESS_TRIM_LDO_1_SB_BGRES_Msk (0xf0UL)              /*!< BLE_BLESS TRIM_LDO_1: SB_BGRES (Bitfield-Mask: 0x0f)      */
/* =================================================  BLE_BLESS.TRIM_LDO_2  ================================================== */
#define BLE_BLESS_TRIM_LDO_2_SB_BMULT_RES_Pos (0UL)             /*!< BLE_BLESS TRIM_LDO_2: SB_BMULT_RES (Bit 0)                */
#define BLE_BLESS_TRIM_LDO_2_SB_BMULT_RES_Msk (0x1fUL)          /*!< BLE_BLESS TRIM_LDO_2: SB_BMULT_RES (Bitfield-Mask: 0x1f)  */
#define BLE_BLESS_TRIM_LDO_2_SB_BMULT_NBIAS_Pos (5UL)           /*!< BLE_BLESS TRIM_LDO_2: SB_BMULT_NBIAS (Bit 5)              */
#define BLE_BLESS_TRIM_LDO_2_SB_BMULT_NBIAS_Msk (0x60UL)        /*!< BLE_BLESS TRIM_LDO_2: SB_BMULT_NBIAS (Bitfield-Mask: 0x03)*/
/* =================================================  BLE_BLESS.TRIM_LDO_3  ================================================== */
#define BLE_BLESS_TRIM_LDO_3_LVDET_Pos    (0UL)                 /*!< BLE_BLESS TRIM_LDO_3: LVDET (Bit 0)                       */
#define BLE_BLESS_TRIM_LDO_3_LVDET_Msk    (0x1fUL)              /*!< BLE_BLESS TRIM_LDO_3: LVDET (Bitfield-Mask: 0x1f)         */
#define BLE_BLESS_TRIM_LDO_3_SLOPE_SB_BMULT_Pos (5UL)           /*!< BLE_BLESS TRIM_LDO_3: SLOPE_SB_BMULT (Bit 5)              */
#define BLE_BLESS_TRIM_LDO_3_SLOPE_SB_BMULT_Msk (0x60UL)        /*!< BLE_BLESS TRIM_LDO_3: SLOPE_SB_BMULT (Bitfield-Mask: 0x03)*/
/* ==================================================  BLE_BLESS.TRIM_MXD  =================================================== */
#define BLE_BLESS_TRIM_MXD_MXD_TRIM_BITS_Pos (0UL)              /*!< BLE_BLESS TRIM_MXD: MXD_TRIM_BITS (Bit 0)                 */
#define BLE_BLESS_TRIM_MXD_MXD_TRIM_BITS_Msk (0xffUL)           /*!< BLE_BLESS TRIM_MXD: MXD_TRIM_BITS (Bitfield-Mask: 0xff)   */
/* =================================================  BLE_BLESS.TRIM_LDO_4  ================================================== */
#define BLE_BLESS_TRIM_LDO_4_T_LDO_Pos    (0UL)                 /*!< BLE_BLESS TRIM_LDO_4: T_LDO (Bit 0)                       */
#define BLE_BLESS_TRIM_LDO_4_T_LDO_Msk    (0xffUL)              /*!< BLE_BLESS TRIM_LDO_4: T_LDO (Bitfield-Mask: 0xff)         */
/* =================================================  BLE_BLESS.TRIM_LDO_5  ================================================== */
#define BLE_BLESS_TRIM_LDO_5_RESERVED_Pos (0UL)                 /*!< BLE_BLESS TRIM_LDO_5: RESERVED (Bit 0)                    */
#define BLE_BLESS_TRIM_LDO_5_RESERVED_Msk (0xffUL)              /*!< BLE_BLESS TRIM_LDO_5: RESERVED (Bitfield-Mask: 0xff)      */


#endif /* _CYIP_BLE_H_ */


/* [] END OF FILE */
